export const characters = [
  {
    id: "Reisen",
    name: "Reisen",
    alias: [
      "泠仙",
      "铃仙二号"
    ],
    introduction: "Reisen是东方Project的官方角色，首次登场于东方儚月抄。\n她是月兔，曾经负责捣年糕，现在成为了月球的防卫队“月之使者”的一员。\n在儚月抄之后，Reisen几乎再未在官方作品中出场过。\n",
    lifestyle: "Reisen是生活在月之都的月兔，她本来负责捣年糕（实际上捣的是蓬莱之药），因为厌恶这种工作而逃到地上[儚月抄小说6话]，返回月之都后成为绵月姐妹的宠物和月之使者。\n",
    abilities: "暂无相关资料",
    appearance: "Reisen有着一头晴朗蓝色齐脖短发，头顶有一对白色的兔耳朵。\n她有着紫棠色的眼瞳。\n她上身穿着白色衬衫，打着红色领带。衬衫外面穿着黑色的制服外套，制服两端袖口各有两颗金色纽扣，在儚月抄中制服用两颗纽扣扣住。\n她下身穿着白色短裙。\n她穿着黑色过膝袜和棕色皮鞋。\n",
    relationships: "逃到地上后受八意永琳之托给绵月姐妹送信，之后被绵月姐妹作为士兵兼宠物收入麾下，并和铃仙·优昙华院·因幡一样被称为Reisen。\n"
  },
  {
    id: "Teireida Mai",
    name: "丁礼田舞",
    alias: [
      "尬舞姐妹"
    ],
    introduction: "丁礼田舞是东方Project系列中的官方角色，首次登场于东方天空璋，担任天空璋的四面、EX面道中Boss和五面Boss。\n她原先是普通人类的孩子，现已不算是人类。八云紫称她“算是身处介于人类和妖怪的缝隙当中”[GoU]。\n她性格冒冒失失却很有行动力，和人类时期一样。[天空璋设定文档]\n她使用一般由男性使用的自称“僕”。\n她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "舞几乎丧失了仍是人类时的记忆，现在只会为了摩多罗隐岐奈而行动和狂喜乱舞。[天空璋设定文档]\n",
    abilities: "舞拥有通过在背后起舞来诱导出生命力程度的能力。\n",
    appearance: "舞有着一头灰绿色长发，鬓发及腰，脑后头发则齐耳。头戴帽尖朝右的风折乌帽。\n她有着绿色的眼瞳。\n她身穿深绿色短袖连衣裙，脖子戴着类似围嘴的白色布料，腰带和下身的围裙为白色，围嘴、腰带、围裙、裙摆有洋红色褶子。袖口和领子为黑色，袖口末端为洋红色。裙子正前方有一列金色扣子，围嘴、腰带上各有一个金色蝴蝶结，腰上前面用金线系着一个蝴蝶结，后面系着黑色大蝴蝶结。\n她穿着黑色及膝袜和绿色舞鞋。\n她右手拿着笹（细竹）。\n",
    relationships: "舞与尔子田里乃同为摩多罗隐岐奈的部下，两人是侍奉隐岐奈的二童子[天空璋]，隐岐奈的左右手。她完全为了隐岐奈而起舞，为了隐岐奈而行动，从来不会想到任何忤逆隐岐奈的事情。[天空璋设定文档]\n"
  },
  {
    id: "Mitsugashira Enoko",
    name: "三头慧之子",
    alias: [
      "三头慧乃子"
    ],
    introduction: "三头慧之子是东方Project系列中的官方角色，首次登场于东方兽王园。\n她是不死的山犬，因为吞吃日白残无的血肉而获得不死之身。\n她的立绘剪影与天火人血枪和孙美天一同出现在兽王园的封面上。\n在兽王园之后，慧之子几乎再未在官方作品中出场过。\n",
    lifestyle: "在活腻了之后，慧之子逃进了魔法森林[兽王园]，独自隐居于此。\n被日白残无唤醒后，在宝珠的作用下，慧之子从野兽变成了妖兽[兽王园]。\n在遇到骊驹早鬼后，她被早鬼怀柔而加入劲牙组。\n",
    abilities: "慧之子拥有操纵陷阱程度的能力。\n",
    appearance: "慧之子有着一头白色齐脖短发，略卷。头上有着一双蓝色犬耳。\n她有着红色的眼瞳。\n她上身穿着紫色露肩上衣，腰部有白色锯齿状图案，通过大臂固定着一圈白色半透明荷叶边。脖子上戴着紫色挂坠，上面有绿色的宝珠。\n她下身穿着粉色短裙，有渐变的七彩三角形图案“V”形环绕于裙上。\n脚腕上带着红色腿环，裸足。\n她身后有三条蓝灰色犬尾。\n她手腕上戴着红色捕兽夹，捕兽夹会随着她的手掌开合[角色设定]。\n",
    relationships: "慧之子曾撕咬日白残无的躯体、吞吃残无的血肉，并因此背负上永恒的诅咒，拥有了近乎永恒的寿命和不死之身。之后有一天，慧之子心里听到残无的呼唤而苏醒，按她所说吞下宝珠，被宝珠清除污秽成为货真价实的不死之身，又被残无下令吞噬地上的动物灵。之后，残无还向骊驹早鬼介绍了她。\n她被早鬼怀柔后，成为早鬼的部下，并被早鬼任命为劲牙组地上分队队长[兽王园]。早鬼对她颇为欣赏，盛赞她的风采堪比刻耳柏洛斯。\n雾雨魔理沙之前就知道有一只白色的山犬逃进了魔法森林里，并经常在魔法森林里看见她[兽王园]，对她很熟悉。慧之子也目击了魔理沙过去哭着逃进魔法森林的场面。\n"
  },
  {
    id: "Kamishirasawa Keine",
    name: "上白泽慧音",
    alias: [],
    introduction: "上白泽慧音是东方Project系列中的官方角色，首次登场于东方永夜抄，担任永夜抄的三面Boss和EX面道中Boss。\n她是后天性的半白泽兽人，半兽半人的妖怪。她平时为人类形态，看见满月就会变身为白泽。\n她某些方面有些固执且不近人情。[史纪]\n尽管身为妖怪，她却十分喜欢人类，因此站在人类一边，只为人类使用能力。[永夜抄设定文档]\n在永夜抄之后，慧音在官方游戏中少有出场，在官方出版物中偶有出场。\n",
    lifestyle: "慧音平时居住在人类村落中，是少数在人类村落里工作的妖怪之一。\n她每天都在编纂历史，这也是她的职责。[史纪]\n在117季，她得知人类村落存在秘密历史结社后，开办了只招收人类的寺子屋[文花帖（书籍）]，在白天以人类的身份担任老师。\n她很讨厌见面不问候的人类。[史纪]\n在满月之夜，会在变身白泽后将积攒了一个月的工作一夜间一口气做完[史纪]。\n",
    abilities: "慧音平时为人类形态，只要看到满月就会变身为白泽形态[史纪]。她在人类形态拥有吞噬（隐匿）历史程度的能力。\n她在白泽形态拥有创造历史程度的能力。\n此外，她拥有渊博的学识，更具备最为聪颖的头脑[史纪]。\n",
    appearance: "在人类形态时，她有着一头蓝白色及腰长发，头戴蓝色秀才帽，顶端装饰着巨大的红色蝴蝶结，在永夜抄中为三簇，在史纪中为两簇。\n在人类形态时，她在永夜抄中有着暗红色的眼瞳，在人妖名鉴中有着灰色的眼瞳。\n在人类形态时，她身穿蓝色长裙，衣领边缘为白色，衣领和裙摆均镂空，裙摆的镂空下有白色褶边。裙内穿白色短袖衬衫。胸前系着红色领巾。\n她脚穿白色三折袜和黑色鞋子，鞋子上装饰着红色蝴蝶结。\n",
    relationships: "她与藤原妹红是挚友，是为数不多的妹红的理解者[儚月抄]。\n慧音与稗田家的关系非常密切。尽管稗田阿求最初不打算去当老师[史纪]，但是后来仍然成为了慧音开的寺子屋的老师[文果真报]。\n"
  },
  {
    id: "Kotiya Sanae，",
    name: "东风谷早苗",
    alias: [],
    introduction: "东风谷早苗是东方Project系列中的官方角色，首次登场于东方风神录，担任风神录的五面Boss。\n她是从外面世界来的人类[口授]，是守矢神社的巫女、风祝与现人神。\n作为外面世界来的人类，她有点笨笨的，和幻想乡的人类有点差异[口授]，偶尔也会有呆呆的一面[神灵庙设定文档]，是那种所思所想都会写在脸上的人。[绀珠传访谈]刚进入幻想乡时很老实，此后就越来越放得开[绀珠传访谈]。\n在风神录之后，她还作为自机登场于东方星莲船、东方非想天则、东方神灵庙、东方绀珠传、东方虹龙洞、东方兽王园中，在官方出版物中也时有出场。\n",
    lifestyle: "早苗是妖怪之山上守矢神社的风祝，负责去山麓的人类村落传教收集信仰。\n在八坂神奈子命令下，她开始去降伏妖怪，从一开始的没有经验[星莲船角色设定]、不习惯[神灵庙角色设定]，渐渐变得习惯起来。\n为了融入幻想乡的生活，她很快变得不被常识所束缚[地灵殿]。\n作为理科生[神灵庙]，她憧憬着巨大机器人，梦想着坐上巨大人形机器人[非想天则]。\n",
    abilities: "早苗拥有引发奇迹程度的能力。\n她从小便精通仅由口授来传授的，代代单传的，引发呼云唤雨的奇迹的秘术。[风神录设定文档]\n作为八坂神奈子与洩矢诹访子的巫女，早苗能借用神奈子和诹访子的神力。\n由于没有人类信仰她，早苗被认为神力比较薄弱。[口授]\n",
    appearance: "早苗有着一头绿色长发，略卷，脑后头发在非想天则、口授中及腰，在其他作品中及胸。头顶戴着青蛙发饰，在风神录中可看出为发箍。左侧鬓发用青蛇（人妖名鉴中为白蛇）发饰扎成一束，长度从风神录到神灵庙及腰，从口授到兽王园及胸。在风神录、地灵殿、非想天则、茨歌仙、人妖名鉴中，左侧垂下的头发在脸左侧的高度有一个绿白色束发带，在星莲船中该位置则为红白色束发带。在茨歌仙中，头顶有像植物的苗一样的两撮呆毛。\n她的眼瞳在风神录、地灵殿中为黄色，在星莲船、神灵庙、绀珠传、虹龙洞、兽王园、茨歌仙、人妖名鉴中为绿色，在非想天则中为蓝色。\n她上身穿着白色露腋巫女服，有着与上衣在肩膀处分离的白色宽大袖子，袖子的两个边缘、衣领边缘、巫女服下摆和门襟均为蓝色，且在除茨歌仙、绀珠传和虹龙洞的作品中均有白色圆点和御币形花纹。在茨歌仙中，她还打着蓝色领带，上有一大一小两颗白色五角星。在绀珠传和虹龙洞中，蓝色部分内则是有由白点和白色V形图案组成的复杂图形。\n在兽王园中，她背后有一对接近透明的小型翅膀。\n她下身穿着蓝色裙子，花纹和上身的蓝色部分一致，有着白色荷叶边。裙子长度有缩短的趋势，绀珠传开始为短裙，之前为过膝的长裙，人妖名鉴中为及膝裙。在星莲船和求闻口授中，右腰挂着形似灵梦御币的白色挂坠。\n她在风神录、地灵殿中脚穿青色鞋子、白色短袜，在星莲船中脚穿蓝色鞋子、白色短袜，在茨歌仙、神灵庙中脚穿棕色短靴，在绀珠传、虹龙洞、兽王园、人妖名鉴中穿着棕色（虹龙洞中为深蓝色）皮鞋、白色及膝袜。\n在除了神灵庙以外的作品中，她右手拿着御币，在绀珠传、虹龙洞中由柄、两张白色矩形纸片组成，在其他作品中柄上还绑有1-4条纸条。柄在风神录、地灵殿、星莲船、求闻口授中为短柄，在绀珠传、人妖名鉴中为中柄，在非想天则、虹龙洞、兽王园中为长柄。\n",
    relationships: "早苗是八坂神奈子的巫女[风神录]，她用秘术引发的呼风唤雨的奇迹其实是由作为风神的神奈子引发的。\n她同样祭祀着洩矢诹访子，而且是诹访子的遥远的子孙[风神录]。\n她与博丽灵梦是相互竞争的巫女同行，两人经常在各方面较劲。同时，早苗也是博丽神社的常客。\n"
  },
  {
    id: "Toyosatomimi no Miko",
    name: "丰聪耳神子",
    alias: [
      "太子",
      "二婶子"
    ],
    introduction: "丰聪耳神子是东方Project系列中的官方角色，首次登场于东方神灵庙，担任神灵庙的六面Boss。\n她是圣人，生在马厩里的她是个打小就被人承认天赋异禀的天才，一个远远超越了人类的超级人物。之后她通过尸解与复活，成为了尸解仙。\n她在幻想乡所代表的宗教是道教，在幻想乡的立场偏向人类一方。\n神子的设计原型参考了日本古代飞鸟时期尊奉佛法，留下了很多的逸话与传说的著名政治家圣德太子。她的立绘剪影出现在了神灵庙的封面上。\n她性格洒脱轻浮，老爱开玩笑。但当直接与她面对面时不光容易露出纰漏，甚至有全部都被看透一样的感觉，会变成更多是敬畏的感觉。[口授]\n她本性正直，反感邪恶事物与妖魔邪道，内心想消灭世间的恶。会对幻想乡的人类及整个幻想乡的安危着想。\n她自我意识非常强烈，自信而争强好胜，在让自己看起来非同凡响这一点上跟圣白莲很相似，不过神子更有非凡感，登场后也在努力做非凡的事[人妖名鉴]。\n在神灵庙之后，神子还作为自机登场于东方心绮楼、东方深秘录、东方凭依华中，在官方出版物中也时有出场。\n",
    lifestyle: "神子原本复活所在的神灵庙在外面世界被佛教僧侣封印，不久前神子把灵庙搬入幻想乡内[神灵庙设定文档]\n1。在神灵骚动后，神子创造了一个仙界并将神灵庙迁至此处，建立的新的道场，之后大部分时候都在此修行至今。\n人类村落中想拜她为师修行仙术而前来的人十分之多，但似乎都只被神子用于打杂。[茨歌仙18话、口授]\n尽管早已成为了超越凡人的仙人，但她却还没完全对俗世的事断绝来往，偶尔还会介入人类社会的事，如贩卖四猿酱与向村民演讲。\n她也会去调查、解决一些异变。\n",
    abilities: "神子拥有能够同时听十人讲话程度的能力。\n这个能力带来的极强洞察力只不过是能体现神子超乎常人的能力之一，由于有着修习而来的道术傍身，她的实际力量不可限量。\n作为仙人，她拥有控制空间的仙术，她用这种仙术可以瞬间移动到任何地方[神灵庙]和破除永恒回廊的法术[深秘录]。\n神子拥有非常强大的威能，让东风谷早苗一度沉迷于道教中。[神灵庙]\n在弹幕狂们的黑市中，通过她的能力卡能散发执政者的气场抽掉部分敌弹。[弹幕狂们的黑市]\n",
    appearance: "神子有着一头黄褐色及肩短发，头顶有形似猫头鹰耳朵的两簇头发，头戴一边写有“和”字，一边写有“尊”字[醉蝶华52话]的紫色耳罩[口授、人妖名鉴]（一说耳机[神灵庙采访]）。\n她有着黄褐色的眼瞳。\n她身穿中间白上下泛红的无袖连衣裙，领子为黑色，门襟为粉色，上有紫色的“十二章纹”的装饰。在神灵庙、口授、人妖名鉴中，领子上用紫色丝带系着黑色的蝴蝶结。在心绮楼、深秘录、凭依华、人妖名鉴中，她还披着一件外紫内红的披风，边缘为金色，披风外侧靠下有金色围成的深紫色祥云状图案。\n她腰间挂着一把佩剑，剑柄尾部有太阳形状的金色装饰，剑鞘为黑色，上有金色装饰。\n她下身内侧穿着紫色及膝裙，在神灵庙、口授、人妖名鉴中，边缘挂着黑色镂空装饰，在深秘录、凭依华中紫色裙内又内衬白色白色蕾丝，边缘为锯齿状并有圆形镂空。\n她脚穿白色短袜和金色拖鞋，脚踝上戴着金色脚镯，拖鞋和脚镯都有复杂的镂空。\n她手腕上戴着和脚镯类似的手镯，手持一块笏板。\n",
    relationships: "与神子一同尸解的两位部下是物部布都与苏我屠自古，只是因为布都做的手脚，只有布都成功复活，而屠自古则成为了亡灵。\n霍青娥是神子的友人，教会了神子“道”，对神子来说是像是师父一样的人[口授]。神子成为仙人，也是因为当初青娥向她进言道教。\n作为幻想乡的道教“领头人”的同时因为过去身份、能力及与佛教徒的矛盾，她与命莲寺的妖怪住持圣白莲是敌人、竞争对手的关系。\n秦心是神子曾经的部下秦河胜所使用的、神子亲手制作[心绮楼]的面具化作的面灵气。\n"
  },
  {
    id: "Tsukumo Yatsuhashi",
    name: "九十九八桥",
    alias: [],
    introduction: "九十九八桥是东方Project系列中的官方角色，首次登场于东方辉针城，担任辉针城的四面Boss和EX面道中Boss。\n她是在少名针妙丸万宝槌魔力的影响下新诞生[辉针城访谈]的古琴的付丧神。后来将力量之源由万宝槌的魔力变为外面世界的魔力，避免了万宝槌的魔力被回收后重新变回普通道具的结果。\n她性格争强好胜却少根筋。\n她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "暂无相关资料",
    abilities: "八桥拥有自行发声演奏程度的能力。\n魔力来源最开始是万宝槌的魔力，后来替换成了外面世界的魔力。\n",
    appearance: "八桥有着一头棕色及肩短发，戴着有黑色折线条纹的紫色发箍。\n她有着棕色的眼瞳。\n她上身穿着白色长袖衬衣，领口、衣服正中央的门襟和袖口为淡紫色，门襟和袖口上有黑色折线条纹。中指和食指上戴着红色指套。\n她下身穿着黑色短裙，裙摆有紫色折线条纹，裙内有白色内衬。在辉针城中，七根红色光线作为琴弦环绕着裙子。在人妖名鉴中，六根橙红色光线悬浮在八桥身前作为琴弦，且与弁弁的四根琵琶弦连在一起。背后系着紫色大蝴蝶结。\n裸足。\n",
    relationships: "八桥扮演九十九弁弁妹妹的角色，二人虽然以姐妹相称，但其实只是因为她们是在同一时期在少名针妙丸的万宝槌魔力的影响下成为付丧神，并无血缘关系[辉针城设定文档]。二人组成人气不断上涨的弦乐二重唱组合「九十九姐妹」，被射命丸文称赞为“女子二乐坊”[文果真报]。\n在八桥担心万宝槌魔力被回收导致自己变回古琴时，堀川雷鼓向八桥伸出援手，向她传授了将力量之源替换为外面世界魔力的方法，使八桥避免了变回去的结果。\n"
  },
  {
    id: "Tsukumo Benben",
    name: "九十九弁弁",
    alias: [],
    introduction: "九十九弁弁是东方Project系列中的官方角色，首次登场于东方辉针城，担任辉针城的四面Boss和EX面道中Boss。\n她是在少名针妙丸万宝槌魔力的影响下新诞生[辉针城访谈]的古琵琶的付丧神。后来将力量之源由万宝槌的魔力变为外面世界的魔力，避免了万宝槌的魔力被回收后重新变回普通道具的结果。\n她性格冷静成熟。\n她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "暂无相关资料",
    abilities: "弁弁拥有自行发声演奏程度的能力。\n魔力来源最开始是万宝槌的魔力，后来替换成了外面世界的魔力。\n",
    appearance: "弁弁有着一头淡紫色及腰长发，系着下双马尾。右侧头戴有着绿叶的白色花形头饰。\n她有着淡紫色的眼瞳。\n她身穿白色长袖、暗铜色连衣裙，背后有个V形开口，裙摆透明，略带淡紫色，且未至膝盖。领口系着黑色带子，领子及裙子上边缘为黑色。\n裸足。\n她手持以四根悬浮且长度远超出正常琵琶弦的光线作为弦、没有颈部（鶴首）的平家琵琶，琴身以金色锁链连着左手腕。在辉针城中，光线为红色。在人妖名鉴中，光线为橙红色且与八桥的六根琴弦连在一起。\n",
    relationships: "弁弁扮演九十九八桥姐姐的角色，二人虽然以姐妹相称，但其实只是因为她们是在同一时期在少名针妙丸的万宝槌魔力的影响下成为付丧神，并无血缘关系[辉针城设定文档]。二人组成人气不断上涨的弦乐二重唱组合「九十九姐妹」，被射命丸文称赞为“女子二乐坊”[文果真报]。\n在弁弁担心万宝槌魔力被回收导致自己变回古琴时，堀川雷鼓向弁弁伸出援手，向她传授了将力量之源替换为外面世界魔力的方法，使弁弁避免了变回去的结果。\n"
  },
  {
    id: "Hutatsuiwa Mamizou，",
    name: "二岩猯藏",
    alias: [],
    introduction: "二岩猯藏是东方Project系列中的官方角色，首次登场于东方神灵庙，担任神灵庙的EX面Boss。\n她是从外面世界的佐渡来到幻想乡的妖怪狸，却害怕外面的人类[凭依华]。\n她有着作为首领的威严和领导风范[口授]，常会有些老气横秋的言行，并且具有强烈的自我表现欲[人妖名鉴]。\n在神灵庙之后，猯藏还作为自机登场于东方心绮楼、东方深秘录、东方凭依华和东方兽王园中，在官方出版物中也经常出场。\n",
    lifestyle: "猯藏是妖怪狸的首领[口授]，过去生活在外面世界的佐渡，她已经完全融入人类社会，偶尔会耍点小蒙小骗，碰到穷人也会接济一下，若有人交给她些活干也会完成得很好[神灵庙]；现在她则已在幻想乡定居，并成为幻想乡妖怪狸和付丧神的领袖。\n她最近一千年有了点老花眼[醉蝶华]，所以戴着眼镜。\n",
    abilities: "猯藏拥有施展变化程度的能力。\n她抽的烟可以让低级妖怪现出原形，这也是她抽烟的目的。[铃奈庵、醉蝶华]\n她可以命令部下的妖怪狸帮自己办事和战斗。[弹幕狂们的黑市]\n",
    appearance: "猯藏有着一头红棕色及肩短发，头上长着一对狸猫耳，戴着一片绿叶，在心绮楼、深秘录、凭依华中绿叶似帽子，上有金色的蝴蝶结与两个铃铛。\n她有着红棕色眼瞳，戴着圆框眼镜。\n她上身穿着浅棕色围裙（颜色在各作之间有一定差别），肩上披着披肩，在神灵庙中为浅粉色，在兽王园中为浅黄色，在其他作品中为白色。围裙边缘和披肩边缘在兽王园中有白色褶子，在其他作品中有锯齿状带镂空的白色花边（心绮楼围裙边缘为围裙颜色）。\n在人妖名鉴中，她腰缠深棕色腰带。\n她下身穿着红棕色及膝裙，上面有复杂的图案，在兽王园中由绿渐变至红，在其他作品中与围裙同色。裙内穿及膝灯笼裤。\n她在神灵庙、兽王园中赤脚穿一双草鞋，在口授中赤脚，在深秘录、凭依华、人妖名鉴中穿红色鞋带的黑色厚底木屐，形似「おこぼ」，在深秘录、凭依华中鞋带上各挂着一个铃铛。\n她身后长着一条又粗又长的深棕色与浅棕色相间的狸猫尾巴。\n在神灵庙中，她左手用黑色手环吊着酒坛，右手用黑色手环吊着一本手账，在口授中酒坛被卸了下来，在心绮楼中酒坛和手账则直接用白色绳子挂在手臂上，在深秘录、凭依华、人妖名鉴中则挂在腰间，同时左手持一烟斗。在兽王园中，她右手持烟斗，用尾巴托着酒坛。\n",
    relationships: "猯藏在来到幻想乡后，很快成为幻想乡妖怪狸们的首领。\n作为妖怪狸，她与妖怪狐合不来，和幻想乡里的狐狸们会掐起来。[神灵庙设定文档、茨歌仙]\n她与封兽鵺是老朋友，因为自己的能力，在某种程度上和鵺臭味相投。[神灵庙]\n她与宇佐见堇子曾在外面世界的街上遇到并一起逛街游乐。[文果真报]\n"
  },
  {
    id: "Kumoi Ichirin",
    name: "云居一轮",
    alias: [],
    introduction: "云居一轮是东方Project系列中的官方角色，首次登场于东方星莲船，担任星莲船的三面Boss。\n她是从人类变成的入道使，被稗田阿求认为属于一种魔法使[口授]，拥有驱使入道的能力，能够驱使入道云山。\n她性格老实，头脑明晰机智，脑子转得快，同时沉着冷静，因此能够操纵头脑顽固的云山。\n在星莲船之后，一轮还作为自机登场于东方心绮楼、东方深秘录和东方凭依华中，在官方出版物中也时有出场。\n",
    lifestyle: "在间歇泉骚动之前，一轮被封印在地底的旧地狱。[心绮楼]\n间歇泉骚动结束后，她居住在命莲寺，会负责处理一些体力劳动和高空作业。[口授]\n",
    abilities: "一轮拥有驱使入道程度的能力。\n实力相当强大。[口授]\n",
    appearance: "一轮有着一头蓝色过肩短发，略卷。头戴长度及胸的蓝色头巾。\n她有着蓝色的眼瞳。\n她上身穿着白色长袖，在心绮楼、深秘录、凭依华中脖子上戴着一个红色珠子的项链。在心绮楼、深秘录、凭依华、人妖名鉴中，披着一件有着金色线条的棕色袈裟。\n她下身穿着白色过膝长裙，裙摆为蓝色，分界处形似山的轮廓。\n她脚穿灰色四分之三袜和黑色短靴，靴筒和靴面的连接处有红色环收束。在格斗作的像素绘中，仅穿足袋，但红色环仍在脚踝处。\n除人妖名鉴的作品中，右手拿金色圆环。在人妖名鉴中，双手合十，拿着一串红色佛珠。\n",
    relationships: "云山守护着一轮，一轮能驱使、操纵云山，作为自己的监视眼。\n她与村纱水蜜、娜兹玲和寅丸星是朋友，都十分景仰圣白莲。一轮皈依在白莲门下，称白莲为“姐姐”[星莲船]。\n她和物部布都在完全凭依异变时组队。两人起初为争夺主役而争吵，最后一度与云山一起成为最强三人组，但在与依神姐妹对战时打了个同室操戈后绝交。[凭依华]\n"
  },
  {
    id: "Unzan",
    name: "云山",
    alias: [],
    introduction: "云山是东方Project系列中的官方角色，首次登场于东方星莲船，担任星莲船的三面Boss。\n他是见越入道，由云变化而成的僧侣妖怪。作为见越入道，当他袭击人时，一开始人只能看到脚下，但人当想看他的脸时，无论怎么抬头，却只能发现他的脸在逐渐变大，怎么也无法看到，最后他会将那个向着脸的头砍下来。不过，现在他已经不做见越入道这样的事了。\n他沉默寡言，头脑顽固，不怎么说话，却内心十分善良，有重视情谊的一面。他讨厌拐弯抹角的家伙，喜欢正直的人。并不严厉，不喜欢欺负弱者[心绮楼]。\n在星莲船之后，还作为自机登场于东方心绮楼和东方深秘录中，在官方出版物中也偶有出场。\n",
    lifestyle: "在间歇泉异变之前，云山被封印在地底的旧地狱。[心绮楼]\n他平时居住在命莲寺，会负责处理一些体力劳动和高空作业。[口授]\n尽管皈依佛门，他却不守酒戒，会参加宴会并在宴会上就着兽肉喝酒。[口授]\n",
    abilities: "云山拥有自由改变形状大小程度的能力，博丽灵梦称之为变形程度的能力。\n此外，云山还可以从眼睛里射激光[GoU]。\n",
    appearance: "云山由粉红色云组成，有着严肃的男性老年僧人面孔和一双拳头。\n",
    relationships: "云山守护着云居一轮，一轮能驱使、操纵云山，作为自己的监视眼。\n他与村纱水蜜、娜兹玲和寅丸星是朋友。\n他十分景仰圣白莲，并皈依在白莲门下。\n"
  },
  {
    id: "Imaizumi Kagerou",
    name: "今泉影狼",
    alias: [],
    introduction: "今泉影狼是东方Project系列中的官方角色，首次登场于东方辉针城，担任辉针城的三面Boss。\n她是在外面的世界已经绝种的日本狼的狼女。\n她性格非常沉稳，以至于即使变身为狼也一样不会丧失冷静。因为被万宝槌魔力影响，一度变得凶暴，在被教训后重新变得温顺。\n她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "由于能力的缘故，影狼平常都遮住皮肤，一个人静静地生活在迷途竹林里。\n",
    abilities: "影狼拥有在满月之夜变身为狼程度的能力，变身之后实力变强。\n她不擅长战斗。[交叉评论]\n她可以召唤出狼的影子，并指挥它们扑向某个特定目标。[GoU]\n",
    appearance: "影狼有着一头棕褐色及腰长发，略卷，头上长着一对狼耳。\n她有着红色的眼瞳。\n她身穿上白下红的长裙，在辉针城中裙摆及地，在人妖名鉴中裙摆过膝。裙子红与白的分界线为从腰向下的一圈椭圆，裙摆、袖口为灰黑色，裙摆有黑色叶脉状线条。脖子上用红色宝石饰物系着灰黑色衣领。\n在辉针城中，袖口处露出黑色毛发，这是因为她在满月之夜的时候全身体毛会变多[辉针城设定文档]，不过在人妖名鉴中她的立绘并未体现出体毛多。\n裸足，趾甲为红色且没有留长。\n她留着红色的长指甲。\n",
    relationships: "影狼与若鹭姬是在互助组织“草根妖怪网络”上认识的[辉针城]友人。\n"
  },
  {
    id: "Ibuki Suika",
    name: "伊吹萃香",
    alias: [
      "西瓜"
    ],
    introduction: "伊吹萃香是东方Project系列中的官方角色，首次登场于东方萃梦想。\n她是在鬼族于幻想乡消失很长一段时间后，再次出现的鬼。\n因为名字在日语中与西瓜谐音，也常常被爱好者们称作“西瓜”，有相当多的二次创作将伊吹萃香与西瓜联系在一起。\n性格很开朗且喜欢酒。天真而且非常单纯。和一大群人在一起，会使气氛变得很快活，而只有两个人在一起，长时间的话会逐渐变烦。或者说非常孩子气。[萃梦想设定文档]\n不怎么说谎，但在鬼之中是有些自私不那么诚实的[萃梦想]。\n非常喜欢热闹，总是找别人开宴会。[史纪]\n虽然醉醺醺的，但很直率[人妖名鉴]。\n在萃梦想之后，萃香还作为自机登场于东方绯想天、东方非想天则中，在官方出版物中也时有出场。\n",
    lifestyle: "萃香曾经居住在地底的旧都[地灵殿]，目前定居在幻想乡，但居所不明，行踪不定[地灵殿设定文档]。其住处常被称作“鬼所居住之国”[萃梦想设定文档]。\n虽然是鬼族的一员、山之四天王之一，但现在萃香并不会捉走人类，而是更喜欢找人类、妖怪开宴会[史纪]。她认为即使自己想袭击人类，也不可能明目张胆在人类村落袭击[醉蝶华]。\n她整日都在喝酒，随身携带着名为伊吹瓢的酒葫芦。一般情况下都是醉醺醺的。\n她是博丽神社宴会上的常客，在蚕食鲵吞亭开业后也常去蚕食鲵吞亭喝酒。\n",
    abilities: "萃香拥有操纵密和疏程度的能力和操纵密度程度的能力。\n她的肉搏能力强大。\n作为鬼，她酒量很大，无时无刻不在喝酒，但说话却又显得清醒直率。\n她拥有的酒葫芦“伊吹瓢”是鬼宝，看上去很普通，却能无限涌出酒。[萃梦想]\n",
    appearance: "萃香肤色偏白，身高体型接近一般幼童，形象不同于传统的鬼。\n她有着一头及肩长发，在萃梦想、绯想天、非想天则、ZUN设定画中为橘棕色，在人妖名鉴、兽王园中为棕黄色，左鬓角有束白布条绾着的低马尾，右鬓是一束细发，额上是直刘海，略微中分。脑后系着巨大的红色蝴蝶结，发尾用白布带和短棍束住，上面连有锁链，锁链在兽王园中为黑色，在除兽王园外的其他作品中为银色，锁链末端连接代表自身能力的几何物块，头顶两侧生有极大的一对棕色骨质长角，左侧的角上系着紫罗兰色的布片饰品，右侧的角上除兽王园外有白色螺旋状线形物体缠绕，在兽王园中则缠绕着绿色的藤蔓。\n她在兽王园中有着红色的眼瞳，在除兽王园外的其他作品中有着橘棕色的眼瞳，在史纪、人妖名鉴中左侧长着虎牙。\n她上身穿着白色无袖衬衫，袖口像被撕开了一样参差不齐，脖子上用红色布带系着蝴蝶结。\n她腰间穿着有金属光泽的带环腰带，同样连接着锁链。在史纪、人妖名鉴中，腰上的锁链连着贴有符的紫色酒葫芦“伊吹瓢”。\n她下身从外到内穿着三层套裙，分别为：超短纱裙、紫罗兰色镶边白色花纹短裙、带白色火焰花纹和红色丝带串边的深紫色长裙。\n她脚穿着白色三折袜和带有洋红色蝴蝶结的黑色皮鞋。\n她双手手腕处戴着手铐，手铐内有较大纱制内衬，外连锁链。末端同样连接有代表自身能力的几何物块，在ZUN设定画中左手锁链连接着黄色圆球，右手锁链连接着红色三角锥，分别象征着无与调和[东方书谱]。\n",
    relationships: "萃香和茨木华扇[茨歌仙]、星熊勇仪[地灵殿]与八云紫[萃梦想]是旧识，和勇仪、华扇同为山之四天王之一。曾经四天王一同住在妖怪之山，现在已经各自分散。\n因为常常去博丽神社的原因，萃香和博丽灵梦与雾雨魔理沙熟识。\n天气异变发生期间，她击败并结识了比那名居天子，形成了酒友般的关系。\n历史上鬼曾经统治过天狗[史纪]，所以萃香和天狗们保持着微妙的联系，不冷不热。\n奥野田美宵在最近被萃香允许[醉蝶华]住在伊吹瓢里，萃香认为美宵是自己的醉魔[醉蝶华3话]。\n"
  },
  {
    id: "Yorigami Jyoon",
    name: "依神女苑",
    alias: [],
    introduction: "依神女苑是东方Project系列中的官方角色，首次登场于东方凭依华。\n她是疫病神，很容易被人喜欢上，但结果往往会给周遭招来不幸和怨恨。她会凭依在持有财产的人类身上，对其降下不幸，因此她也可以被称作是操纵财祸的神。\n她支配欲很强，很傲慢，毫无自制力。[凭依华设定文档]\n在凭依华之后，女苑还作为自机&敌机登场于东方刚欲异闻中，在官方出版物中也偶有出场。\n",
    lifestyle: "女苑会不断通过花言巧语来凭依在对象身上，使其像是出于自身意识一般挥霍财产，运气也随之变差，最后变成一具空壳。在吃干抹尽一个人的财产后，又会为寻求下一个人类而继续徘徊，重复着这一循环。[凭依华设定文档]\n",
    abilities: "女苑拥有使人消耗财产程度的能力。\n",
    appearance: "女苑有着一头稻草色及肩卷发，用红色蝴蝶结系成螺旋双马尾，马尾末端也扎着红色蝴蝶结。在凭依华和人妖名鉴中头戴黑色小礼帽，上面系着白色蝴蝶结。在刚欲异闻中头戴白色头巾，上面系着红色蝴蝶结。\n她有着黄色的眼瞳，在凭依华和人妖名鉴中戴着蓝色宝石耳坠。\n在凭依华和人妖名鉴中，她身穿白色连衣裙，裙摆有一圈红线，系着红色蝴蝶结；身披紫色外套，上有白色蔷薇和十字状图案；脖子上戴着蓝色宝石项链，手腕戴着金色手镯。在刚欲异闻中，她身穿中东风格的白色长袍，领口、袖口为金色，脖子上戴着有三颗绿色宝石和两颗蓝色宝石的项链。\n在凭依华和人妖名鉴中，她腰上系着黑色腰带。在刚欲异闻中，她腰上系着粉色丝带，并用一根金色绳子串起绿、蓝、红等颜色的宝石。\n她脚穿棕色长筒靴。\n在凭依华和人妖名鉴中，她背后有三簇金色灵气。\n她手指上戴着宝石指环。在凭依华中，左手提金色提包。在人妖名鉴中，右手提金色提包。\n",
    relationships: "女苑是依神紫苑的妹妹，看不起自己这个姐姐。\n在完全凭依异变后的一段时间内，女苑曾在命莲寺跟随圣白莲修行。[凭依华]\n"
  },
  {
    id: "Yorigami Shion",
    name: "依神紫苑",
    alias: [],
    introduction: "依神紫苑是东方Project系列中的官方角色，首次登场于东方凭依华。\n她是贫穷神，因此被所有人讨厌，但实际上她是借由让他人陷入贫穷，来保护他人免受财祸之苦的守护神。\n她性格阴沉又低三下四，喜欢坐享其成。[凭依华设定文档]\n在凭依华之后，紫苑还作为自机&敌机登场于东方刚欲异闻中，在官方出版物中也偶有出场。\n",
    lifestyle: "紫苑因为能力的原因无法摆脱贫穷，整天无精打采。[凭依华设定文档]\n作为贫乏神，她最喜欢的就是烤味噌的味道。[醉蝶华]\n",
    abilities: "紫苑拥有向包含自己的一切对象降下不幸程度的能力。\n",
    appearance: "紫苑有着一头深蓝色及膝长发，与散发出的气场融为一体，略卷。头顶系着深蓝色蝴蝶结，贴着催债信、抵押封条等文件。\n在凭依华和人妖名鉴中，她上身穿着灰色短袖帽衫，帽衫上同样贴着催债信、抵押封条等文件，两只手腕上各戴着一只金色手镯。在刚欲异闻中，她身穿中东风格的白色长袍，上面也贴着催债信、抵押封条等文件，袖口系着红色丝带。\n在凭依华和人妖名鉴中，她下身穿着蓝色短裙，同样贴着催债信、抵押封条等文件。\n裸足。\n在凭依华和人妖名鉴中，她右手挽着一个黑猫玩偶。在凭依华中，她右手还拿着一只破碗。\n在凭依华中，她浑身散发出蓝色的气场。在人妖名鉴中，她周围有紫色的气场，形成“厄”“损”等字。\n",
    relationships: "紫苑是依神女苑的姐姐，却被这个妹妹看不起，在妹妹面前也抬不起头。\n紫苑在完全凭依异变后的一段时间内曾与比那名居天子结伴。[凭依华、茨歌仙]\n"
  },
  {
    id: "Elis",
    name: "依莉斯",
    alias: [
      "依莉丝"
    ],
    introduction: "暂无相关资料",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Clownpiece",
    name: "克劳恩皮丝",
    alias: [
      "小妖精",
      "皮丝",
      "美国"
    ],
    introduction: "克劳恩皮丝是东方Project系列中的官方角色，首次登场于东方绀珠传，担任绀珠传的五面Boss。\n她是地狱的妖精，是最疯狂级别的妖精。\n她的原型是希腊神话中赫卡忒部下的妖精拉姆帕德斯。[绀珠传访谈]\n性格是很典型的妖精的性格，与其他妖精一样喜欢恶作剧与玩耍。\n在绀珠传之后，皮丝还作为主要角色登场于东方三月精V中，在其他官方游戏和出版物中也偶有出场。\n",
    lifestyle: "皮丝最初居住在地狱。\n在绀珠传期间她被带到月面的静海，在静海与其他地狱的妖精玩耍。\n在绀珠传之后她被派往幻想乡居住，不久选择了博丽神社的地板下作为居所。\n她在与光之三妖精熟识后经常与她们一起行动，进行恶作剧等活动。\n",
    abilities: "皮丝拥有使人发狂程度的能力，可以用火把令人疯狂。\n皮丝也可以发射虚假之月的弹幕来攻击目标。[秘封噩梦日记、弹幕狂们的黑市]\n",
    appearance: "皮丝有着一头金色及腰波浪卷发，戴着紫色小丑帽，上面有正反各25个白色圆点，帽子末端在绀珠传中有绿色小球，在人妖名鉴中有白色绒球。\n她有着红宝石色的眼瞳。\n她身穿与美国国旗的图案类似，左为蓝底星图案，右为红白条纹的短袖连衣短裙，其中红色条纹共13条，领口有形似小丑服的拉夫领。\n她身后长着一对昆虫般的透明翅膀。\n她腿穿左右颜色、图案与裙子相反的裤袜，红色条纹也为13条。不穿鞋。\n她左手举着一只火把，底端用白色布条缠绕，火焰为红色，烟为紫色。\n",
    relationships: "皮丝是赫卡提亚·拉碧斯拉祖利的部下。她称呼赫卡提亚为“主人”，对赫卡提亚很忠诚的同时也有自己的主见。\n从赫卡提亚与纯狐联手后直到东方绀珠传中的故事为止的这段时间内，皮丝被赫卡提亚交给纯狐随意差遣，与其他地狱的妖精一起被纯狐纯化而觉醒，力量大幅增强。皮丝称呼纯狐为“朋友大人”。\n在绀珠传之后，皮丝被赫卡提亚派往幻想乡居住，结识了光之三妖精桑尼米尔克、露娜切露德、斯塔萨菲雅，之后经常与她们一起玩耍和恶作剧。后来，还先后结识了琪露诺、爱塔妮缇拉尔瓦等妖精。\n"
  },
  {
    id: "Yakumo Yukari",
    name: "八云紫",
    alias: [
      "BBA",
      "紫妈",
      "老太婆"
    ],
    introduction: "八云紫是东方Project系列中的官方角色，首次登场于东方妖妖梦，担任妖妖梦的PH面Boss。\n她是幻想乡最古老的妖怪[地灵殿]，也是曾参与创立幻想乡的妖怪贤者之一，一直以来暗中维护着幻想乡的安全与稳定。\n她极端不吉，样子形迹可疑，性格无法信任[妖妖梦Music Room]、冷静[绯想天角色介绍]、性格无法理解，大家都认为她不是好东西，行为原理与人类完全相异。但是，恐怕也没有像她一样真挚地对待幻想乡、爱着幻想乡的人了。[萃梦想设定文档]。\n在妖妖梦之后，还作为自机登场于东方萃梦想、东方永夜抄、东方绯想天、东方非想天则、东方凭依华中，在官方出版物中也时有出场。\n",
    lifestyle: "紫大部分时间都在幻想乡艮之境[妖妖梦]的住所中睡觉。\n她极为神出鬼没，且容易被人疏远[绯想天角色介绍]。\n作为幻想乡的贤者，她管理着妖怪与生物进出幻想乡，并通过座敷童子监视着人类村落。[东方茨歌仙]\n",
    abilities: "紫拥有操纵界线程度的能力。\n此外，紫拥有超人的头脑、强大的数学水平、丰富的知识与经验。\n紫的身体能力也和妖怪一样，即身体比人类更结实，就算身体变得四分五裂的样子，也能很快恢复[史纪]。\n",
    appearance: "紫属于身长高[ZUN的邮件答复]的角色，外表和人类没有区别[史纪]。\n她有着一头金色及腰长发，略卷，在萃梦想中盘起头发。在妖妖梦、萃梦想、永夜抄、绯想天、非想天则、人妖名鉴中，两鬓的头发末端系着红色蝴蝶结，此外身后的头发也戴着几个蝴蝶结。头戴白色荷叶边洋帽，前面用红色丝带系着大蝴蝶结。\n她在妖妖梦中有着紫色的眼瞳，在其他作品中有着黄色的眼瞳。\n她在妖妖梦、求闻史纪、儚月抄中，身穿西式紫色短袖礼服，内穿白色衬衫。在其他作品中，身穿白色长袖长裙（贤者服），裙子下半部分有许多层荷叶边，大臂处系着红色丝带，身前披着东方式紫色道袍，上面有红色的阴符号和黑色的上兑下坤的卦象，最底下为橙色，并有紫色与橙色两色的太极图。\n她脚穿白色有褶边的袜子，在妖妖梦中褶边上有橙色点状图案，穿着白色鞋子，鞋子上用红色丝带绑住；在永夜抄中，穿着黑色鞋子。\n在妖妖梦、求闻史纪、儚月抄、人妖名鉴中，紫戴着白色过肘手套。她在妖妖梦中左手持折扇，右手撑着白色大阳伞，伞边缘挂着一圈红色丝带，伞柄为黑色。在求闻史纪中，双手拄着伞并拿着折扇，伞柄为白色。在人妖名鉴中，双手撑着伞，伞柄为红色。在绯想天、非想天则中，双手撑开隙间。\n",
    relationships: "八云蓝是紫的式神，蓝对紫十分忠诚，是紫的得力助手。\n橙作为她式神的式神，对她则非常尊重。\n她是西行寺幽幽子的故知，在幽幽子生前就认识幽幽子，也知道幽幽子以死封印西行妖。[妖妖梦设定文档]\n她与伊吹萃香是旧识。[东方萃梦想]\n她与摩多罗隐岐奈同为幻想乡的贤者[天空璋]。\n她与博丽灵梦是好友，两人共同维护幻想乡的秩序。除了灵梦之外没有认真和她相处的人。[萃梦想设定文档]\n她将茨木华扇视为自己“这边的人”，认为华扇与自己理念一致，但华扇并不承认。[茨歌仙]\n"
  },
  {
    id: "Yakumo Ran",
    name: "八云蓝",
    alias: [
      "素果天狐",
      "蓝妈"
    ],
    introduction: "\n八云蓝是东方Project系列中的官方角色，首次登场于东方妖妖梦，担任妖妖梦的EX面boss和PH面道中boss。\n蓝是凭依在九尾妖狐上的式神，而这只妖狐却是另一只妖怪（但是也被称为“八云蓝”）。这只妖狐有着强大的魔力，达到了妖兽的最高峰。虽然凭依着最强妖兽，她却性格温和，不会为了自己而争斗。\n她被八云紫用于负责各种杂事。同时，她也能使役包括橙在内的多个式神和创造新的式神。\n她的原型是日本传说中的“玉藻前”，ZUN甚至暗示她就是这只祸乱三国的九尾妖狐[妖妖梦]。\n在妖妖梦之后，长期作为八云紫的符卡登场，还作为自机登场于东方兽王园中，也在官方出版物中时有出场。\n",
    lifestyle: "动物灵蓝曾在畜生界活动，后因受不了畜生的思想而离开畜生界前往地上[兽王园]，但是仍然关心着畜生界，当畜生界有事相拜托时也会回去帮忙[香霖堂]。\n目前八云蓝和八云紫同住在幻想乡艮之境[妖妖梦]的住所里。\n作为紫的式神，她常常代替紫在幻想乡行动，负责各种杂事和完成紫的命令。\n她非常喜欢油炸豆腐，会去人类村落里买油炸豆腐。\n她喜欢摆弄电子计算机。[香霖堂]\n",
    abilities: "蓝拥有使役式神程度的能力，能役使包括橙在内的多个式神。\n此外，蓝也能自己做出式神[妖妖梦]。\n蓝还拥有着相当高的智力，尤其擅长数学，能瞬间完成人类所无法想象程度的计算[史纪]。曾为了打发时间而计算出三途河的河宽[文花帖（书籍）]。\n",
    appearance: "蓝属于身长较高[ZUN的邮件答复]的角色。\n她有着一头黄色齐脖短发，头上长着一对狐狸耳朵，戴着一顶白色帽子遮住了耳朵。帽子上贴着许多黄色符纸，在兽王园中上面有红色图案。帽子边缘有荷叶边，两侧顶端各有一个绒球和穗子，绒球和穗子在妖妖梦中为淡蓝色，在人妖名鉴和兽王园中为白色。\n她有着黄色的眼瞳。\n她身穿白色长袖长袍，身前披着长到小腿的蓝色布料，有着白色花纹，整体形似道袍，在人妖名鉴中，布料两角有绿色绒球和穗子。袖子边缘和衣领为紫色，并打着白色褶子。\n在妖妖梦中，她脚穿白色短袜，脚腕上有蓝色脚环，腿环打着白色褶子。在求闻史纪和人妖名鉴中，她脚穿白色短靴。\n她身后有九条金色尾巴，尾巴尖为白色。\n她平时总是把手对插进袖子里，不过在兽王园中，她挽起右臂的袖子，右手拿着一张猫形符纸，上面有红色图案，里头装着橙[兽王园]。\n",
    relationships: "蓝是八云紫的式神。蓝对紫十分忠诚，是紫的得力助手。蓝本来只叫蓝，被紫收为式神后改名为“八云蓝”。\n橙是蓝的式神。蓝对橙则很好，会因为自机欺负橙而报复[妖妖梦]。\n饕餮尤魔和动物灵蓝是曾在畜生界一起生活的旧识。动物灵蓝因为厌倦了畜生思想而离开。[兽王园]\n"
  },
  {
    id: "Yasaka Kanako",
    name: "八坂神奈子",
    alias: [
      "神妈"
    ],
    introduction: "八坂神奈子是东方Project系列中的官方角色，首次登场于东方风神录，担任风神录的六面Boss和EX面道中Boss。\n神奈子是来自外面世界的大和神，是守矢神社名义上祭祀的大国主的儿子“建御名方神”，是战神[儚月抄]，实际上又是风雨之神，现在也是山之神明[口授]，还被当作农业之神祭祀，并打算慢慢转型为技术革新之神[口授]。\n她的性格非常专横并且以自我为中心[口授]，而看起来十分可靠。\n她大大咧咧的，有着爽快的性格，因此与魔理沙相当地合得来[风神录]。\nZUN在采访中称将神奈子设定成了蛇一般的性格，即十分狡猾，擅长欺骗人，并有二枚舌1的印象[风神录采访]。\n她特别喜好技术革新，有不重视传统的倾向，不管什么样的信仰都有在收集。[口授]\n她似乎很容易生气，但是对礼物没有抵抗力。[口授]\n在风神录之后，神奈子还作为自机&敌机登场于东方刚欲异闻中，并多次为东风谷早苗提供支援，在早苗线结局中经常出场。在官方出版物中，作为守矢神社的代表时有出场。\n",
    lifestyle: "神奈子从洩矢诹访子手中夺得洩矢之国后，因未被接受、没有得到信仰心，而放弃王国的所有权并借来诹访子的力量君临了山里。[风神录]\n现在她居住在守矢神社，是守矢神社的“销售部”[风神录]，主管对外交涉。\n她经营的营业活动相当丰富。[口授]\n她管理着核聚变炉，若其运行出现异常会前往调查。\n",
    abilities: "神奈子拥有创造乾程度的能力。\n此外，建造道路或是巨大的建筑物也是她的专长[口授]。\n作为山神，改变地形[口授]是神奈子的御神德。\n",
    appearance: "神奈子容貌非常庄严[口授]。\n她有着一头向左右伸展、容量惊人的蓝紫色齐肩短发，脑后用注连绳系着一个发髻，绳上装饰着银杏、枫叶和醋栗，在刚欲异闻以外的作品中装饰在右侧，在刚欲异闻中在左侧。\n她的瞳色在风神录、刚欲异闻中是接近茶色的红色，在人妖名鉴中是蓝色。\n她上身穿着红色的短袖，袖口有用金属的袖口卡住。短袖之下还穿了一件白色的宽松长袖。她胸前佩戴着一个黑色镜子，在白色长袖的袖口、腰上以及脚腕上都戴着注连绳环。\n她背后背着巨大的注连绳圈，其上挂着许多纸垂。\n她下身穿着深红色长裙，裙摆上有梅花图案。\n她赤脚踏着一双草鞋。\n在人妖名鉴中和战斗时，她背后还会装备许多御柱。\n",
    relationships: "神奈子曾经入侵洩矢诹访子所拥有的洩矢之国，两人是敌对关系。\n后来在神奈子夺取王国后两人共同统治王国，诹访子还借给神奈子力量，两人关系变得融洽。\n现在两人早已成为利害关系一致，而且实际上也很要好[风神录]的朋友。\n守矢神社本来是诹访子的神社，诹访子败给神奈子后神社也被抢走[风神录]。经过一系列事件后，如今守矢神社表面上是神奈子的神社，实际上是诹访子的神社，也是诹访子在让整个神社的机能运转[风神录]。\n东风谷早苗是神奈子的巫女[风神录]。\n神奈子赐予灵乌路空八咫乌的力量，将阿空驯养，并作为上司让阿空维持核聚变炉的正常运转。\n神奈子代表守矢神社和由饭纲丸龙等大天狗与天魔所领导的天狗社会缔结和平条约[DS]，相互利用。\n神奈子少量地传授科学技术给河童来征收生活费。[口授]\n不过，整体而言神奈子在幻想乡里没什么朋友，甚至有些被人们讨厌[智灵奇传]。\n"
  },
  {
    id: "Yagokoro Eirin",
    name: "八意永琳",
    alias: [
      "师匠"
    ],
    introduction: "八意永琳是东方Project系列中的官方角色，首次登场于东方永夜抄，担任永夜抄的六面Boss。\n她是月人，也是神明[秋例11对话]，是月之都的月之贤者之一，被称为“月之头脑”。\n“永琳”是她使用的名字之一，她还有另外一个在月之都使用的名字。[儚月抄漫画2话]\n在永夜抄之后，永琳在官方游戏的结局和官方出版物中时有出场。\n",
    lifestyle: "永琳曾作为月之贤者之一居住在月之都中。\n她现在居住在永远亭中，经营着名为“蓬莱药局”[文果真报]的药店。\n",
    abilities: "永琳是个天才。\n她还拥有制作任何药物程度的能力。\n比起蓬莱山辉夜，她拥有压倒性的力量。[永夜抄设定文档]\n由于服下了蓬莱之药[永夜抄]而不老不死，同时会产生和人类同样的污秽[儚月抄小说1话]。具体效果参见相关整理。\n",
    appearance: "永琳有着一头白色及膝长发，在脑后扎成麻花辫。头戴蓝色护士帽，有红十字和白色星座图案。\n她有着黑色眼瞳，但在部分官作结局中的Alphes绘瞳色有红色、褐色、蓝色等其他颜色。\n她上身穿着左蓝右红的短袖，领子和扣子为白色。\n她下身穿着左红右蓝的长裙，打着白色褶子。全身的衣服都有白色星座图案，上衣的左胸为北斗七星，右胸为仙后座五星，裙子则是左为仙后座五星，右为北斗七星。在永夜抄和求闻史记中，裙摆有八卦图案。\n在永夜抄和求闻史纪中，她脚穿白色短袜和黑色玛丽珍鞋。在人妖名鉴中，她裸足穿一双黑色鞋子。\n她在永夜抄和人妖名鉴中手持一把长弓，两端系着白色蝴蝶结。在永夜抄中另一只手持箭，在人妖名鉴中怀里抱着药壶。\n",
    relationships: "她是铃仙·优昙华院·因幡的师父，被铃仙尊敬。她为铃仙起了“优昙华院”的爱称，并会亲热地叫她“优昙华”。\n她曾是绵月依姬和绵月丰姬的师父，按人类的说法，两人同时也分别是永琳外甥孙的妻子和外甥孙夫妇的儿媳[儚月抄小说1话]，绵月姐妹放弃搜索永琳已有好几百年[儚月抄小说3话]。\n她是蓬莱山辉夜的侍从，两人的交往始于辉夜还在月球居住的时候[永夜抄设定文档]。两人一起杀害月之使者，之后永琳为辉夜修建了永远亭[儚月抄小说1话]，两人一起居住其中。\n她是月夜见亲族中值得其信赖之人，比月夜见活得更久。与月夜见一起去往月球。月夜见移居到月球后，建立都市时最依靠的就是永琳。[儚月抄小说3话]\n她将智慧传授给兔子们，换取因幡天为对人类不靠近永远亭的保证。\n嫦娥喝下的不老不死之药也是永琳制作的。[儚月抄漫画2话]\n她见到十六夜咲夜的时候表现得很惊讶[永夜抄设定文档]，其原因被ZUN本人写在了一段最后未能实装的游戏内容中[幻想揭示板]，因此两人的关系也不得而知。\n"
  },
  {
    id: "Yumemi Okazaki",
    name: "冈崎梦美",
    alias: [
      "教授",
      "草莓"
    ],
    introduction: "暂无相关资料",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Satsuki Rin",
    name: "冴月麟",
    alias: [],
    introduction: "\n",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Chiyuri Kitashirakawa",
    name: "北白河千百合",
    alias: [
      "折凳狂魔"
    ],
    introduction: "\n",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Izayoi Sakuya",
    name: "十六夜咲夜",
    alias: [
      "PAD长",
      "女仆长",
      "16"
    ],
    introduction: "十六夜咲夜是东方Project系列中的官方角色，首次登场于东方红魔乡，担任红魔乡的五面Boss及六面道中Boss。\n她是在红魔馆服侍蕾米莉亚·斯卡蕾特的女仆长，也兼任红魔馆的清洁工[红魔乡设定文档]，是馆中唯一的人类[史纪]。\n“十六夜咲夜”这个名字是蕾米莉亚赋予她的。[ZUN的邮件答复]\n她行事潇洒从容，头脑敏锐[妖妖梦设定文档]，平时总是镇定自若的样子[虹龙洞设定文档]，但也有着让人摸不清在想什么、脱线的一面[萃梦想设定文档]，有点天然[虹龙洞设定文档]。\n在红魔乡之后，她也常常于正作和格斗作中作为可选自机出场，在官方漫画与小说中也屡有戏份。\n",
    lifestyle: "身为女仆长，咲夜大部分时间都待在红魔馆中，负责打扫卫生、指派任务、做料理、服侍大小姐[妖妖梦角色设定]等，偶尔会外出进行采购。\n尽管她需要完成各种工作以及满足蕾米莉亚的任性需求，还没有工资[妖妖梦角色设定]，但她本人对工作却没有任何不满等阴暗的情绪[永夜抄Manual]，甚至会陪蕾米莉亚打发闲暇[三月精S]。\n凭借自己优秀的个人素质，以及操纵时间的能力，她总是能完美地完成所有工作。\n至于为什么咲夜会在红魔馆里工作、以及她之前是什么样的人，全都充满谜团。\n此外，她也时常出席博丽神社的宴会并经常负责为宴会准备料理。\n为了满足蕾米莉亚、帕秋莉·诺蕾姬的要求或者发现异变后，她也会为此外出在幻想乡内奔波。\n她怕吃热食。[妖妖梦设定文档]\n",
    abilities: "咲夜拥有操纵时间程度的能力和停止时间程度的能力。\n咲夜还是使用飞刀的高手，至于其精准度，如果让妖精女仆头顶苹果站在十二丈外，据说她投出的小刀可以正中妖精女仆的额头[史纪]。\n咲夜对料理也非常拿手[妖妖梦设定文档]。高超的厨艺与红魔馆的豪华食材相搭配（特别是肉类食材），使她在宴会上有着很高的人气[茨歌仙33话]。\n咲夜是一位表面上的魔术师，因为她的魔术不需要手法和技术，只是单纯地操纵了时间[幻想揭示板]。\n此外，她也擅长体术，不如说比起弹幕似的可疑的术她更擅长体术[萃梦想设定文档]。\n她没有弱点。[妖妖梦设定文档]\n",
    appearance: "咲夜的外表是10~20岁左右[红魔乡设定文档]的少女，属于身长高的角色[ZUN的邮件答复]。实际年龄成谜，稗田阿求认为她虽然自称不到20岁，但行事沉稳得像数百年前的人[史纪]。\n她有着一头银灰色及肩短发，除妖妖梦外两侧的鬓发扎成麻花并在末梢系着绿色蝴蝶结，除红魔乡及肩外鬓发及胸。她头上戴着喀秋莎头饰。\n她的眼瞳在红魔乡中为红色，在妖妖梦中为灰色，在后续作品中为蓝色。\n她身穿以深蓝、白两色为主色调的女仆装，包括衬衫、深蓝色上衣、带白色花边的深蓝色及膝裙和系在腰上的白色围裙，在妖妖梦中衬衫为蓝色，在其他作品中衬衫为白色。在妖妖梦中，她还戴着棕红色围巾；在红魔乡中，右袖边缘有“Red Magic”的刺绣；在花映塚中，围裙摆上印有罗马数字，形似时钟。\n她在妖妖梦、永夜抄中脚穿白色短袜，在辉针城、虹龙洞、人妖名鉴中穿着黑色丝袜；在妖妖梦中穿着棕色皮鞋，在永夜抄中穿着深蓝色皮鞋，在辉针城、虹龙洞中穿着棕色短靴，在人妖名鉴中穿着黑色短靴。\n除妖妖梦、萃梦想、人妖名鉴外，她手持银质小刀，在人妖名鉴中身后环绕着一圈银质小刀，在永夜抄中还手持怀表。\n咲夜的2P色，将白色改为灰色，深蓝色改为黑色，绿色改为红色。\n",
    relationships: "蕾米莉亚·斯卡蕾特是咲夜的主人，并赐予了她“十六夜咲夜”之名[ZUN的邮件答复]，咲夜发誓要效忠于她[永夜抄Manual]。\n帕秋莉·诺蕾姬身为蕾米莉亚的好友，红魔馆的住户，也是咲夜侍奉的对象。\n红魔馆的门卫红美铃是受咲夜调遣的下级。\n身为红魔馆的女仆长，她直接领导馆内众多妖精女仆[三月精S1话]，但她的属下几乎都派不上用场[史纪]。\n她同样侍奉着蕾米莉亚的妹妹芙兰朵露·斯卡蕾特，负责着监督妖精女仆给芙兰朵露准备食物等事，但她其实并不了解芙兰朵露的饮食喜好[智灵奇传]。\n八意永琳见到咲夜的时候表现得很惊讶[永夜抄]，其原因被ZUN本人写在了一段最后未能实装的游戏内容中[幻想揭示板]，因此两人的关系也不得而知。\n"
  },
  {
    id: "Hakurei Reimu",
    name: "博丽灵梦",
    alias: [
      "红白",
      "赤色杀人魔"
    ],
    introduction: "博丽灵梦是东方Project系列的第一主角，也是东方系列的代表角色。初登场作品为东方灵异传，担任灵异传的自机；新作初登场作品为东方红魔乡，担任红魔乡的自机。\n她是博丽巫女，通称红白[红魔乡设定文档]。\n所有官方游戏整数作的标题画面都是灵梦。同样地，官方漫画里灵梦也均会在封面与第一话登场。\n在世界范围以及中文社群中，灵梦是认知度最广、二次创作最多的东方角色。\n她性格非常悠闲，缺乏危机感，对谁都既不亲切也不严厉地平等相待，但在工作上对妖怪是不问情由一律降伏的[东方求闻史纪]，常常一个人独处，实际上也说不定是个冷漠的人[永夜抄设定文档]，不过有时候也会不分种族地去亲近别人[永夜抄Manual]，实际上其实感情丰富[绯想天角色介绍]。她思想非常单纯，表里如一[萃梦想设定文档]，但也满脑子是春，并且因为不相信努力会得到回报而讨厌修行和全力以赴[妖妖梦Manual]。\n从灵异传开始，灵梦一直作为大部分官方游戏可使用的自机角色登场，在所有官方出版物中也都是主角或常驻角色。她贯穿了东方系列的整个故事线，是东方剧情中最重要的角色之一。\n",
    lifestyle: "灵梦是位于幻想乡内的神社——博丽神社的现任巫女，也是历代巫女中最缺乏危机感的一位[东方求闻史纪]。\n她平日居住在博丽神社中，在有工作或异变发生时也会出现在幻想乡内的各个地方乃至幻想乡外的世界中。\n作为博丽巫女，她以解决异变为主要工作内容[东方求闻史纪]，以降伏妖怪等敌人为主。此外，她拥有丰富的与妖怪相关的知识，作为这方面的专家，她也会帮助解决一些与妖怪相关的问题[铃奈庵18话]，而非像普通的巫女一样单纯地侍奉神明或经营神社，甚至很少发挥巫女该有的作用[妖妖梦Manual]。\n没有异变的时候，灵梦则一般会边注视着幻想乡的天空边喝着茶水，这就是她每日的习惯[妖妖梦]。\n由于博丽神社所在的位置距离幻想乡内人类的聚集地人类村落比较远，在新雪上走需要一个小时左右[茨歌仙38话]，加上路途中有着险恶的妖怪兽道和上坡路，因此参拜客不多[东方求闻史纪]。\n灵梦经常会想出各种手段以吸引参拜客[东方茨歌仙]，但是常常以失败告终。\n由于博丽神社缺乏赛钱乃至没有存放现金（斯塔萨菲雅会将自己没偷过钱的原因归结为只去神社偷东西）[三月精S18话]，以及灵梦本身的贪财[萃梦想咲夜线、东方茨歌仙]，加上灵梦偶尔为了招揽参拜客而不顾客人的安危[地灵殿、醉蝶华28话]，在二次创作中普遍将灵梦设置为贫穷并且为了钱财不择手段的无节操形象。然而，她的贪财并非沾染俗气，而是单纯、忠于欲望的表现[茨歌仙5话]。\n",
    abilities: "灵梦主要拥有飞翔于空中程度的能力，不管是地球的重力，还是任何的重负，或者由于力量差造成的威胁，这一切对于她而言都是无意义的[永夜抄Manual]。\n此外，她还拥有博丽巫女的能力。\n灵梦擅长发现空间的间隙，利用其创造结界[GoM]。\n灵梦还拥有操纵灵气程度的能力[红魔乡设定文档]。\n灵梦拥有超乎常人的幸运，她的直觉几乎一定会命中。\n作为巫女，灵梦可以看见、听见一般人看不见、听不见的神明[茨歌仙23话]、或是与神灵对话[铃奈庵27话]。\n除了神明，灵梦还可以将被封印或寄宿于物品上的怨灵降灵，从而将其再次封印或降伏。[铃奈庵、醉蝶华]\n不论是体术还是妖术，灵梦都有点修行不足（或者说根本没有），但是这不妨碍她非常地强。[萃梦想设定文档]\n",
    appearance: "灵梦身高是十多岁的样子，属于身长较高的角色[ZUN的邮件答复]，同时她当时的年龄也和外形一致[幻想揭示板]。\n她有着一头黑发，有些作品中会偏棕色，长度从及肩到及腰不定，脑后系着巨大红色蝴蝶结，两鬓有两束发髻扎在红白色装饰的束发带中，束发带的造型会随作品而改变。\n她的眼瞳在多数作品中为黑色或棕色，在少数作品中则为红色。\n她身穿红色调的改良版巫女服，巫女服由红色和白色两种布料构成，这就是她被称为红白巫女的原因。在胸前，她一般会系着一个红色、黄色、紫色或蓝色的领结。巫女服的白色宽大袖子与上衣在肩膀处分离，在袖子的顶部以束带固定于上臂。巫女服的下身为红色及膝裙，裙摆边缘为荷叶边，裙摆下方有白色图案，随作品变化。\n她脚穿白色的足袋、短袜或三折袜，在大部分作品中穿鞋，样式为玛丽珍鞋或乐福鞋或长靴。\n她手持武器驱魔棒作为降伏妖怪的重要道具，其长度会随作品变化，趋势是越来越长，红魔乡时只有小臂长，绀珠传之后的作品中普遍超过灵梦身高。\n灵梦的2P色将红色改为蓝色，将紫色领带改为黄色。这种配色被称为青灵梦，是比较热门的二次创作主题。\n",
    relationships: "灵梦作为巫女工作所使用的道具和服装，均由旧货店香霖堂提供[香霖堂]。\n此外，她还会拜托多多良小伞打造封魔针[茨歌仙27话]，常用武器阴阳玉则是由玉造魅须丸打造的[东方虹龙洞]。\n雾雨魔理沙曾说灵梦曾经是个弃儿[香霖堂]，不过有开玩笑的可能。\n魔理沙、八云紫、茨木华扇、东风谷早苗等角色经常来访博丽神社，并为灵梦带来各种各样的食品或道具[东方茨歌仙]。\n光之三妖精桑尼米尔克、露娜切露德、斯塔萨菲雅经常对灵梦进行恶作剧，并且在之前居住的树木被雷劈死后[三月精S第21话]之后，搬到了博丽神社后院的大树上定居。\n在东方辉针城之后，少名针妙丸曾经在博丽神社寄居了一段时间[辉针城、铃奈庵]；在东方天空璋之后，高丽野阿吽也常驻于博丽神社。\n基于对旧作的捏它，ZUN将旧作角色玄爷安置在了博丽神社后院的池塘里[东方的黎明]。\n灵梦解决异变时，会遭遇到各式各样的妖怪和人类，有的时候会发生战斗，有的时候则会互相协助。\n例如在东方永夜抄和东方凭依华里她与紫组合；在东方地灵殿里，紫、射命丸文、伊吹萃香都为她提供过协助；在东方凭依华里她与华扇结成组合。\n因此灵梦结下了许多不解之缘。虽然人类村落的村民们对博丽神社兴致寥寥，但是妖怪们都非常喜欢灵梦[求闻史纪、地灵殿Manual]，经常会来神社找灵梦玩耍。但灵梦并不希望妖怪们在平时来到神社，认为是她们让人类村落的居民不敢来神社参拜，并让神社被称为“妖怪神社”[东方茨歌仙]。\n作为维持幻想乡秩序的巫女，灵梦也经常前往人类村落执行任务或维持治安[东方铃奈庵]。\n人类村落中的居民十分尊敬博丽巫女，并且也会配合她的工作。甚至因幡天为还能冒充神社工作人员骗到钱[东方文花帖]。\n由于灵梦丰富的人际关系，在二次创作中，以灵梦和他人的关系为基础展开的创作类型十分兴盛。\n"
  },
  {
    id: "Kana Anaberal",
    name: "卡娜·安娜贝拉尔",
    alias: [
      "梦消失",
      "路牌女"
    ],
    introduction: "\n",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Komeiji Koishi",
    name: "古明地恋",
    alias: [
      "恋恋",
      "小石头"
    ],
    introduction: "古明地恋是东方Project系列中的角色，首次登场于东方地灵殿，担任地灵殿的EX面Boss。\n她是觉妖怪，一种拥有读心能力的妖怪，但恋闭上能够读心的第三只眼、封闭内心后就失去了读心的能力，同时获得了操纵无意识的能力。[地灵殿设定文档]\n恋的角色设定与心理学有着非常深厚的渊源，例如潜意识/无意识、本我与超我、梦境等等概念，许多符卡名都与著名的心理学研究者以及其学说有关，这在东方Project官方角色中是非常独特的。\n从东方心绮楼开始，ZUN有意推一批角色，但只有恋的人气被推上去了。[ZUN×海原海豚]\n恋是矛盾的角色，是作为没有角色性的存在而诞生的，是对角色性的否定。[人妖名鉴]她虽然试图通过回避他人的恶意来避免成为被厌恶者，但她依然含有很多理应遭到厌恶的东西，心怀某种黑暗[人妖名鉴]，因此她尽管成功避开了地下居民的厌恶[地灵殿设定文档]，但是仍然没有脱离“被厌恶者”的身份[GoM、交叉评论]。这种矛盾也体现于性格上：恋性格空洞，难以交流[口授]，说话的风格忽而可爱忽而黑暗。\n在地灵殿之后，恋还作为自机登场于东方心绮楼、东方深秘录、东方凭依华中，在官方出版物中偶尔出场。\n",
    lifestyle: "恋居住在旧地狱的地灵殿，也会时不时造访地上[口授]。\n恋一直处于无意识的状态，以至于她本人也不知道接下来她自己会做什么，无心无欲地顺从着周遭的环境生活着，就像随风飘舞的布片一般，没有任何目的，仅仅只是在周围四处游荡[地灵殿设定文档]，更多地是凭借自己当时的感觉行动[口授]。对于她自己而言这种生活也算是有趣，但周遭看来这样的她稍微有一点可怜。\n恋虽然使用有关梦境的符卡（表象「列祖列宗入梦来」、「胎儿之梦」、梦符「先祖大人在看着你」），但是她却是不做梦的，心灵非常空洞[凭依华]。\n恋的姐姐古明地觉给她分配了几只宠物，恋有时会和宠物们一同玩耍[地灵殿设定文档]。不过她和她的姐姐不同，并不讨动物喜欢，但也不被讨厌[口授]。\n在遇见地灵殿的自机后，原本心境空空如也的恋逐渐有了一些变化[地灵殿设定文档]。\n她在命莲寺的劝诱下入了佛门，但没有出家。[口授]\n",
    abilities: "古明地恋拥有操纵无意识程度的能力。\n恋因为为了逃避他人的厌恶而闭上了自己的第三只眼，失去了读心的能力，这等同于封闭了自己的内心，代表了不接受别人的心灵完全将其屏蔽的意思。[地灵殿设定文档]\n在都市传说异变时，恋选择了「梅莉小姐的电话」这一都市传说作为自己的灵异。她会给附近的人打电话，并转移到其背后进行攻击。于是，在恋的二次创作中以电话、菜刀为元素的作品也十分丰富。\n",
    appearance: "恋有着一头浅绿色及肩短发，略卷，头戴黑色圆顶帽，上面系着一条黄色缎带，打着蝴蝶结。\n她的瞳色在地灵殿、人妖名鉴中为深绿色，在心绮楼、深秘录、凭依华中为和头发颜色相同的绿色。\n她上身穿着黄色长袖上衣，衣服扣子为蓝绿色，衣领为绿色，衣领外缘以及衣袖饰有墨绿的百褶。\n她下身穿着印有蔷薇[地灵殿采访]纹样的渐变绿及膝裙，腰部为白色，往下绿色加深，直至膝盖处为深绿色。\n除口授外，她脚穿黑色短靴，在口授中她则脚穿黑色皮鞋和白色短袜。她鞋子上有紫色的心形饰片并链接着第三只眼的一部分。\n她周身缠绕着第三只眼，在地灵殿中表皮为深蓝色，在其他作品中为紫色，眼睑闭合，两侧延伸出两根类似血管的紫管子（在地灵殿中为由深蓝渐变为紫色），在空中绕出爱心状的图案。\n",
    relationships: "由于自己的能力，她很难和他人正常交流，也没去建立复杂的人际关系[口授]。\n她和姐姐古明地觉以及姐姐的宠物火焰猫燐、灵乌路空同居于地灵殿，关系较为亲密。\n由于地灵殿地处旧地狱，因此恋还与一些现在以及曾经在旧地狱居住的人相互认识。\n而在间歇泉骚动发生后，恋逐渐接触并结识了一些地上人。她在完全凭依异变期间和雾雨魔理沙组队一起探索完全凭依的性质。[凭依华]\n在宗教战争中恋捡到了因地裂掉到地底的秦心的希望之面[心绮楼]，但恋并没有打算还给心，两人因此曾大打出手，最终心也没能从恋手里夺回希望之面。\n"
  },
  {
    id: "Komeiji Satori",
    name: "古明地觉",
    alias: [
      "古明地悟",
      "小五",
      "⑤"
    ],
    introduction: "\n古明地觉是东方Project系列中的官方角色，首次登场于东方地灵殿，担任地灵殿的四面Boss。\n她会读心的觉妖怪，被委任管理旧地狱-灼热地狱遗址的怨灵[口授]，是遗迹上方的别墅地灵殿的主人。\n然而觉本人却是一个和蔼、老实、有些内向的妖怪[地灵殿]，稍有幻想情调并喜爱动物[地灵殿Music Room]。\n她有很多宠物，读心的能力让她可以和动物们交流，因此她也很受动物们的欢迎[口授]，但她自己却觉得宠物在避着她[地灵殿]。\n在地灵殿之后，觉在官方游戏和官方出版物中都时有出场。\n",
    lifestyle: "觉居住在旧地狱的地灵殿中，作为被畏惧与厌恶的存在过着自我隔离的生活。[口授]\n基本不会有人拜访她，她也几乎不主动出门。\n她平日在家看书写书，尤其是喜欢带有丰富心理描写的故事。[口授]\n她将各种日常杂务乃至管理灼热地狱遗址的工作都交给了宠物们。[地灵殿设定文档]\n她还负责监视地底的家伙，防止他们出现在地上。[GoU]\n另外，她也会作为侦探出面调查旧地狱的各种事件。[智灵奇传]\n",
    abilities: "觉拥有读心程度的能力，可以知晓他人当下的脑中所想。\n和她在一起的宠物会逐渐变强，成为强大的妖怪。[地灵殿]\n她并不怎么擅长战斗[地灵殿Music Room]，但是比一般的觉更好战[DS]和敏捷[DS]。\n",
    appearance: "觉有着一头齐脖短发，在地灵殿中粉紫相间，在人妖名鉴中为粉色。头戴黑色发卡，上有黄色心形的装饰，且连接着第三只眼的一部分。\n她有着紫色的眼瞳，在地灵殿和求闻口授中闭着右眼。\n她上身穿着淡蓝色的上衣，同样有心形的装饰。上衣的衣领和袖口处为粉色，有褶边装饰。扣子也为黄色心形。\n她下身穿着从上到下自白渐变为淡粉的及膝裙，裙子上饰有玫瑰的图案。\n她脚穿粉红色的拖鞋和带褶边的短袜，拖鞋在地灵殿中右脚内侧有白色心形图案，在人妖名鉴中双脚外侧都有白色心形图案。\n她左胸心脏处垂着第三只眼。她的第三只眼表皮为红色，眼瞳为深红色。从第三只眼延伸出数根类似于血管的管子连接到衣服的心形扣子和发卡的心形装饰上，颜色从红渐变为黄，在地灵殿和求闻口授中，第三只眼对称地伸出六根管子，并在右下方系着一个结。\n",
    relationships: "古明地恋是觉的妹妹，与觉不同的是恋不会读心。\n她还有很多宠物，并把很多管理事项交由宠物们去做，包括宠物的管理、庭院的修缮、陪妹妹玩的工作等等都交给了宠物去做。\n伊吹萃香知道她，但误以为她能操纵怨灵。[地灵殿]\n"
  },
  {
    id: "Kitcho Yachie，",
    name: "吉吊八千慧",
    alias: [],
    introduction: "吉吊八千慧是东方Project系列中的官方角色，首次登场于东方系列的第十七作东方鬼形兽，担任鬼形兽的四面Boss。\n她是吉吊的动物灵，是擅长奇袭作战的动物灵组织“鬼杰组”的组长。\n她的设计参考了中国古代传说中的一种幻兽——吉吊。她的立绘剪影出现在了鬼形兽的封面上。\n骊驹早鬼认为鬼杰组“都是些性格扭曲的家伙”[鬼形兽]。八千慧本人就是个狡猾、两面三刀的家伙[鬼形兽访谈]。\n在鬼形兽之后，八千慧还作为自机登场于东方兽王园中。\n",
    lifestyle: "八千慧平时居住在畜生界，作为动物灵组织“鬼杰组”的组长[鬼形兽设定文档]率领鬼杰组与其他动物灵组织互相争斗，企图支配畜生界。\n与其他动物灵组织一样，她以及她领导的鬼杰组把人类灵当作奴隶进行奴役。\n同时，依附于组织生存的动物灵也都是组织的奴隶[鬼形兽设定文档]。\n她通过早睡早起来保养尾巴。[兽王园]\n",
    abilities: "八千慧拥有剥夺反抗意志程度的能力，没有人能违抗她[鬼形兽设定文档]。\n作为动物灵的共同特征，她不具备肉体，其攻击只会对目标的灵体部分产生影响。\n另外，动物灵能够凭依、占据其他人的身体。\n",
    appearance: "八千慧有着一头黄色齐脖短发，头顶长着一对金色的角，形状类似鹿角。\n她的眼瞳在鬼形兽、人妖名鉴中为红色，在兽王园中为金色。\n她上身穿着青蓝色方领短袖，领口为白色，门襟为白色，顶端有深蓝色蝴蝶结，在鬼形兽、人妖名鉴中于右侧开襟，上有斜着的红色一字扣，在兽王园中于左侧开襟，上有斜着的紫色一字扣。\n她背后生有龟壳，上面布满绿色鳞片，形似扬子鳄的躯干，末端伸出长长的尾巴，尾巴背侧同样覆盖着绿色鳞片，腹侧则为白色并分节。在鬼形兽、兽王园中，尾巴有类似龙尾的绿叶状末端。\n她下身穿着墨绿色及膝裙，在鬼形兽、人妖名鉴中为百褶裙，在兽王园中则几乎没有褶子。\n她脚穿黑色玛丽珍鞋和白色短袜。\n",
    relationships: "八千慧是畜生界动物灵组织“鬼杰组”的组长，水獭灵是她的下属。\n她与骊驹早鬼为首的“劲牙组”、饕餮尤魔为首的“刚欲同盟”等动物灵组织敌对，互相争夺畜生界的占有率。\n她与占据灵长园的埴安神袿姬、杖刀偶磨弓敌对，为了对抗而选择与其他动物灵组织合作。\n在日白残无的介绍下，将孙美天招揽进了鬼杰组。\n"
  },
  {
    id: "Mimichan",
    name: "咪咪号",
    alias: [
      "咪咪酱"
    ],
    introduction: "\n",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Doremy Sweet",
    name: "哆来咪·苏伊特",
    alias: [
      "123"
    ],
    introduction: "哆来咪·苏伊特是东方Project系列中的官方角色，首次登场于东方绀珠传，担任绀珠传的三面Boss和EX面道中Boss。\n她是貘妖怪，爱做白日梦并支配着梦境世界的妖怪。\n在绀珠传之后，哆来咪还作为自机登场于东方凭依华中，在官方出版物中也时有出场。\n",
    lifestyle: "哆来咪栖息于梦境世界，为了维护秩序而监视着生物的梦。\n她在幻想乡中贩卖能让人安眠的枕头（由幻想乡内的寝具店代售）[文果真报]，广受好评。\n",
    abilities: "哆来咪拥有食梦、造梦程度的能力。\n",
    appearance: "哆来咪有着一头蓝色长发，戴着内白外红的睡帽，帽子顶端有一个白色绒球。她除刘海外的头发都藏在睡帽里。睡帽在不同作品中长短不一。\n她有着蓝色的眼瞳。\n在绀珠传和人妖名鉴中，她身穿白领、黑身、白腰、黑裙摆的短袖连衣裙，裙摆边缘和领子下方有白色曲线和点组成的图案。裙子上挂着许多球，裙子的白色部分挂黑球，黑色部分挂白球。在凭依华中，她身穿白色短袖连衣裙，仅裙摆为黑色，上身穿着黑色披肩，披肩上边缘和裙摆边缘也有白色图案，但变为白色线段。披肩和裙摆上以同样的规律挂着球，但是腰部的球比其他作品中挂得少。\n在绀珠传中，她脚穿白色短袜，有白色褶边。在人妖名鉴中，她脚穿白色三折袜。两作中，袜子脚腕的位置都挂着两个黑色小球。\n身后有一条貘尾，末端为黑色，在绀珠传中尾巴为白色，在人妖名鉴中尾巴为蓝紫色。\n她右手拿着一本蓝色封皮的笔记本，这是她的梦日记，记录着所有人的梦[凭依华]。在凭依华中，笔记本有一蓝色丝带、末端为黑色的形似貘尾的书签带。在绀珠传和凭依华中，她左手持一粉色梦魂[绀珠传访谈]。\n在人妖名鉴中，她躺在一团巨大的粉色梦魂上。\n",
    relationships: "哆来咪与稀神探女熟识。即使觉得烦扰而并不是很想参加，她仍然参与了探女实行的“月之都迁都计划”。\n"
  },
  {
    id: "Shikieiki Yamaxanadu",
    name: "四季映姬·夜摩仙那度",
    alias: [
      "四季映姬·亚玛萨那度",
      "阎萝王"
    ],
    introduction: "四季映姬·夜摩仙那度是东方Project系列中的官方角色，首次登场于东方花映塚。\n四季映姬曾经是地藏[三月精O]，后来全国各地的地藏联名上书请求分担阎魔大人的工作[史纪]，她也成为了阎魔。\n她的立绘剪影出现在了花映塚的封面上。\n她非常喜欢说教，且她从来不会说出失之偏颇的话语，因此在她周围会油然而生一种难以接近的氛围。[史纪]\n在花映塚之后，她在官方游戏和官方出版物中偶有出场。\n",
    lifestyle: "四季映姬平时生活在彼岸，偶尔也会出现在幻想乡，这时妖怪们就会躲起来。[史纪]\n她大部分时间在是非曲直厅内进行审判的工作，经常负责幻想乡死者的裁决，幻想乡长生不老的妖怪都曾受其关照。[史纪]\n阎魔审判的工作采用的是二人轮换制[史纪]，她休息的时候往往在彼岸享受属于自己的悠闲生活。\n在休假时间，她就会直截了当地警告背负着过于沉重的罪孽的长寿之人。[史纪]\n",
    abilities: "四季映姬拥有明鉴黑白程度的能力。\n她拥有净玻璃之镜，用这面镜子映照受审者，受审者过去的一切言行都将在镜中得到再现，毫无隐私可言。[史纪]\n她拥有强大的力量。[GoM]\n据说对她花钱贿赂能让人起死回生。[虹龙洞、弹幕狂们的黑市]\n",
    appearance: "四季映姬有着一头绿色短发，右侧头发及肩，左侧头发齐脖。头戴深蓝色帽子，形似经过一定改造的五佛冠，系有红白二色丝带，正面正中间有一金属片，上面刻有天平图案，帽子左右侧均有金属片，与古代官帽类似。\n她有着蓝色的眼瞳。\n她上身穿着深蓝色无袖夹克，有一排红色球形纽扣，肩膀左侧和右侧各有一金属片，左肩上写着“是”，右肩上写着“非”，均为黑底金字。夹克内穿白色上衣，袖子上右臂系有红色丝带，左臂系有白色丝带。\n她下身穿着黑色及膝裙，裙摆有一圈左白右红的虚线图案。\n在史纪中，她脚穿玛丽珍鞋，在人妖名鉴中，她脚穿黑色皮鞋，上有铜质纽扣。脚腕上绑着蓝色护腕，有白色荷叶边。\n她右手拿着悔悟之棒，悔悟之棒为金色，上面有黑色的“罪”字与其他图案，上侧呈三角尖状突出，下侧平整。\n四季映姬的2P色将深蓝色改为暗红色，将白色改为淡紫色。\n",
    relationships: "小野塚小町、庭渡久侘歌都是四季映姬的下属。四季映姬对小町的懒惰很不满。\n赫卡提亚·拉碧斯拉祖利是地狱的女神，地位上高于四季映姬，被四季映姬称呼为地狱的一位统帅者[三月精V]。但是赫卡提亚并不直接领导、管辖是非曲直厅。\n包括稗田阿求在内的御阿礼之子的转生要乞求阎魔的许可，转生之前需要在阎魔手下工作[史纪]。又由于四季映姬是负责幻想乡所在区域的阎魔，在二次创作之中，常将四季映姬设定为负责御阿礼之子的阎魔。\n"
  },
  {
    id: "Inaba Tewi，",
    name: "因幡天为",
    alias: [
      "因幡帝"
    ],
    introduction: "因幡天为是东方Project系列中的官方角色，首次登场于东方永夜抄，担任永夜抄的五面道中Boss。\n她是迷途竹林中野生的兔子与妖怪兔的领袖，自己也是妖怪兔。地上的兔子对她唯命是从，且只听她的命令[儚月抄]。\n她因为注重健康而很长寿，据说是幻想乡中活得最久的妖怪一类[史纪]。\n她性格冲动[设定文档] ，非常喜欢恶作剧却胆子很小，喜怒哀乐的情感相当强烈[史纪]。可见，天为的性格比起妖怪更像妖精。\n同时，她生性就是个欺诈师。虽然每次骗人都会遭到报复，但完全没有悔过之意[符卡说明]，对欺骗他人也没有丝毫内疚[上海爱丽丝通信]。她相当奸诈狡猾[史纪]，在花映塚中，因奸狡、假意奉承和骗人过多被四季映姬·夜摩仙那度说教。\n她在东方永夜抄之后，又作为自机登场于东方花映塚，并在之后的官方出版物和游戏结局中时有登场。\n",
    lifestyle: "自从迷途而进入永远亭[儚月抄]后，天为一直居住在永远亭，但经常擅自离开永远亭。\n尽管天天神出鬼没，但是一旦到了重要时刻她必定现身。[儚月抄]\n在迷途竹林里不会迷路，因为她看得见竹子下方气流的流向[花映塚]。\n",
    abilities: "天为拥有使人类变得幸运程度的能力，见到她的人就能变得幸运。\n因为这个能力，而在人类中少有地受到欢迎[史纪]。\n因幡天为本身也很幸运。有一次脚下全都是四片叶子的三叶草[花映塚]。\n",
    appearance: "天为身高属于较矮组。\n她有着一头黏糊糊、没有光泽的黑色短发。头上垂着一双毛绒绒的兔耳，耳朵在人妖名鉴中整个垂下，在其他作品中从根部靠上一点向下垂下。\n作为白兔，她有着红色眼瞳，眼睛是圆的。\n她身穿粉色的短袖连衣裙1，裙摆很开。冬天时穿的裙子袖子很长，而且飘飘荡荡的。衣装和清兰相似是因为天为在模仿月兔的服装[人妖名鉴]。\n在求闻史纪中，她的脖子上带着领巾。在花映塚、儚月抄、人妖名鉴中，她的脖子上带着胡萝卜项链。\n她的身后有一个毛绒绒的圆形兔尾巴。\n她穿着灯笼裤，在求闻史纪中右腿缠着布带。\n裸足。\n天为的2P色，将粉色改为黑色。\n",
    relationships: "天为与铃仙·优昙华院·因幡是同伴，理论上铃仙可以对她下命令，但是天为并不听她的话。\n她向八意永琳保证不让人类靠近永远亭，换取永琳将智慧传授给兔子们。[儚月抄]\n之后，她领导着兔子们为永琳和蓬莱山辉夜服务，负责防卫[永夜抄]、捣药[儚月抄]等等工作，但是行动自由，常常自行离开，使永琳责骂铃仙。\n她曾试图打听月之民的情报来和永琳“做生意”[绀珠传]。\n"
  },
  {
    id: "Hiziri Byakuren，",
    name: "圣白莲",
    alias: [],
    introduction: "圣白莲是东方Project系列中的官方角色，首次登场于东方星莲船，担任星莲船的六面Boss。\n她原本是人类，是一位信浓出身[口授]的僧侣。后来由于畏惧死亡而习得了偏离大乘佛教的佛法[口授]，成为魔法使。\n因为使用的力量依赖于妖怪的存在，她尊敬妖怪，并站在妖怪一边帮助妖怪，因而受到妖怪们的敬仰，也因此被封印。\n她性格悠然，从不生气，给人以好好先生的印象，却也有些靠不住的感觉。[口授]\n在星莲船之后，还作为自机登场于东方心绮楼、东方深秘录、东方凭依华中，在官方出版物中也时有出场。\n",
    lifestyle: "白莲是命莲寺的住持。\n她的工作包括葬礼仪式和墓地的管理，向弟子和其他人宣讲佛法。此外，她会每月一次和着木鱼的节奏用毫无起伏的音调念着“通宵诵读的经文”，被全体人类和妖怪热切注目着。[口授]\n她平时一直早睡早起，不喝酒，不杀生（肉也不吃），严守清规。[口授]\n",
    abilities: "白莲拥有使用魔法程度的能力（擅长提升体能的魔法），博丽灵梦称之为使用魔法（身体强化为主）程度的能力。\n",
    appearance: "白莲有着一头从头顶向下由紫色渐变为金色的及腰波浪长发。在心绮楼、深秘录、凭依华中，头戴斗笠。\n她的眼瞳在星莲船中为黄色，在其他作品中为和头发一样的紫色。\n她身穿内白外黑的哥特萝莉服，胸前的衣带绑成数个叉形。在心绮楼、深秘录、凭依华、人妖名鉴中，胸前挂着绿色的念珠。\n在星莲船、求闻口授、人妖名鉴中，她身后披着内红外黑的披风。\n她脚穿绑着白色带子的黑色靴子。\n在星莲船、求闻口授中，她手持魔人经卷。在人妖名鉴中，魔人经卷在身前漂浮。\n",
    relationships: "白莲信仰着毘沙门天，因此祭祀与信仰其化身寅丸星。\n在白莲被封印前就跟随着白莲的妖怪有娜兹玲、云居一轮、云山、村纱水蜜和寅丸星，在白莲解除封印后跟随白莲的妖怪有封兽鵺和幽谷响子。其中，除了娜兹玲外的妖怪均为白莲的弟子。\n作为幻想乡佛教的代表，她与信奉道教且对人类村落的社会有所介入的丰聪耳神子是敌人、竞争对手的关系。\n完全凭依异变后的一段时间内，依神女苑曾在命莲寺跟随白莲修行。\n"
  },
  {
    id: "Sakata Nemuno",
    name: "坂田合欢",
    alias: [
      "坂田合欢野",
      "坂田合欢乃",
      "欢姐"
    ],
    introduction: "坂田合欢是东方Project系列中的官方角色，首次登场于东方天空璋，担任天空璋的二面Boss。\n她是山姥，这一种族与其他种族达成互不侵犯的约定，独自生活在各自的圣域里。\n她对世间兴致索然[天空璋设定文档]，幻想乡的其他人也同样不了解她。\n作为山姥，她拥有并能适时地区分使用残虐性与慈悲心这两面性[GoU]。\n她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "合欢独自居住在人迹罕至[天空璋]的妖怪之山山麓[兽王园]自己的圣域中，把这里当成自己的地盘。\n她很少外出，所属的山姥一族与天狗互不相容。她与同种族其他个体也没什么交流，与其他种族偶尔有事务性的交流。[天空璋设定文档]\n当成年人类误入自己的地盘，她会进行恐吓然后遣返回去。当人类小孩误入自己地盘，她则更多地会保护起来，然后抚养成健壮的人类。[天空璋设定文档]\n她会亲切招待中意的误入自己圣域的人。\n她意外地很重视打扮。[人妖名鉴]\n",
    abilities: "合欢拥有制作圣域程度的能力。\n",
    appearance: "合欢有着一头白色及腰波浪卷发。\n她有着红色的眼瞳。\n她身上乍一看像是[人妖名鉴]裹着一整张上黄、中橙、下红的布1，有着未开化的感觉。布的橙色部分边缘打着白色褶子。\n她穿着蓝色袖子，与身上的布分离。身上布的红色部分下方和袖口有着合欢精心裁剪的菱形镂空。\n裸足。\n她手持一把巨大的砍刀，外形类似菜刀或柴刀，刀柄系着红色蝴蝶结，在天空璋用右手，在人妖名鉴用左手。\n",
    relationships: "山姥与天狗互不相容，在两种族签订互不侵犯条约后，各自过着互不往来的生活。[天空璋设定文档]\n她中意雾雨魔理沙，认为她是坂田金时一样的人类。[天空璋]\n"
  },
  {
    id: "Haniyasushin Keiki",
    name: "埴安神袿姬",
    alias: [
      "广西大妈",
      "硅基"
    ],
    introduction: "埴安神袿姬是东方Project系列中的官方角色，首次登场于东方鬼形兽，作为鬼形兽的六面Boss登场。\n她是畜生界灵长园人类灵抱着起死回生之念召唤来的神明，被称为造形神。\n她的立绘剪影出现在了鬼形兽的封面上。\n作为一名天才造形艺术家[人妖名鉴]，她的美学素养相当高[人妖名鉴]。\n在鬼形兽之后，袿姬尚未在官方游戏中再次登场过，在官方出版物中则偶有出场。\n",
    lifestyle: "袿姬居住于畜生界的灵长园并支配着这里，直到被自机打败。\n",
    abilities: "袿姬拥有创造偶像程度的能力。\n",
    appearance: "袿姬有着一头水蓝色及胸长发，头戴墨绿色头巾，为的是避免自己的头发落在作品上[人妖名鉴]。\n她有着粉红色的眼瞳。\n她身穿黄色短袖过膝连衣裙，袖摆和裙摆有橙色螺旋状花纹。\n她上身外穿着墨绿色围裙，形制类似于兽皮装，打着鲜绿色褶子。围裙上有许多蓝色口袋，装着雕刻工具，此外还装着游标卡尺和一朵白花。脖子上挂着一串各色勾玉。\n她小腿和小臂绑着蓝色带子，穿着蓝色鞋带的黑色拖鞋。\n她两手各持四把雕刻刀。\n她身后有黄渐变为红的火焰状灵气，形状像兽首。\n",
    relationships: "袿姬创造了包括杖刀偶磨弓在内的埴轮，并任命磨弓为埴轮兵团的首长。\n为了保护受到动物灵虐待的人类灵，与以吉吊八千慧、骊驹早鬼、饕餮尤魔为首的动物灵敌对。\n"
  },
  {
    id: "Horikawa Raiko",
    name: "堀川雷鼓",
    alias: [
      "鼓哥"
    ],
    introduction: "堀川雷鼓是东方Project系列中的官方角色，首次登场于东方辉针城，担任辉针城的EX面BOSS。\n她是和太鼓的付丧神。\n她富有智谋和胆识，在异变中首先意识到万宝槌魔力的局限性，进而果断抛弃了她的本体———鼓身与鼓手，前往外面世界寻找新的魔力来源，并成功取代了万宝槌的魔力[辉针城设定文档]，也因此在异变后免于变回道具。\n在辉针城之后，雷鼓在官方游戏和官方出版物中也偶有出场。\n",
    lifestyle: "在普莉兹姆利巴乐团解散后，雷鼓与骚灵三姐妹结成“堀莉兹姆利巴乐团”。[东方文果真报]\n",
    abilities: "雷鼓拥有什么都能配合上节奏程度的能力，与声音关系密切。\n作为和太鼓的付丧神，雷鼓能直接操纵太鼓鼓身，作为子弹[符卡]或炮台[符卡]。\n另外，雷鼓还能使用与雷电有关的弹幕[符卡]。\n",
    appearance: "ZUN在设计雷鼓时为她添加了现代元素，或者说是一些科幻感。[人妖名鉴]\n雷鼓有着一头红色及肩短发，略卷。\n她有着红色的眼瞳。\n她上身穿着白色西装，西装敞开，里穿黑色衬衣，在辉针城中衬衣上有深红色花格。胸前系着领带，领带在辉针城中为淡紫色并有逆十字的图案，在人妖名鉴中为红色。\n她系着黑色腰带。\n她下身穿着白色短裙，前方分开。\n她脚穿黑色短靴，后跟装有白色鼓槌，鞋带为红色。\n她身边环绕着一圈六角形鼓面的电子鼓，鼓面上绘有巴纹。身下是装饰有花朵纹样的低音鼓。\n她手持两根鼓棒，在辉针城中用左手，在人妖名鉴中两手各一根。\n",
    relationships: "她向身边同样因万宝槌魔力而诞生的九十九八桥、九十九弁弁等付丧神伸出援手，传授继续存在而不再变回道具的方法。\n她与骚灵三姐妹结成了“堀莉兹姆利巴乐团”。\n"
  },
  {
    id: "Tatara Kogasa",
    name: "多多良小伞",
    alias: [],
    introduction: "多多良小伞是东方Project系列中的官方角色，首次登场于东方星莲船，担任星莲船的二面Boss和EX面道中Boss。\n她是唐伞妖怪，属于付丧神。\n她尽管被人遗忘，却性格开朗，亲近人类。\n在星莲船之后，小伞还作为敌机登场于东方神灵庙和东方刚欲异闻中，在官方出版物中也时有出场。\n",
    lifestyle: "小伞不袭击人类，也不会去吃人[口授]，只会惊吓人类，看到被吓到的人会觉得心情舒畅[星莲船设定文档]。\n为了吓扫墓者，她总是在命莲寺里呆着，但并没有入门[口授]，大部分时间都呆在命莲寺的墓地里[神灵庙设定文档]。为了吓人而老是光顾人类村落[口授]。此外她也经常出没于博丽神社与守矢神社[口授]。\n但是小伞基本吓不到人，还因为造型奇葩在孩子圈里意外地受欢迎[口授]。\n小伞经常参加宴会，而且还会在宴会上做出把骷髅头放在伞上转着玩[口授]这种恐怖的举动。\n",
    abilities: "小伞拥有惊吓人类程度的能力。\n锻造是多多良小伞的拿手技能。她曾帮助博丽灵梦锻造封魔针。[茨歌仙第27话]\n",
    appearance: "小伞有一头蓝色及肩短发，略卷。\n她有着官方作品中唯一的异色瞳，眼瞳为左红右蓝。\n她上身穿着白色长袖和蓝色马甲，裙子中间有黑色一字扣，上下一字形和叉形各有一个。\n她下身穿着浅蓝色及膝裙，裙摆上有一圈白色花纹，图案为一根线上有许多圆圈。\n她裸足穿一双木屐，鞋带为红色。\n她手里举着一把茄子色的唐伞，唐伞上附有巨大的红色单眼和从半张着的红色嘴巴里吐出的巨大红色舌头。伞柄末端穿着白色短袜，也穿着一只红色鞋带的木屐。伞的样子是为了配合吓人，照着一本踏鞴改变成那样的[口授]。\n",
    relationships: "暂无相关资料"
  },
  {
    id: "Daiyousei",
    name: "大妖精",
    alias: [],
    introduction: "大妖精是东方Project系列中的非正式官方角色，首次登场于东方红魔乡，担任红魔乡的二面道中Boss。\nZUN没有给予她任何公式性的设定，只是在回答提问时提及了自己对于这个角色的看法。\n她性格与其他妖精相同，单纯、自由、活泼、表情丰富且喜欢恶作剧。[东方书谱]\n在红魔乡之后，大妖精还作为道中Boss出场于妖精大战争中，在官方出版物中也偶有出场，作为背景出场时往往和其他妖精一同出现。\n",
    lifestyle: "大妖精平常生活在雾之湖附近[东方书谱]，偶尔会外出活动。\n她和妖精一样喜欢玩耍与恶作剧。\n",
    abilities: "博丽灵梦认为，大妖精拥有在雾中畅游程度的能力。\n",
    appearance: "大妖精有着一头绿色及肩短发，右侧用黄色发带扎成侧马尾。\n她有着蓝色的眼瞳。\n她身穿蓝色无袖连衣裙，内穿白色短袖衬衣，在红魔乡中裙子及踝，裙摆有一圈白色图案；在人妖名鉴中裙子及膝，领口上还系着黄色领结。\n她身后长着一对翅膀，由黄色骨架和白色薄膜组成。\n她脚穿白色短袜，不穿鞋。\n在东方三月精V的特典中，有由比良坂真琴绘制的三只大妖精的形象，发色分别为绿色、蓝灰色、粉色。\n",
    relationships: "大妖精会和其他妖精一起玩耍。\n特别地，她绝大多数情况下会和琪露诺一同出场。\n"
  },
  {
    id: "Oo-Namazu",
    name: "大鲶鱼",
    alias: [],
    introduction: "大鲶鱼是东方Project系列中的官方角色，于东方绯想天对话首次被提及1，正式登场于东方非想天则。\n在非想天则之后，大鲶鱼还登场于东方凭依华中比那名居天子的符卡坠符「落入大气圈，梦想倾泻地表」、「把大地重塑成，有梦的世界吧！」、「巨型战舰 无双大鲶鱼参见」和「全宇宙人的绯想天」。\n",
    lifestyle: "天子所说的大鲶鱼在地底深处成长，活动受到要石的抑制。[绯想天]\n它心情不好，一旦闹腾起来地面就会发生毁灭性的大地震。[绯想天]\n",
    abilities: "暂无相关资料",
    appearance: "梦境中的大鲶鱼躯干部侧扁，可胀可缩，体高大于头高，全身外部轮廓呈“凿”形。\n它头部扁平，口阔，口裂浅，亚上位，末端仅与眼前缘相对；下颌突出，上、下颌及犁骨上有密而骨质的细齿，齿带连成一片。\n它的背部凸起，为油黄色，有黄褐色斑点；腹部平而柔软，为灰白色。\n",
    relationships: "天子所说的大鲶鱼是天人使役的神。[绯想天]\n"
  },
  {
    id: "Tenkyu Chimata",
    name: "天弓千亦",
    alias: [],
    introduction: "天弓千亦是东方Project系列中的官方角色，首次登场于东方虹龙洞，担任虹龙洞的六面Boss。\n她是司掌集市交易的神明，是集市之神和交易之神[虹龙洞]。\n她有着商人的冷酷性格，与饭纲丸龙尔虞我诈。\n在虹龙洞之后，她还在弹幕狂们的黑市中出场，在官方出版物也时有出场。\n",
    lifestyle: "千亦在与饭纲丸龙合作前失去了神力，只是一位寒酸的落魄神明[虹龙洞]，失去了立足之地而濒临消失[虹龙洞]。她在集市的交易中才逐渐取回了神的力量[虹龙洞设定文档]。\n",
    abilities: "千亦拥有剥夺所有权程度的能力。\n",
    appearance: "千亦有着一头深蓝色齐脖短发，略卷。头戴渐变彩虹色的发箍。\n她有着蓝紫色的眼瞳。\n她穿着用拉链和黄色绳索连接缝合七色布片而成的长袖及膝连衣裙，从袖口到裙摆布片颜色呈彩虹色顺序排列。身后披着披风，里侧是蓝天白云的图案，外侧是纯白色，披风前面有红色扣子，用红色绳索系住。\n她腰间系着棕色腰带，左侧别着一个黄色布袋。\n她脚穿粉色靴子，靴帮上部各系着一个白色蝴蝶结。\n她脚下有黄色火焰状气场，姿势为右手指天左手指地。\n",
    relationships: "饭纲丸龙利用千亦以在集市中捞上一笔，而千亦也想利用与龙的合作取回神的力量，并企图独吞卡牌的利益[虹龙洞]。\n千亦对菅牧典信赖备至，找典询问各种意见，因而得到恩惠，也不得不走向与自机对战失败的毁灭性结局。\n"
  },
  {
    id: "Tenkajin Chiyari",
    name: "天火人血枪",
    alias: [],
    introduction: "天火人血枪是东方Project系列中的官方角色，首次登场于东方兽王园。\n她是天火人，身缠火焰与血液、原形不明的被诅咒的妖怪。\n人们认为她的原形是巨大的貉，地上的人类将她称为卓柏卡布拉，但这些认识都不正确。\n她的立绘剪影与孙美天和三头慧之子一同出现在兽王园的封面上。\n在兽王园之后，血枪几乎再未在官方作品中出场过。\n",
    lifestyle: "血枪通过吸食生物的血液生活。\n她原本居住在地狱，靠血池地狱的血生活。但温吞的生物血液无法满足她，于是她追寻着怨念翻涌的诅咒之血，来到了旧血池地狱，觉得旧血池地狱安逸宜居，便定居于此。\n后来，饕餮尤魔来到旧血池地狱。血枪与尤魔本就是同道中人，于是立即意气相投，血枪便加入了刚欲同盟。同时，她也在日白残无的手下办事。\n",
    abilities: "血枪拥有操纵血与火程度的能力。\n",
    appearance: "血枪有着一头皇家紫色过肩卷发，头顶长着一只洋红色的独角。\n她有着红色的眼瞳。\n她上身穿着豆绿色短袖衬衫，前侧右下方写着黑色的“Welcome to Hell”，衬衫边缘处的白色花纹为字母「ATGC」拼接而成，一段「ATGC」后是一段镜像对称的「ATGC」。\n衬衣下摆右腿处有3根空针管，左腿处有3根装有血液的试管。\n她下身穿着格状短裤，整体为青色+森林绿，边缘为白色。\n裸足。\n她身后有一条覆盖角质鳞片的洋红色尾巴。\n她身旁跟着5个血红色火球。\n",
    relationships: "血枪与日白残无是老相识，从残无口中得知饕餮尤魔也在旧血池地狱。\n和尤魔相遇之后，血枪和尤魔立刻就意气相投，随后血枪加入尤魔的刚欲同盟。\n她与火焰猫燐是友人[兽王园]。\n"
  },
  {
    id: "Orange",
    name: "奥莲姬",
    alias: [
      "橙子"
    ],
    introduction: "\n",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Okunoda Miyoi",
    name: "奥野田美宵",
    alias: [
      "鲸鱼妹"
    ],
    introduction: "奥野田美宵是东方Project系列中的官方角色，首次登场于东方醉蝶华，担任醉蝶华的主要角色。\n她是人类村落的酒馆“鲵吞亭”的店花，自称住在店内[醉蝶华3话]、实际上也正是如此[醉蝶华54话]的座敷童子，但她自认为所住的家在伊吹瓢里[醉蝶华35话]。\n在醉蝶华之外，美宵几乎再未在官方作品中出场过。\n",
    lifestyle: "美宵平时生活和居住在酒馆“鲵吞亭”中，在店主察觉不到的情况下做着接待客人、准备酒饭等工作。\n每当深夜时分，鲵吞亭关门，她则会用店面经营起妖怪专用酒馆“蚕食鲵吞亭”。\n她自称为了前往房子外面的世界，自己便附在伊吹瓢中，从而移动到别的场所并参加了四处举办的宴会。[醉蝶华3话]\n她自称“从妖怪手上保护鲵吞亭是我的工作[醉蝶华3话]”。\n",
    abilities: "博丽灵梦认为，美宵拥有操纵酒醉者记忆程度的能力。\n她非常擅长料理，不管是宴会用的豪华料理还是下酒小菜都手到擒来。\nZUN称美宵“大概打不了架”。[东方STATION]\n作为座敷童子，美宵有着不论在何地都能回家的归巢本能[醉蝶华54话]，此外还可以通过喝大量伊吹瓢的酒搬家回到伊吹瓢内[醉蝶华54话]。\n",
    appearance: "美宵有着一头腮红粉色及肩短发，头顶戴有一顶形似鲸鱼的蓝色帽子，鲸尾搭左肩上。\n她有着庭芜绿色的眼瞳。\n她上身穿着水缥色职业装V领短袖衬衫，在胸部有用红色蝴蝶结系着打成叉的白色布料。\n她下身穿着形似伊吹瓢的长裙，在两侧也有用红色蝴蝶结系着打成叉的白色布料。长裙前面用红白相间的腰带系着一件“帆前挂”围裙，围裙的上方有一个被白色方块框住的“鯢”字，两侧各有两个白点，底部有一只在海洋中遨游的鲸鱼。\n她脚穿系有红色蝴蝶结的白色足袋和原始木屐。\n在人妖名鉴中，她左手端着一盘菜，右手握着伊吹瓢，站在鲵吞亭的前面。\n",
    relationships: "美宵虽然在鲵吞亭做着看板娘的工作，但是店主对此并不知情，也不知道美宵的存在。\n美宵在最近被伊吹萃香允许[醉蝶华39话]住在伊吹瓢里，成为萃香的眷属[醉蝶华35话]，萃香认为美宵是自己的醉魔[醉蝶华3话]。\n在醉蝶华的时间线之前，美宵就与博丽灵梦、雾雨魔理沙等人认识了，但两人都失去了这段记忆，直到再次由美宵提醒后才想起[醉蝶华1话、醉蝶华2话]。\n在萃香和二岩猯藏的计谋下，美宵在深夜开了面向妖怪的“妖怪专用鲵吞亭”，后由射命丸文改名“蚕食鲵吞亭”。\n后来，驹草山如在白天租用鲵吞亭的店面开办面向人类的赌场分场。\n"
  },
  {
    id: "Himekaidou Hatate",
    name: "姬海棠果",
    alias: [
      "姬海棠羽立",
      "姬海棠极",
      "羽立",
      "极",
      "果果"
    ],
    introduction: "鸦天狗（文花帖DS）\n天狗（人妖名鉴）\n姬海棠果是东方Project系列中的官方角色，首次登场于东方文花帖DS，担任文花帖DS的自机。\n她是鸦天狗，是新闻《花果子念报》的作者。\n相较于射命丸文，果没有文在新闻取材上的蛮干劲，也没有文那么傲慢。[DS]\n在DS之后，她在官方游戏与出版物中登场次数不多。\n",
    lifestyle: "在文花帖DS的故事之前，从未外出取材，而是用念写的能力拍摄照片，再根据照片撰写新闻。[DS设定文档]\n在文花帖DS之后的官方漫画中，可以看到果外出取材的身影。[茨歌仙]\n她所用的相机是河童制造的[DS]，可以连拍，而且换胶卷的时间很短[DS]。\n",
    abilities: "果拥有使用念写程度的能力。\n此外，果的相机有连拍功能[DS]。\n",
    appearance: "果有着一头棕色齐耳短发，用紫色蝴蝶结扎成及胸的双马尾。头戴小型紫色六角帽（头襟）。\n她有着棕色的眼瞳。\n她上身穿着短袖衬衫，在DS中为淡粉色，在人妖名鉴中为白色。衬衫的袖口系着蝴蝶结，打着领带，蝴蝶结和领带在DS中为黑色，在人妖名鉴中为深蓝色。领子打着粉色褶子。\n她下身穿着紫黑相间的格子短裙。在DS中，右腰挂着一个棕色荷包。\n她穿着黑色及膝袜和天狗标志性的一齿高木屐，腿上绑着带子。木屐和带子在人妖名鉴中为红色，而在DS中，木屐为棕色，带子为紫色。\n左手持翻盖手机样子的念写相机，相机镜头下有一个红色爱心图案。相机的翻盖转轴挂着一只毛笔，DS中挂在右侧，人妖名鉴中挂在左侧。\n",
    relationships: "果和射命丸文同为鸦天狗，果将文视为新闻方面的竞争对手，文也会故意歪曲果的报道来抨击果的《花果子念报》[文果真报]。\n作为鸦天狗，果是饭纲丸龙的下级。[史纪]\n"
  },
  {
    id: "Himemushi Momoyo",
    name: "姬虫百百世",
    alias: [
      "大蜈蚣"
    ],
    introduction: "姬虫百百世是东方Project系列中的官方角色，首次登场于东方虹龙洞，担任虹龙洞的EX面Boss。\n她的种族大蜈蚣拥有丑恶的外形和令人不快的毒液，是很受人厌恶和畏惧的妖怪。\n她性格豪爽，十分好战，同时对实力强大的人则很亲近。\n在虹龙洞之后，百百世还在弹幕狂们的黑市中出场，在官方出版物中则几乎再未出场过。\n",
    lifestyle: "在从虹龙洞挖出龙珠后，百百世与饭纲丸龙交易，接受了开山挖掘虹龙洞的职责，从此每天都在辛辛苦苦挖龙珠。\n",
    abilities: "百百世拥有噬龙程度的能力。\n她还拥有着强大的魔力，为她的最强传说再添一笔。\n此外，ZUN描述百百世什么都能吃，人也会吃，不如说吃人更简单[东方Station#27 虹龙洞特集]。\n",
    appearance: "大蜈蚣是一种拥有丑恶的外形[虹龙洞设定文档]的妖怪，百百世的设计上较多地体现出了这一点。\n她有着一头灰蓝色及腰长发，前额右侧有一绺像角一样翘起的头发。\n她有着灰蓝色的眼瞳。\n她左手拿着镐，右手拿着锹，镐头、锹头、锹把为金色。\n她上身穿着黑色短袖，上面有黄色蠕虫状花纹。领口、袖口别着大量绿色圆环。腰间则缠着环环相扣的绿色圆环。身后系着橙色大蝴蝶结。小臂各用三条橙色丝带系着蝴蝶结。\n她下身穿着黑色及膝裙，也有同样的黄色蠕虫状花纹，裙摆也别着大量绿色圆环。\n裸足。小腿各用五条橙色丝带系着蝴蝶结。\n",
    relationships: "百百世和饭纲丸龙是亲友，不同于其他妖怪，龙不厌恶与百百世相会。龙在百百世挖出龙珠时，与百百世进行交易，百百世接受开山挖掘虹龙洞的龙珠的职责，报酬是挖出的一部分龙珠，而剩下的交给龙制作能力卡牌。\n龙通过菅牧典向百百世作出指示。百百世对典信赖备至，会找典询问各种意见，因此得到了恩惠。而百百世不得不与自机战斗，也是缘于典的教唆。\n"
  },
  {
    id: "Nazrin",
    name: "娜兹玲",
    alias: [
      "纳兹琳",
      "纳兹铃",
      "娜兹琳",
      "老鼠"
    ],
    introduction: "妖怪鼠（星莲船）\n妖兽（人妖名鉴）\n娜兹玲是东方Project系列作品中的角色，首次登场于东方星莲船，担任星莲船的一面Boss与五面道中Boss。\n她是寅丸星的使魔妖怪鼠，是真正的毘沙门天派来帮助和监视寅丸星工作的高等妖怪。[口授]\n因为有毘沙门天做她的后盾，她性格表面上骄傲自大，但其实她真正的性格比较胆小，一旦遇到什么可怕的事情立刻就会逃之夭夭。对她过于谦逊反而会让她自大起来，用盛气凌人的态度胁迫她才能拜托到她寻宝。[口授]\n在星莲船之后，娜兹玲还作为自机登场于东方兽王园中，在官方出版物中也偶有出场。\n",
    lifestyle: "娜兹玲虽然属于命莲寺势力，却并不在寺中修行。她为了确认无缘塚附近埋藏着宝藏这个传闻的真伪，平时住在无缘塚附近搭建的一间临时棚屋[口授]，平时若非寅丸星找她有事之外，娜兹玲也不会主动留在命莲寺。\n无缘塚因为容易与冥界接壤，且此地结界稀薄等原因[史纪]，时常会有各种道具流落此处，她对这些事物颇有兴趣。\n作为毘沙门天的部下，她对其他神明没有信仰之心。[口授]\n",
    abilities: "娜兹玲拥有寻物必见程度的能力。\n",
    appearance: "娜兹玲身材不高大[口授]。\n她有着一头灰色及肩短发，略卷，头上长着灰色圆形老鼠耳朵。\n她有着深红色的眼瞳。 \n她上身穿着黑色长袖上衣，袖子为白色，肩披蓝灰色披肩，披肩上边缘和身前开口两侧边缘为金色，在兽王园中披肩边缘有虚线镂空，胸前挂着天蓝色灵摆。\n她下身穿着黑色及膝裙，裙摆处有虚线镂空，内穿白色灯笼裤。\n她脚穿白色三折袜和黑色乐福鞋，在星莲船中也可能穿的是泡泡袜，在口授中则穿的是玛丽珍鞋。\n她身后长着细长的老鼠尾巴，尾巴末端挂着一个有一只小老鼠的小篮子，篮子在星莲船中为深黄色，在兽王园、人妖名鉴中为深蓝色。\n她手持探测棒，探测棒两端分别是N与W，S与E的形状。\n",
    relationships: "娜兹玲表面是寅丸星的使魔，对星会尊称“主人”；实际却是毘沙门天的弟子和部下，被毘沙门天派来帮助和监视寅丸星工作。\n她是敬仰着圣白莲的妖怪之一。\n她可能是森近霖之助雇来帮他捡拾道具的助手。[香霖堂][不确定的内容]\n她与火焰猫燐是旧地狱的老相识[兽王园]，但和阿燐却处不来。\n"
  },
  {
    id: "Chang'e",
    name: "嫦娥",
    alias: [],
    introduction: "嫦娥是东方Project系列中的官方角色，在东方儚月抄中首次被提及。\n她是月之都的一位女神，统领着无数的月兔。她有着强大的力量和天赋的才能，但并不会出现在外界面前。「嫦娥」是地上的叫法，并非她在月之都的名字。[儚月抄]\n她也是一位生活遭到幽禁的、谜一样的存在。她因为喝下了禁忌的蓬莱之药被监禁着，而几千年来多数的月兔为她捣年糕赎罪。名义上捣年糕，其实是制作蓬莱之药。[儚月抄]\n在儚月抄之后，嫦娥还在东方绀珠传中被提及。\n",
    lifestyle: "由于喝下了禁忌的蓬莱之药，产生了月之民所忌惮的污秽，嫦娥被长期以蟾蜍的模样囚禁于月之都中。\n",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "羿是她的丈夫，但已经被纯狐杀死。\n羿杀死了纯狐的儿子，嫦娥连带着拥戴她的月之民也因此招致了纯狐的强烈怨恨。\n由于羿击落了太阳（阿波罗），地狱的黑暗受到减弱，地狱的女神赫卡提亚·拉碧斯拉祖利也对嫦娥抱有怨恨。\n包括Reisen和未叛逃时的铃仙·优昙华院·因幡、清兰、铃瑚在内，所有的月兔都是她的下属。\n"
  },
  {
    id: "Son Biten",
    name: "孙美天",
    alias: [
      "猿神",
      "大圣"
    ],
    introduction: "孙美天是东方Project系列中的官方角色，首次登场于东方兽王园。\n她本是被猴山驱逐的孤猴。[兽王园]后来，她听信了他人的妄言，认为自己是孙悟空转世，将曾掌控圣域的幽灵吞入体内成为猿神。之后，美天被日白残无引荐给吉吊八千慧，就此成为了鬼杰组的一员。\n她的设计参考了中国四大名著之一的《西游记》中家喻户晓的孙悟空。\n她的立绘剪影与天火人血枪和三头慧之子一同出现在兽王园的封面上。\n在兽王园之后，美天尚未在官方游戏中再次登场过，在官方出版物中则偶有出场。\n",
    lifestyle: "美天原本是被猴山驱逐的孤猴，被日白残无怂恿，吞噬圣域的幽灵[兽王园]后觉醒成为猿神。\n她目前是鬼杰组游击队员[兽王园]，但生活在幻想乡内妖怪之山上圣域的森林[兽王园]里。\n她在鬼杰组中拥有设定，如“是从被雷劈中的石头里诞生的”[兽王园]。\n她认为自己是孙悟空转世，自称“幻想乡的齐天大圣”[兽王园]或“圣域的齐天大圣”，但是这其实只是在开玩笑[兽王园]。\n在摆脱残无的影响、变得清醒后，她想要成为圣域中前所未有的创新的妖怪，于是开始酿炼酒，还打算将炼酒向外卖。[醉蝶华]\n",
    abilities: "美天拥有操纵野生猿猴程度的能力。\n由于曾将幽灵吞入腹中，化为了鬼，她觉醒了鬼的力量。[兽王园设定文档]\n",
    appearance: "美天有着一头及胸棕发，用金色头绳绑着下双马尾，头戴与孙悟空相似的紧箍，但只是单纯的装饰，并没有用[兽王园]。\n她有着红色的眼瞳。\n她衣服的样式、风格、菱形镂空与住在圣域的坂田合欢类似，仅颜色变为上绿、中黄、下蓝，裙摆变为过膝且只有左臂穿着白色袖子。此外，右手手腕、左手袖子上沿均有金箍。\n裸足。\n她身后长着一条长长的棕色猴尾。\n她裙摆和右手手腕金箍周围有黄色夹子形装饰，样子很像薯条，甚至被高丽野阿吽认成了薯条[兽王园]。\n她手持装有红色和紫色物体的细长试管，虽说如此，但它实际上两端都有开口[早苗线结局插图]，美天时常用尾巴缠绕住它。\n",
    relationships: "美天被日白残无怂恿，吞噬圣域的幽灵成为猿神。残无还将美天引荐给吉吊八千慧。\n吉吊八千慧是美天的上司。但实际上美天听命于残无，是接受了残无的命令而成为八千慧的部下。不过最后她还是自愿为八千慧效力。\n她自称讨厌三头慧之子、高丽野阿吽等犬类，但只是在迎合猴子和狗不共戴天的说法表演。\n在还是普通猴子的时候她曾多次造访守矢神社，单方面认识东风谷早苗。\n"
  },
  {
    id: "Usami Sumireko",
    name: "宇佐见堇子",
    alias: [],
    introduction: "宇佐见堇子是东方Project系列中的官方角色，首次登场于东方深秘录。\n她是外面世界的女高中生，深信自己和其他人类不是同一种族，也确实是真正的超能力者。\n她有着自信型御宅族身上常见的孤芳自赏的性格，认为自己被疏远是因为其他人无知而又愚蠢，在现实中反而在刻意疏远身边的人，对其他人有着优越感。\n堇子就是现代日本的病态特性的集合体。[绀珠传访谈]\n在深秘录之后，堇子还作为自机登场于东方凭依华和秘封噩梦日记中，在官方出版物中也时有出场。\n",
    lifestyle: "堇子是就读于外面世界东深见高中的一年级学生[东方深秘录]。\n她从初中起就交不到什么朋友，也认为交朋友没必要，并独自对自己能够使用超能力的理由、灵异现象、被称为都市传说的事物等等进行研究，一直过着别人来看很凄惨、自己却觉得很充实的校园生活。[深秘录设定文档]\n堇子进入高中后，为了将身边的人赶走而召集了一批人，这就是亲自曝光异世界的秘密的非公认灵异俱乐部“秘封俱乐部”，堇子自任为俱乐部的会长。[深秘录设定文档]\n在破坏博丽大结界失败之后，凭借都市传说“二重身”，堇子经常通过做梦来到幻想乡。\n",
    abilities: "堇子拥有操纵超能力程度的能力。这个能力具体包括以下内容：\n堇子真正的灵异是“二重身”。[深秘录]\n",
    appearance: "堇子打扮的原型是怪人红斗篷[深秘录]。\n她有着一头棕色及胸波浪头发，头戴黑色圆顶礼帽，帽子前方系着白色蝴蝶结。\n她有着棕色的眼瞳，戴着红框眼镜。\n她上身穿着白色长袖衬衣和堇色上衣，上衣有着紫色和白色条纹，在噩梦日记中她的上衣偏粉。身披外黑内红的高领披风，内侧有白色的卢恩文字，披风在深秘录、凭依华、人妖名鉴中用金色的扣固定，并有黑色带子垂下、在噩梦日记中，则用白色骷髅头饰物固定。\n她下身穿着样式与上衣相同的过膝裙。\n她腿穿白色及膝袜，顶端系着白色蝴蝶结，蝴蝶结在深秘录、凭依华、人妖名鉴中为白色，在噩梦日记中为黑色。她脚穿黑色皮鞋。\n在深秘录、凭依华、人妖名鉴中，她手戴白色手套。在噩梦日记中，她左手拿白色的智能手机，手机壳上有蓝色的ESP卡片的图案。\n",
    relationships: "与未来科学世纪中的秘封俱乐部成员宇佐见莲子拥有相同的姓氏，但是没有明确证据表明两人存在某种关系。\n茨木华扇自发监视[凭依华]着堇子，为此她与堇子交好。\n当堇子进入幻想乡时，博丽灵梦表面上负责保护她的安全[文果真报]，但其实是在把她当成危险分子进行着监视[香霖堂]。\n堇子昵称灵梦为“灵梦亲（レイムッチ）”。[秘封噩梦日记、GoU]\n与二岩猯藏曾在外面世界的街上遇到并一起逛街游乐。[文果真报]\n森近霖之助对堇子带来的小玩意儿评价很高[文果真报]。\n霖之助最近似乎一旦有不知该怎么用的器具，就会去找堇子。[新香霖堂8话]\n后来，开始在香霖堂给霖之助打工，帮助霖之助鉴定外面世界的物品之类的。[新香霖堂9话]\n"
  },
  {
    id: "Usami Renko",
    name: "宇佐见莲子",
    alias: [],
    introduction: "宇佐见莲子是东方Project系列中的官方角色，首次登场于莲台野夜行。\n她是近未来的女大学生，是灵异社团“秘封俱乐部”的成员之一。\n在莲台野夜行之后，莲子便一直作为主要角色登场于ZUN's Music Collection系列的专辑中，她也一直出现在系列专辑的封面上。\n",
    lifestyle: "宇佐见莲子是外面世界的一名大学生，在京都的一所大学中[卯酉东海道]专攻超统一物理学，最近在做弦论方面的研究。[梦违科学世纪]。\n莲子与玛艾露贝莉·赫恩一同经营着名为秘封俱乐部的社团，进行着在科学世纪探寻遍布四处的结界的活动[莲台野夜行、梦违科学世纪]。\n她们生活的时代被称作科学世纪。其中科学昌明而信息科技高度发达，人们能够平等地获取信息，而物理学也进入了解释和哲学的时代。[大空魔术]相反的是，想象力灭绝了，而无法解释的事物则被当做一个错误抹煞，无法解释的神秘也被否定。[伊奘诺物质]相比起数量与获得信息的速度，人们更愿意追求质量[燕石博物志]，也存在富有的人更愿意选择古老的方式进行出行、享受的逆转的思潮。[卯酉东海道、旧约酒馆]\n",
    abilities: "暂无相关资料",
    appearance: "莲子有着一头棕黑色（有时会略显酒红色）的齐肩短发或过肩长发（但程度不会超过肩胛骨），整体较直而发尾处略有波浪卷，大多时候都披散着头发，部分作品中会做一些修饰，戴着黑色圆礼帽，上面一般绑着白色蝴蝶结。\n她一般上身穿着白色衬衫，下身穿着黑色过膝裙，脚穿白色短袜。\n",
    relationships: "莲子与玛艾露贝莉·赫恩是关系要好的朋友。她们在同一所大学学习，并且都是灵异社团秘封俱乐部的成员。[莲台野夜行]\n与秘封俱乐部初代会长宇佐见堇子拥有相同的姓氏。因此存在猜测，宇佐见莲子与宇佐见堇子之间存在亲缘关系。\n"
  },
  {
    id: "Miyadeguchi Mizuchi",
    name: "宫出口瑞灵",
    alias: [
      "反狱王"
    ],
    introduction: "宫出口瑞灵是东方Project系列中的官方角色，首次登场于东方智灵奇传，担任智灵奇传的反派角色。\n她是被旧地狱新近羁押、并在不久前逃脱的永久罪人，人称“反狱王”的可怕怨灵，也是一位心怀对幻想乡敌意的复仇者。\n瑞灵性格阴暗，行动无法捉摸[智灵奇传5-5话]且慎重狡猾[智灵奇传1-4话]。\n瑞灵在智灵奇传之外几乎再未出场过。\n",
    lifestyle: "瑞灵曾作为永久罪人被羁押在旧地狱，但目前她已成功脱逃，在幻想乡四处流窜，实施复仇。\n她凭借怨灵的附身能力，先后引起了多起昏迷事件，每每在汲取大量魔力之后逃之夭夭。\n",
    abilities: "博丽灵梦认为，瑞灵拥有夺取全身心程度的能力。\n老一辈怨灵们都认为瑞灵本事很大。[智灵奇传5-5话]\n",
    appearance: "瑞灵有着一头蓝色及胸长发，后面用骷髅头装饰的头绳系着高马尾。两鬓用红白色装饰的束发带各扎着一束发髻，在束发带中间红粗实线两边的白色部分里有两条红细虚线。\n她有着浅蓝色的眼瞳，瞳孔为白色。\n她上身穿着红白相间的横条纹外套，在胸部和衣服底部为红细虚线，其他位置为红粗实线，外套在肘关节和手腕处也有红细虚线。外套里面穿着黑色连衣裙。\n她下身穿着红白相间的横条纹短裙，在腰部和大腿处为红细实线，其他位置为红粗实线。\n她身下没有腿，而是有两条白色的灵体。\n她双腕绑着墨灰色的手铐，左腕还绑着正红色布条，右腕还绑着紫色布条。双手带着白色皮手套，左手拿着金黄色镣铐的一端，另一端铐在自己的脖子上。\n在智灵奇传彩页中，她的衣服上有两颗扣子，身上还缠绕着一条蜈蚣。\n",
    relationships: "宫出口家族与博丽神社关系匪浅，他们在博丽神社担任侍奉工作的历史可以追溯到幻想乡成立之前[智灵奇传6-2话]。同时，瑞灵心怀对幻想乡，尤其是对博丽神社的恨意，认为博丽神社未能担起降妖除魔的责任，让人类已经输给了妖怪[智灵奇传4-1话]。\n古明地觉作为旧地狱怨灵的管理者，在得知瑞灵脱逃的消息后，主动担任起追捕她的侦探职责，并任命火焰猫燐担任自己的助手。随着故事的进行，博丽灵梦、雾雨魔理沙、八云紫、射命丸文、姬海棠果、芙兰朵露·斯卡蕾特、圣白莲等角色也先后加入了对瑞灵的缉捕。\n在瑞灵中计而再度被困在旧地狱之后，星熊勇仪与瑞灵结成了合作关系，伊吹萃香也出于某些尚不明确的目的为她提供了帮助。\n"
  },
  {
    id: "Miyako Yoshika",
    name: "宫古芳香",
    alias: [
      "僵尸"
    ],
    introduction: "宫古芳香是东方Project系列中的官方角色，首次登场于东方神灵庙，担任神灵庙的三面Boss。\n她是霍青娥操纵的僵尸，本是日本古代的尸体，现在在青娥手下当差，是青娥的所有物。虽然是僵尸，但她其实和丧尸差不多。\n她什么都没在想，什么都感觉不到，只会忠诚而直接地执行青娥的命令。\n她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "芳香的身体被霍青娥施了防腐的咒语，所以不会腐烂。\n她的身体非常僵硬、关节部位无法活动，因此她不能正常地走路。\n她按照青娥贴在额头上的符行动。\n在神灵骚动后，她生活在幻想乡中。\n",
    abilities: "芳香拥有无所不吃程度的能力。\n芳香咬过的人类会暂时变成僵尸。\n由于不会感觉到痛楚和疲惫，所以她能突破正常肉体的限制而发挥出常人所没有的邪门怪力。\n不过，她的思考回路和上个时代的电脑处在同一水平。[神灵庙设定文档]\n",
    appearance: "芳香身体表面没什么瑕疵与伤口。[口授]\n她有着一头深蓝色齐肩短发，头戴青紫色的鸭舌帽，前面有金色的星形徽章。\n她有着深蓝色的眼瞳，额头上贴着符，在人妖名鉴中上面写着红色的“敕令 随身保命”。\n她上身穿着红色短袖上衣，类似于唐装，领口用黑色束绳系着蝴蝶结，胸口有三对青花形的一字扣，衣摆和袖口为茶色，袖口有粉红色锯齿状花边。\n她下身穿着黑色及膝裙，有两条交叉的粉红色锯齿状蕾丝，裙摆有茶色桃花状装饰和一条开衩，两侧各有一个青花形纽扣，开衩在神灵庙中位于左侧，在求闻口授中位于正前方，在人妖名鉴中位于右侧。黑裙内穿一条略短的粉红色裙子，也有锯齿状花边。\n她脚穿一双黑色皮鞋。\n因为关节无法活动，四肢总是僵直的，无法弯曲。\n",
    relationships: "霍青娥在来到日本后用道术做成了芳香。青娥通过在额头上贴符操纵芳香，对芳香有所有权，不给予芳香人权。\n"
  },
  {
    id: "Toramaru Shou",
    name: "寅丸星",
    alias: [
      "大师兄"
    ],
    introduction: "寅丸星是东方Project系列中的官方角色，首次登场于东方星莲船，担任星莲船的五面Boss。\n她是山上巨大的肉食动物被人们畏惧而变成的[星莲船采访]虎形的妖兽1。她被圣白莲选中介绍给毘沙门天成为其化身与代理人，很快成为命莲寺中仅次于白莲的伟大的僧侣。\n表面上，她性格温厚，冷静之中又带着一点威严。然而，她真实的性格其实是非常感性的，有时她也会变得激动。\n她在官方游戏与出版物中登场次数不多。\n",
    lifestyle: "她曾是在寺庙所在的山上是最正派、也最有威信的妖怪。在成为毘沙门天的化身后，星能非常优秀[星莲船设定文档]地完成毘沙门天的事务。\n现在住在命莲寺，在白莲繁忙的时候，多半是由她来代替守护命莲寺[口授]。\n虽然她身在寺中，但是酒量相当不错，不过偶尔也有喝醉的时候。[口授]\n",
    abilities: "星拥有招财进宝程度的能力。\n星不擅长体术，她的强大有八成是因为手中的那座别名激光宝塔的毘沙门天的宝塔。[口授]\n",
    appearance: "星的样子模仿尊像化的毘沙门天，和尊像化的毘沙门天非常相似。[口授]\n她有着一头黄黑相间的齐脖短发，头顶有莲花状的橙色头饰。\n她有着黄色的眼瞳。\n她身穿有着宽大的白色袖子和白色衣领的暗红色长袍，长袍下摆为橙色，交界处的图案形似“｛”，在尖端有小圆点，在正前方有一个枣核形橙色部分。腰间披着一条虎纹短裙，裙摆有白色荷叶边。领口用黑色带子系着蝴蝶结，腹部用两条黑色带子系着一个金色圆环。\n背后悬浮着一条白色丝带，绕成圆形。\n她下身在长袍下穿白色长裤，裤腿宽松。\n她脚穿黑色布鞋。\n在星莲船和人妖名鉴中，她左手持长矛，右手持毘沙门天的宝塔。在求闻口授中，则是左手持宝塔，右手持长矛。\n",
    relationships: "她是毘沙门天的弟子、化身和代理人。\n因此，她既是圣白莲的弟子，也是白莲祭祀与信仰的对象。\n娜兹玲表面上是星的使魔，实际上则是毘沙门天派来帮助和监视星工作的部下。\n"
  },
  {
    id: "Houju Chimi",
    name: "封兽魑魅",
    alias: [],
    introduction: "封兽魑魅是东方Project系列中的官方角色，首次登场于东方锦上京。\n她是魑魅，通常被认为是某种长耳妖兽的原形不明的妖怪，但她实际上是名为妖怪的概念诞生之前便已存在的古老物怪。\n",
    lifestyle: "在如今名为妖怪的概念诞生之前魑魅便已存在，从那时开始她就始终栖息在圣域之中。\n她只能栖居于山川、森林、河流这样的自然环境之中。\n唯有在人类和其他妖怪鲜少踏足的场所，她才会露面。\n",
    abilities: "魑魅拥有操纵山河之气程度的能力。\n",
    appearance: "魑魅有着一头白色及胸长发，头侧面长着三对末端为黑色的白色长耳。\n她有着黑色的眼瞳，额头有红色图案。\n她上身穿着绿叶构成的背心，从领口延伸出一圈由红色渐变至黄色的片状材料，有一条还搭在了左侧大臂上。\n她下身穿着由天蓝色渐变至白色的过膝裙，渐变处表现出水波的图案，裙摆有着被撕开的边缘。\n裸足。\n",
    relationships: "暂无相关资料"
  },
  {
    id: "Houjuu Nue",
    name: "封兽鵺",
    alias: [],
    introduction: "封兽鵺是东方Project系列中的官方角色，首次登场于东方星莲船，担任星莲船的四、六、EX面道中Boss和EX面Boss。\n她是十分不可思议的、真相不明的妖怪——鵺。\n一看到别人在兴致勃勃做事，她就不由得想在暗地里阻挠别人，这就是她的性格。[星莲船设定文档]\n在星莲船之后，鵺还作为EX面道中Boss登场于东方神灵庙中，在官方出版物中也时有出场。\n",
    lifestyle: "鵺曾在地底优哉游哉地过活，在间歇泉骚动后回到地上[星莲船设定文档]。现在已入门命莲寺，跟随圣白莲修行，然而却与其他的妖怪稍有些不合群[口授]。\n",
    abilities: "鵺拥有使原形无法识别程度的能力。\n她的其他能力包括可以召唤消去敌弹的UFO。[弹幕狂们的黑市]\n",
    appearance: "鵺有着一头黑色及肩短发，略卷。\n她有着红色的眼瞳。\n她身穿黑色短袖连衣裙，裙摆很短，左侧裙摆上有红色蛇状图案。领子及胸前拉链为蓝色，打着白色褶子。领口系着红色蝴蝶结。\n左手上戴着一个黑色护腕，右手上缠绕着一条红眼蛇，在星莲船、神灵庙、人妖名鉴中从头到尾由蓝色渐变为绿色，在求闻口授中为白色。\n她背后左侧有三只蓝色翅膀，像触手一样弯曲，末端为箭头状；左侧有三只红色翅膀，为倒V型，中间拐点处有空心圆。\n她穿着黑色过膝袜和红色皮鞋，皮鞋上有红色蝴蝶结。\n她右手持一把三叉戟，在星莲船、神灵庙、求闻口授中，手上的蛇尾巴缠绕在戟柄上。\n",
    relationships: "鵺后悔于阻挠圣白莲的复活，于是入门命莲寺，跟随白莲修行。\n她在命莲寺立场微妙，与早就在命莲寺中的娜兹玲、云居一轮、云山、村纱水蜜和寅丸星稍有些不合群。\n她与二岩猯藏是老相识。\n"
  },
  {
    id: "Syameimaru Aya，",
    name: "射命丸文",
    alias: [],
    introduction: "射命丸文是东方Project系列中的官方角色，首次登场于东方文花帖（书籍）。\n她是鸦天狗，是《文文。新闻》和《文文春新报》的作者，常以幻想乡的记者或天狗势力的使者的身份出场。\n她头脑聪颖，人前显得谨慎认真，战斗和交涉时往往游刃有余。加之强大的力量以及小报记者的身份，在幻想乡中并不招人喜欢[史纪]。\n在文花帖（书籍）之后，文还作为自机登场于东方文花帖、东方花映塚、东方绯想天、东方非想天则、东方文花帖DS、东方天空璋中，作为四面Boss登场于东方风神录中，在官方出版物中也时有出场。\n",
    lifestyle: "文主要活动于妖怪之山[史纪]，是一名天狗新闻记者。\n不过她也会在幻想乡各处奔走[史纪]。\n作为新闻记者，文的工作主要是记录各种有趣的事件。多次出场都是为了新闻取材。\n她喜欢小道消息，总是购买信息，和天狗们交换情报[花映塚设定文档]。新闻以八卦和谎言为主。\n她收集题材而写成的报纸《文文。新闻》主要记录幻想乡的女孩子们所发生的不可思议的事件[史纪]。\n文总是带着“文花帖”，这是将能成为新闻报道的题材记录起来的天狗的笔记本，里面混杂了各种相片和手写文字[史纪]。\n她还总把一只乌鸦带在身边[文花帖（书籍）]，当作自己的道具[文花帖（书籍）]。\n",
    abilities: "文拥有操纵风程度的能力，她可以使用团扇操纵风。\n她有着幻想乡最高的速度。[文花帖]\n率领乌鸦是鸦天狗的基本能力[符卡]，文当然也可以。这项能力召唤乌鸦的权限，是由类似人望的所谓鸟望所决定的[符卡]。文的鸟望达到了就算是第一次碰见的乌鸦只要一抬手它们就会跟着走的[文花帖（书籍）]的级别。\n",
    appearance: "文外表和人类并无太大差别[史纪]。\n她有着一头黑发，在花映塚、文花帖DS中过肩，在其他作品中及肩。头戴小型红色五角帽（头襟），在风神录、天空璋、人妖名鉴中帽子两侧会垂有各三个绒球，在史纪、绯想天、非想天则、人妖名鉴中帽子两侧为红绳，末端有穗。\n她的眼瞳在文花帖DS、人妖名鉴中为淡茶色，在其他作品中为红色。\n在史纪和文花帖（书籍）中，她背后有黑色翅膀。\n她上身穿白色半袖衬衫，在文花帖DS中系着黑色领巾，在其他作品中胸前系着黑色蝴蝶结。在风神录、文花帖DS中领边会挂有带和风枫叶图案的像是围巾的东西。在文花帖DS中右臂挂着“取材中”红袖章。\n她下身穿着黑色短裙，有白色褶边。在风神录、文花帖DS中，裙子前端有一块黄色的和风部分，在风神录中有枫叶图案。在天空璋中，裙子上有红、黄、绿叶图案和黄色、蓝色的其他图案。在花映塚、绯想天、非想天则中，裙子前端有一列红色扣子。在风神录、文花帖DS、天空璋中，她裙子边缘有白色虚线。\n她在风神录、天空璋中脚穿白色短袜，在史纪、文花帖DS、天空璋中脚穿黑色及膝袜，在风神录、人妖名鉴中袜子有白色褶边，在天空璋中袜子边缘有黑色虚线图案和蝴蝶结图案。她在风神录、文花帖DS中脚穿红色鞋子，在天空璋中脚穿黑色中靴，在人妖名鉴中脚穿深棕色短靴，鞋底均有天狗标志性的一齿高木屐。\n在花映塚、风神录、天空璋、人妖名鉴中手持团扇，在其他作品（除天空璋外）中团扇插在腰间。在花映塚、史纪、绯想天、非想天则中手持文花帖，在文花帖DS、人妖名鉴中手持相机，在史纪、绯想天、非想天则、天空璋中手持钢笔。\n在花映塚中右肩站着一只乌鸦，在绯想天、非想天则中身后飞着一只乌鸦。\n文的2P色将红色改为绿色，黑色改为深紫色，白色改为浅紫色，手上的团扇改为蓝色。\n",
    relationships: "文和同为鸦天狗的姬海棠果是同行竞争对手，文会故意歪曲果的报道来抨击果的《花果子念报》[文果真报]。\n但两人关系不错。\n文和同为天狗的犬走椛关系有些僵硬，一见面就很容易争吵[DS]。\n作为鸦天狗，文是饭纲丸龙的下级。\n"
  },
  {
    id: "Kotohime",
    name: "小兔姬",
    alias: [
      "警察"
    ],
    introduction: "\n",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Little Devil / Koakuma",
    name: "小恶魔",
    alias: [],
    introduction: "小恶魔是东方Project系列中的非正式官方角色，首次登场于东方红魔乡，担任红魔乡的四面道中Boss。\nZUN没有给予她任何公式性的设定，只是在回答提问时提及了自己对于这个角色的看法。\n性格任性且喜欢恶作剧，不经过深思熟虑就展开行动[东方书谱]。\n她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "小恶魔平时住在红魔馆中，没有任何使命，可以说是完全自由的角色[东方书谱]。\n",
    abilities: "博丽灵梦认为，小恶魔拥有瞬间找出所需书籍程度的能力。\n",
    appearance: "小恶魔有着一头深红色及腰长发，头上有一对恶魔翅膀。\n在人妖名鉴中她的眼瞳为红色。\n她身穿黑色无袖连衣裙，裙摆有两圈白线，内穿白色长袖衬衣，在红魔乡中裙子及踝；在人妖名鉴中裙子及膝，还打着红色领带。\n她背后长着一对黑色蝙蝠翅膀。\n她脚穿白色短袜，在红魔乡中不穿鞋，在人妖名鉴中穿黑色皮鞋。\n",
    relationships: "暂无相关资料"
  },
  {
    id: "Onozuka Komachi，",
    name: "小野塚小町",
    alias: [],
    introduction: "小野塚小町是东方Project系列中的官方角色，首次登场于东方花映塚。\n她是担任三途河的摆渡人一职的死神。\n她性格阳光，好像江户子般爽朗大方，但也略显轻浮，喜欢与别人聊天打趣，说点笑话[绯想天设定文档]。尽管说话语气中透露着强烈的压迫感[花映塚设定文档]，但和她在一起会很开心[绯想天设定文档]。\n在花映塚之后，小町作为自机还登场于东方绯想天与东方非想天则中，在官方出版物中也时有出场。\n",
    lifestyle: "小町居住在地狱[绯想天设定文档]。\n她担任三途河的摆渡人一职，负责把渡河的方法告诉死者们，这方法便是给她“钱”（即摆渡钱）来请她摆渡[花映塚设定文档]。多数时候她专门负责引渡幻想乡中人类的灵魂，在过程中总是单方面地向幽灵搭话[史纪]。\n她经常在幻想乡中四处偷懒摸鱼，而且看上去也不怎么惭愧[绯想天设定文档]。\n",
    abilities: "小町拥有操纵距离程度的能力。\n此外，在符卡中，小町可以放出与操控怨灵、地缚灵、浮游灵、紧缚灵、恶灵等多种幽灵，不过这些其实是滥用职权[符卡]的技能。\n另外，小町还能召唤出少许三途河的水[符卡]。\n小町还拥有能看见他人寿命的死神之眼。[花映塚]\n",
    appearance: "小町有着一头红色及肩短发，略卷，用有两颗红色珠子的发圈系成双马尾。\n她有着红色的眼瞳。\n她身穿和风的蓝色长裙，裙子右胸处有白色“∴”形图案，腰间系着棕黑色腰带，有棕色荷叶边，腰带中间用系着铜钱的白线绑住。裙子内穿白色短袖，下身裙外穿白色围裙。\n她脚穿有褶子的白色短袜和黑色厚底木屐[史纪]，鞋带为红色。木屐的样式类似于常由舞伎穿的鞋「おこぼ」。\n她右手或双手持一把极其巨大、刀刃弯曲的镰刀。这是死神的普遍特征，目的是为了让死者看到后认为死神存在而为之欣喜[史纪]。\n",
    relationships: "四季映姬·夜摩仙那度是小町的上司，对小町的懒惰很不满，经常说教她。\n尽管不负责茨木华扇，小町常去华扇的家茨华仙邸，把茨华仙邸当成用来休息的秘密基地[茨歌仙46话]。\n"
  },
  {
    id: "Sukuna Shinmyoumaru",
    name: "少名针妙丸",
    alias: [
      "小碗"
    ],
    introduction: "少名针妙丸是东方Project系列中的官方角色，首次登场于东方辉针城，担任辉针城的六面Boss。\n她是小人，是一寸法师的后裔，拥有万宝槌。\n她性格耿直，表里如一，是个纯粹的人。[人妖名鉴]\n在辉针城之后，针妙丸还作为自机登场于东方深秘录和东方凭依华中，作为主要角色登场于宇佐见的魔法书中，在其他官方出版物中也时有出场。\n",
    lifestyle: "针妙丸居住在辉针城中，在万宝槌造成的异变结束后、都市传说异变前的一段时间内被博丽灵梦监管，被关在小笼子里。\n",
    abilities: "针妙丸拥有使用万宝槌程度的能力。\n",
    appearance: "针妙丸在深秘录期间身高略大于一寸[深秘录]，在万宝槌魔力充足时身高会更高一些。\n她有着一头淡紫色齐脖短发。在辉针城中，戴着一个内红外黑的碗，外面有一圈黄色的用藤蔓串起的星、月图案。在深秘录、凭依华、人妖名鉴中，戴着一个内红外黑的碗盖。\n她的眼瞳在辉针城、人妖名鉴中为淡紫色，在深秘录、凭依华中为红色。\n她身穿红色和服，腰带为黑色，缝着一圈八字形黄线。和服上有大量黄、白、粉色的花草图案。在辉针城中，内穿白色裙子，在人妖名鉴中，和服有白色荷叶边。\n裸足。\n在深秘录、凭依华、人妖名鉴中，坐在有黄色的圆形和树叶、树枝图案的碗里。\n在辉针城、深秘录、凭依华中，右手持针，或许为辉针剑[不确定的内容]。在人妖名鉴中，针装在针套里。在辉针城中，右手持黄色的万宝槌，上有绿色、红色、橙色图案。\n",
    relationships: "鬼人正邪为了下克上的野心而盯上针妙丸的万宝槌，于是正邪利用与欺骗了针妙丸。两人共同发誓要复仇并建立弱者的乐园。\n失败后，虽然针妙丸也参与了对正邪的围剿，但是在弹幕大会时，针妙丸还是找正邪商量，并且两人一起改变了弹幕大会的气氛。正邪在大会中觉得之后也得继续跟着针妙丸了[GoU]。\n在完全凭依异变期间她与比那名居天子组队，两人被传为最强的二人[东方凭依华]。\n"
  },
  {
    id: "Nishida Satono",
    name: "尔子田里乃",
    alias: [
      "尬舞姐妹"
    ],
    introduction: "尔子田里乃是东方Project系列中的官方角色，首次登场于东方天空璋，担任天空璋的五面Boss和EX面道中Boss。\n她原先是普通人类的孩子，现已不算是人类。八云紫称她“算是身处介于人类和妖怪的缝隙当中”[GoU]。\n她性格小心谨慎的同时却又自信过剩。[天空璋设定文档]\n她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "里乃几乎丧失了仍是人类时的记忆，现在只会为了摩多罗隐岐奈而行动和狂喜乱舞。[天空璋设定文档]\n",
    abilities: "里乃拥有通过在背后起舞来诱导出精神力程度的能力。\n",
    appearance: "里乃有着一头棕色长发，鬓发及腰，脑后头发则齐肩。头戴帽尖朝左的风折乌帽。\n她有着紫色的眼瞳。\n她身穿洋红色短袖连衣裙，脖子戴着类似围嘴的白色布料，腰带和下身的围裙为白色，围嘴、腰带、围裙有黄色褶子。袖口和领子为黑色，袖口末端为黄色。围嘴、腰带上各有一个红色蝴蝶结，蝴蝶结两边有一圈红色点状图案，腰上前面用红线系着一个蝴蝶结，后面系着黑色大蝴蝶结。\n她穿着黑色及膝袜和洋红色舞鞋。\n她左手拿着茗荷。\n",
    relationships: "里乃与丁礼田舞同为摩多罗隐岐奈的部下，两人是侍奉隐岐奈的二童子[天空璋]，隐岐奈的左右手。她完全为了隐岐奈而起舞，为了隐岐奈而行动，从来不会想到任何忤逆隐岐奈的事情。[天空璋设定文档]\n"
  },
  {
    id: "Chirizuka Ubame",
    name: "尘塚姥芽",
    alias: [],
    introduction: "尘塚姥芽是东方Project系列中的官方角色，首次登场于东方锦上京，担任锦上京的一面Boss。\n她是山姥，作为山姥之王管理和守护着圣域。\n",
    lifestyle: "姥芽一直在圣域内默默守护着山姥族群，管理并守护着圣域，不遗余力地排除被带入圣域的所有会让生活产生变化的事物。\n其他山姥，乃至其他妖怪和动物也都仰慕着姥芽。\n",
    abilities: "姥芽拥有破坏圣域程度的能力。\n",
    appearance: "姥芽有着一头灰蓝色及腰波浪卷发，头顶戴着金色叶状皇冠。\n她有着紫色的眼瞳。\n她上身缠着左白、右橙黄的布，边缘为黑色，布底下有黑色露脐内衣打底，内衣下部被撕成了布条。\n她下身穿着橙黄色及膝裙，裙摆有菱形镂空，上边缘有黑色褶子。裙子上缠着紫色布条，两端延伸到小腿。\n裸足。\n她的大臂上两边各缠着一条黑色布条。\n",
    relationships: "暂无相关资料"
  },
  {
    id: "Yamashiro Takane",
    name: "山城高岭",
    alias: [
      "山童"
    ],
    introduction: "山城高岭是东方Project系列中的官方角色，首次登场于东方虹龙洞，担任虹龙洞的二面Boss。\n她是山童，且是山童中的领袖人物。\n她是头脑派妖怪，说话方式比其他山童更文明一些，且因此成为了山童的领袖。[虹龙洞设定文档]\n在虹龙洞之后，高岭还作为6th Market Boss登场于弹幕狂们的黑市中，在官方出版物中则少有出场。\n",
    lifestyle: "山童们将秘天崖作为大本营。[虹龙洞]\n包括高岭在内的山童们凭借着对经济的研究，构筑了复杂的金钱系统。\n她因为说话方式比其他山童更文明一些而成为山童的领袖人物。[虹龙洞设定文档]\n",
    abilities: "高岭拥有操纵森林的气程度的能力。\n作为山童，她既拥有很高的技术水准，又擅长做生意，对经济有研究。[虹龙洞设定文档]\n",
    appearance: "高岭有着一头绿色及胸卷发，头戴蓝绿色贝雷帽。\n她有着绿色的眼瞳。\n她上身穿着迷彩绿长袖上衣，大臂处各有一个口袋。胸前用黑色绳子交叉系着一把金色钥匙。\n她身后背着一个棕色箱子，箱子的扣为金色。\n她下身穿着迷彩绿及膝裙，有一圈口袋。\n她脚穿黄绿色中筒靴。\n她左手挽起袖子，拿着三张能力卡牌。\n",
    relationships: "山童与河童之间相互看不起，山童称河童为“区区住在河里的两栖类”，被河童称为“区区住在林子里的猴子”。同时，山童的经济与河童的技术又互相依靠。可见，双方既是一对好对手，又相互依存。[虹龙洞设定文档]\n"
  },
  {
    id: "Patchouli Knowledge",
    name: "帕秋莉·诺蕾姬",
    alias: [
      "帕邱莉·诺蕾姬",
      "帕裘莉·诺蕾姬",
      "姆Q",
      "帕琪",
      "图书",
      "香草",
      "广藿香"
    ],
    introduction: "帕秋莉·诺蕾姬是东方Project系列中的官方角色，首次登场于东方红魔乡，担任红魔乡的四面Boss与EX面道中boss。\n她是居住在红魔馆大图书馆中的魔女（魔法使），非常擅长魔法。\n帕秋莉话少、阴沉、对人不友善，但内心并不阴暗[绯想天角色介绍]，性格不很积极，经常自行其道，精明而有求知欲[萃梦想角色设定]，被称为红魔馆的头脑[史纪]。\n在红魔乡之后，她也作为自机登场于东方萃梦想、东方绯想天和东方非想天则中，在官方出版物中也时有出场。\n",
    lifestyle: "帕秋莉居住在红魔馆大图书馆中，基本足不出户[萃梦想角色设定]。\n她的绝大部分时间用于读书[东方求闻史纪]，甚至因为认为在书旁边才是自己，她活的100多岁[史纪]中有一百年没有从书旁离开[红魔乡设定文档]。\n同时，她也会撰写魔导书，用以记录创造的魔法。[史纪]\n帕秋莉拥有丰富的知识，会为红魔馆制造物品（往往是现实中难以直接获得的物品）[三月精S16话]。\n同蕾米莉亚·斯卡蕾特一样，帕秋莉以红茶[萃梦想]作为日常饮品。\n",
    abilities: "帕秋莉拥有使用魔法（主要是属性&精灵魔法）程度的能力，她的魔法主要由火水木金土日月七种属性构成。\n她能撰写魔法书。\n帕秋莉平时都待在书旁边[红魔乡设定文档]，从书中获得了丰富的知识。\n帕秋莉几乎没有体术能力[史纪]，难以应付肉搏战[红魔乡设定文档]。\n作为魔女，她拥有着惊人的魔法力。[红魔乡设定文档]\n",
    appearance: "帕秋莉属于身长较低[ZUN的邮件答复]的角色，外表和人类没有任何差别[史纪]。\n她身体飘飘悠悠，又瘦弱皮肤又白。[东方的黎明]\n她有着一头长发，在绯想天、非想天则、人妖名鉴及腰，在萃梦想中系着两束垂于胸前，在史纪及踝。两鬓刘海系着紫色/红色、青色/蓝色的蝴蝶结。头戴粉紫色荷叶边洋帽，饰有黄色月牙形饰品。她在扎成球形的头发上隔着帽子系着缎带来提高魔法力[史纪]，缎带在红魔乡、萃梦想中为青色和紫色，在绯想天、非想天则中为红色和紫色，在人妖名鉴中为红色和蓝色。\n她身穿睡衣一样[东方的黎明]的长袍，分内外两层，均为粉紫色，内层长袍有淡紫色、深紫色相间的条纹。\n在求闻史纪中，她脚穿玛丽珍鞋。在人妖名鉴中，她脚穿白色短靴，饰有左红右黄的蝴蝶结缎带。\n",
    relationships: "帕秋莉是蕾米莉亚·斯卡蕾特的好友，二人会亲切地互以昵称“蕾米”“帕琪”相称，帕秋莉经常纵容蕾米莉亚的任性要求。\n帕秋莉会帮助蕾米莉亚看管并防止芙兰朵露·斯卡蕾特离开红魔馆[红魔乡]。\n咲夜、红美铃以及馆内的妖精女仆也会听从帕秋莉的命令。\n雾雨魔理沙的符卡恋符「Non-Directional Laser」（非定向激光）抄了红魔乡里帕秋莉的非符攻击。[幻想揭示板]\n魔理沙经常会到帕秋莉的大图书馆里偷书（自称是“借”）。[文花帖（书籍）、绯想天、三月精O]\n虽然小恶魔在原作中没有任何使命，完全自由[东方书谱]，但二次创作常常将小恶魔设定为帕秋莉的使魔、仆人或司书。\n"
  },
  {
    id: "Gengetsu",
    name: "幻月",
    alias: [],
    introduction: "\n",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "YuugenMagan",
    name: "幽幻魔眼",
    alias: [
      "幽玄魔眼"
    ],
    introduction: "暂无相关资料",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Kasodani Kyouko",
    name: "幽谷响子",
    alias: [],
    introduction: "幽谷响子是东方Project系列中的官方角色，首次登场于东方神灵庙，担任神灵庙的二面Boss。\n她是山彦（也称幽谷响），一种嗓门很大、会在山谷中正直地响应声音的妖怪。\n她性格温顺胆小、非常温和，本来开朗快乐，最近开始累积了些压力。\n她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "响子本来居住在妖怪之山中，如果听到从哪里传来欢快的吼声，她也会放声大喊来回应，生活得很快乐。在皈依命莲寺后，一度每天她都在山里诵经。[神灵庙设定文档]\n在皈依命莲寺后，她负责每日在门前打扫以及处理各项杂务。她被要求强制进行无偿劳动，工作内容极苛刻，对工作态度要求很严酷。每个月加班时间多达140小时，一年工作日多达356天，其中349天得连续来上班。[文果真报]\n天天听着寺院传来的诵经声，尽管不了解含义但久而久之几乎她把所有经文都背诵下来了。\n在“鸟兽伎乐”成立后，她会和米斯蒂娅·萝蕾拉一起在深夜定期举办游击演唱会，穿着奇特的服装边甩着头发边唱歌，发出只能让人理解为是噪音的充满杂音的爆音，唱传递性很强的歌词与使用绝大音量的音乐，因此被很多人抗议[口授]。\n",
    abilities: "响子拥有反射声音程度的能力。\n",
    appearance: "响子有着一头绿色齐脖短发，在神灵庙中偏墨绿，在人妖名鉴中偏黄绿。头上长着一对棕色的硕大兽耳。\n她的眼瞳为绿色，在神灵庙、求闻口授中眯着眼睛。\n她身穿浅暗红色的右衽长袖连衣裙，门襟上有上一下三共四对绿色花形盘扣，门襟、领子上都有黑边，袖子也用黑色带子系住，内衬着一件黑边的白色及膝裙子，黑边和带子上面都有绿色折线图案。\n她身后有小尾巴[口授]。\n她脚穿白色三折袜和黑色鞋子。\n她总是手持一把竹扫帚，在神灵庙、求闻口授中用右手，在人妖名鉴中用左手。\n",
    relationships: "响子在不久前因为“所谓山彦（回音）不过是声波的反射现象”流行了起来，而看破红尘，皈依了命莲寺，在圣白莲手下进行十分辛苦的修行，甚至以此为由被要求强制进行无偿劳动。\n她与米斯蒂娅·萝蕾拉组成“鸟兽伎乐”组合，演唱朋克摇滚风格的音乐。[口授]\n"
  },
  {
    id: "Yuka",
    name: "幽香",
    alias: [],
    introduction: "\n\n",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Niwatari Kutaka",
    name: "庭渡久侘歌",
    alias: [
      "鸡妹"
    ],
    introduction: "庭渡久侘歌是东方Project系列中的官方角色，首次登场于东方鬼形兽，担任鬼形兽的三面Boss和EX面道中Boss。\n她是野生鸡的神明——二羽渡神，是一位彬彬有礼、为人公正、优先平等与利他精神的神明。\n她有股认真劲。[黑市]\n在鬼形兽之后，久侘歌还作为敌机登场于东方刚欲异闻中。\n",
    lifestyle: "久侘歌平时居住在妖怪之山，在地狱的口岸（彼岸靠近三途河边的区域）上班。[鬼形兽设定文档]\n她的工作是守卫地狱与异界（如鬼之国）的交界口岸，类似地狱的门卫，并负责区分鬼与人类，将他们分配到属于各自的地方。\n她想为提升沦为人类食材的鸡的地位做点什么。\n",
    abilities: "久侘歌拥有治愈喉疾程度的能力。\n她的记性很差，并且认为这是自己宝贵的能力[鬼形兽]。\n",
    appearance: "久侘歌有着一头淡黄色及肩短发，略卷，前额左侧有红色的鸡冠状头发，可能是接的假发[人妖名鉴]。在鸡冠状头发中有一只黄色的小鸡。\n她上身穿着白色上衣，在鬼形兽和人妖名鉴中为短袖，在刚欲异闻中为长袖。衣服边缘有黄色虚线图案，袖口有羽毛状花边。她披着黄色披肩，边缘有白色虚线图案；系着红色领结，象征公鸡的肉髯。\n背后长着一对鸡翅膀。\n她下身穿着橙色及膝裙，在鬼形兽和人妖名鉴中裙摆有复杂的由白色圆与半圆组成的图案。\n她脚穿棕色中靴。\n她身后长着分成两束的淡黄色鸡尾巴。\n",
    relationships: "久侘歌是阎魔四季映姬·夜摩仙那度的下属。[鬼形兽]\n"
  },
  {
    id: "Ebisu Eika / Ebisu Youka",
    name: "戎璎花",
    alias: [],
    introduction: "戎璎花是东方Project系列中的官方角色，首次登场于东方鬼形兽，担任鬼形兽的一面Boss。\n她是水子之灵，是赛之河原水子们的领袖与偶像，也是一位福神（可能是蛭子神）。\n她长于才智，乐观开朗，能将无意义的单调工作变得欢乐有趣，擅长苦中作乐。\n她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "璎花居住在赛之河原，因为擅长垒石头而成为水子们的领袖，因为接连举办垒石大赛等种种新活动而成为受水子们爱戴的赛之河原的偶像。\n",
    abilities: "璎花拥有擅长垒石头程度的能力。\n而在弹幕狂们的黑市中，通过璎花的能力卡可以召唤一只吞噬敌弹的水母。[弹幕狂们的黑市]\n",
    appearance: "璎花的肤色较深。\n她有着一头奶白色及胸长发，略卷，形似水母。\n她有着粉红色的眼瞳，长着长耳垂。\n她身穿白色短袖连衣裙，上面有淡粉色泡泡状图案，袖口、领口、腰带、裙摆为粉红色绸带，袖口、腰带后面的绸带如水母般垂下。\n裸足。\n在鬼形兽中，坐在垒起的石头上。在人妖名鉴中，周围是被拆得七零八落的石头，身后有一只红水母。\n",
    relationships: "暂无相关资料"
  },
  {
    id: "Matara Okina",
    name: "摩多罗隐岐奈",
    alias: [
      "轮椅战神",
      "秘神",
      "乐子神"
    ],
    introduction: "摩多罗隐岐奈是东方Project中的官方角色，首次登场于东方天空璋，担任天空璋的六、EX面Boss。\n她是究极的秘神，神格极多，包括地母神、能乐之神、星宿之神、养蚕之神、障碍之神、被差别民之神、戏法之神等；同时她也是创立幻想乡的贤者之一，不过一直以来极少出现在世人眼中。\n在天空璋之后，隐岐奈还作为敌机登场于东方刚欲异闻中，在官方出版物中也时有出场。\n",
    lifestyle: "隐岐奈平时生活于后户之国，直到四季异变为止都一直隐介藏形。\n",
    abilities: "隐岐奈拥有在万物背上制作门扉程度的能力，可以在世间万物的背面制造充满魔力的门扉。\n",
    appearance: "隐岐奈有着一头金色及腰卷发。头戴唐式幞巾。\n她有着金色的眼瞳。\n她身穿和式狩衣，衣服上绘有多个星座图案，中间由大熊座（的尾部）贯穿，从上到下依次为：三角座、猎户座、乌鸦座、后发座、天炉座、猎犬座、仙后座、六分仪座（左）、天马座（右）、南三角座。\n她脚穿黑色尖头靴，侧面有红色扣子。\n她左手拿着小鼓。\n在天空璋和人妖名鉴中，她背后有四条火焰状气场，从左到右依次为粉色、绿色、蓝色、橙色。\n在天空璋六面、刚欲异闻、人妖名鉴中，她坐着一把石椅。在天空璋EX面中，她站在背后之门的后面。\n",
    relationships: "丁礼田舞和尔子田里乃同为隐岐奈的部下，两人是侍奉隐岐奈的二童子[天空璋设定文档]，隐岐奈的左右手，完全为了隐岐奈而起舞，为了隐岐奈而行动，从来不会想到任何忤逆隐岐奈的事情[天空璋设定文档]。\n隐岐奈与八云紫同为制造今天的幻想乡的贤者[角色设定]，且和紫熟识[天空璋]。\n茨木华扇很早就认识隐岐奈，并且声称很清楚隐岐奈的性格和思想。[茨歌仙42话]\n高丽野阿吽是隐岐奈创造出的妖怪之一。[茨歌仙]\n"
  },
  {
    id: "Star Sapphire",
    name: "斯塔萨菲雅",
    alias: [
      "斯塔萨菲亚",
      "斯塔萨菲尔",
      "三月精"
    ],
    introduction: "斯塔萨菲雅是东方Project系列中的官方角色，首次登场于东方三月精E，担任三月精系列的主要角色。\n她是星光妖精，从不知道什么时候开始她就居住在了幻想乡当中。与桑尼米尔克、露娜切露德合称为光之三妖精。\n她性格和星星一样难以捉摸，既不会受到任何人的影响，也不会影响到其他人。有时如同恒星一般闪耀，如同流星一般果断，同时又如同星云一般隐藏身形，如同银河一般我行我素，有时也会给别人添麻烦。而如今她的状态就像是运行不稳定的行星。[上海爱丽丝通信]\n除三月精外，斯塔还作为Boss登场于妖精大战争中，在其他官方出版物中也时有出场。\n",
    lifestyle: "光之三妖精一起住在魔法森林之中的“自亘古以来便矗立着的大树”[上海爱丽丝通信]内三妖精的家中，后光之三妖精搬家到位于博丽神社内外分界线[三月精S]的大水楢树[三月精O]中。\n斯塔极少和直接攻击和与人类碰面，一般始终和桑尼米尔克与露娜切露德三只一起活动，主要是帮助她们两个来恶作剧。[史纪]\n",
    abilities: "斯塔拥有感应到活动事物程度的能力，博丽灵梦则称之为感知生物程度的能力。\n",
    appearance: "斯塔身高很低，不到一米[上海爱丽丝通信]。\n她有着一头深棕色及腰长发，头顶系着蓝色大蝴蝶结，在大战争中蝴蝶结边缘有白色褶子。\n她有着棕色的眼瞳。\n她身穿蓝色长袖及踝连衣裙，袖摆宽松，大臂处用蓝绳系紧，裙摆左侧有大小不一的黄色星星图案，裙子边缘有白色荷叶边。她脖子上用蓝线系着蝴蝶结，戴着有荷叶边的白色蝴蝶结。在大战争和人妖名鉴中，上身的裙子向下延伸出花瓣一样的衣摆。\n她背后长着凤蝶般的大翅膀[史纪]。\n在大战争和人妖名鉴中，她腰上有两圈白色丝带交叉缠绕。\n她脚穿棕色中靴。\n",
    relationships: "斯塔与桑尼米尔克、露娜切露德合称为光之三妖精，三个妖精同居在一起，也往往共同行动。\n光之三妖精经常一起在博丽灵梦身上搞恶作剧。\n光之三妖精先后在恶作剧与玩乐中结识了琪露诺、克劳恩皮丝、爱塔妮缇拉尔瓦等妖精，并在结识后会不时叫上她们中的一位或几位一起行动。\n"
  },
  {
    id: "Unnamed Book-Reading Youkai",
    name: "无名的读书妖怪",
    alias: [
      "朱鹭子"
    ],
    introduction: "暂无相关资料",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Nippaku Zanmu",
    name: "日白残无",
    alias: [],
    introduction: "日白残无是东方Project系列中的官方角色，首次登场于东方兽王园。\n她曾经是背离了世间一切道义的破戒僧，因为吸收了妖兽的灵，她失去了人类之身。现在的她是人鬼，是通过吸收灵体从人变成的鬼。\n自战国时代生存至今，她饱尝人世无情，磨砺了坚忍不拔的意志。[兽王园设定文档]\n在兽王园之后，残无在官方作品中少有登场。\n",
    lifestyle: "残无依靠巧舌如簧支配着地狱。她运用出色的协调能力，使如今的地狱成为了奸恶之徒的安全网。[兽王园设定文档]\n她每天搬着坐着的这块石头到处跑。[兽王园]\n",
    abilities: "残无拥有操纵虚无程度的能力。\n",
    appearance: "残无有着一头黑色及膝长发，尾部有自来卷。头顶两侧生有较小的一对黄角，绑着红线。\n她有着红色的眼瞳。\n她上身穿着绿色上衣，在肩部、胸部、小臂处有用红线缝补的痕迹，衣服腰部位置的破损未缝补，边缘为黄色。\n她下身穿着蓝色高腰五分裤，侧面开衩并用红线缝上，裤腿边缘为黄色，里面穿着白色打底裤。\n她脚穿红棕色木质人字拖。\n她坐在一块石头上，上面有一棵迎客松和一些红色的骸骨。\n",
    relationships: "由于残无提议把旧地狱分离出去，建设全新的地狱，整个旧地狱至今都对残无怀恨在心[兽王园]。\n豫母都日狭美单方面景仰着她。\n三头慧之子曾撕咬她的躯体、吞吃她的血肉，并因此背负上永恒的诅咒，拥有了近乎永恒的寿命和不死之身。之后有一天慧之子心里听到她的呼唤而苏醒，按她所说吞下宝珠，被宝珠清除污秽成为货真价实的不死之身，又被她下令吞噬地上的动物灵。之后，她还向骊驹早鬼介绍了慧之子。\n她与天火人血枪是老相识。她告诉了血枪饕餮尤魔也在旧血池地狱，促使血枪加入了刚欲同盟。\n她曾教唆孙美天吞噬圣域的幽灵成为猿神。她还将美天引荐给吉吊八千慧。之后，美天接受她的命令而成为八千慧的部下，并继续听命于她。\n"
  },
  {
    id: "Meira",
    name: "明罗",
    alias: [],
    introduction: "\n",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Hoshiguma Yugi",
    name: "星熊勇仪",
    alias: [
      "红有三"
    ],
    introduction: "星熊勇仪是东方Project系列中的官方角色，首次登场于东方地灵殿，担任地灵殿的三面Boss。\n她是典型的鬼，有着刚毅且干脆利落的性格。\n在地灵殿之后，勇仪又在东方刚欲异闻中作为敌机出场，但在官方出版物中少有出场。\n",
    lifestyle: "勇仪生活在旧地狱的旧都中，是旧地狱鬼们的大姐头，很喜欢以实力说话的旧地狱[口授]。\n她每天都一边嬉闹一边喝酒，快乐地享受着生活[地灵殿设定文档]。\n她是旧地狱温泉街的总管。[刚欲异闻]\n她喜欢力气大、有勇气以及正直的人们，相反饶不过那些懦弱的、胆小的、狡猾的人们。她会找喜欢的人去喝酒、比腕力。[口授]\n",
    abilities: "勇仪有着拥有怪力乱神程度的能力，力大无穷，甚至难以以常理理解她的力量之大。\n她的酒杯“星熊杯”能让注入里头的酒瞬间变成纯米大吟酿从而大幅提升品级，但这样的酒会随时间流逝而劣化[口授]。\n",
    appearance: "勇仪有着一头黄色及腰长发。额头上长着一只巨大的红角，上有一个黄色五角星图案。\n她有着红色的眼瞳。\n她上身穿着类似体操服的白色短袖，领口、袖口和身体两侧都有红色线条。\n在除刚欲异闻外的其他作品中，她下身穿着蓝色长裙，有着红色辐状线条，裙摆为一圈红色空心三角形。在地灵殿和求闻口授中裙子是半透明的，在人妖名鉴中裙子不透明。除求闻口授外，裙子上面都有白色线条和白色枫叶状图案。\n她赤脚踏一双木屐，鞋带为红色。手腕和脚腕上都有鬼标志性的锁链，但是在刚欲异闻中被衣服隐藏了起来。\n她总是一手端着红色、内有两颗黄色五角星图案的星熊杯，除人妖名鉴中用左手外都是用右手。在刚欲异闻中，她左手提着一个用绿色绳子栓着的酒壶。\n",
    relationships: "她和伊吹萃香、茨木华扇同为山之四天王，被称为力之勇仪。\n"
  },
  {
    id: "Rikako Asakura",
    name: "朝仓理香子",
    alias: [],
    introduction: "\n",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Motoori Kosuzu",
    name: "本居小铃",
    alias: [
      "防撞桶",
      "作死铃"
    ],
    introduction: "本居小铃是东方Project系列中的官方角色，首次登场于东方铃奈庵，担任铃奈庵的主要角色。\n她是人类村落中的借书屋铃奈庵的店主女儿兼店员，主要负责书籍的出租和贩售工作[铃奈庵1话]。\n她有些胆小，但好奇心旺盛，喜爱收集妖魔书，更拥有着“可以读懂、理解任何文字的能力”。\n而在漫画的结尾，在八云紫的操作下，小铃最终脱离了普通人类的身份，成为了被博丽灵梦和雾雨魔理沙等人接纳为“伙伴”的，“从属于妖怪的人类”[铃奈庵53话]。\n在铃奈庵之外，小铃在其他官方作品中少有出场。\n",
    lifestyle: "作为借书屋店主的女儿，小铃平时生活在铃奈庵里，且主要在人类村落内部活动。\n博丽神社和稗田邸也是小铃有时会拜访的场所。\n她是妖魔书的狂热收集者[铃奈庵1话]。在完成书屋的本职的工作之余，她会挪用店里的盈利[铃奈庵1话]收集妖魔书。\n铃奈庵向外提供的服务，除了书籍出租与贩售，还有小规模的印刷与装订服务[铃奈庵1话]。\n小铃会定期为村落中孩子们讲解（具有幻想乡特色的）和妖怪有关的童话故事[铃奈庵短篇1、铃奈庵30话]，来帮助他们学会一些防范妖怪的手段。\n",
    abilities: "小铃拥有可以读懂任何文字程度的能力，博丽灵梦则将其表述为能够理解任何文字程度的能力。\n",
    appearance: "小铃有着一头深橘色及肩短发，用两对摇铃发饰系成双马尾。\n她有着红色的眼瞳。\n她上身穿着红白格子样式和服，外面披着写上端写着“KOSUZU”、右下裙摆写着“鈴奈庵”的黄色围裙。\n她下身穿着绿色过膝百褶裙，裙摆为白色锯齿状图案。\n她脚穿黑色中筒靴。\n在人妖名鉴中，她手捧着一本绿色封皮的书看。\n",
    relationships: "小铃有家人，但他们很少出场。\n小铃与稗田阿求还是亲密好友，阿求也是最早知道店里有妖魔书的客人之一[铃奈庵1话]。\n博丽灵梦与雾雨魔理沙经常就妖魔书所引发的事件展开调查，因此小铃与她们相互间十分熟悉。\n小铃还结识了一位在寺子屋学习的年幼的妖狐。她用新的笔记本交换这只妖狐的旧笔记本，并由此收获了一本又一本由狐狸语言撰写的妖魔书。[铃奈庵19话]\n二岩猯藏与小铃的接触最为频繁。她长期通过变化成人类的样子接近小铃[铃奈庵4话]，成为了铃奈庵的常客。\n在八云紫的操作下，小铃最终脱离了普通人类的身份，成为了“从属于妖怪的人类”[铃奈庵53话]中的一员。\n"
  },
  {
    id: "Murasa Minamitu，",
    name: "村纱水蜜",
    alias: [],
    introduction: "村纱水蜜是东方Project系列中的官方角色，首次登场于东方星莲船，担任星莲船的四面Boss。\n她是船幽灵，担任圣辇船的船长。\n她性格开朗，非常健谈，在船幽灵之中算得上是理解人类的。[口授]\n在星莲船之后，村纱还作为自机&敌机登场于东方刚欲异闻中，在官方出版物中也时有出场。\n",
    lifestyle: "村纱是圣辇船的船长。\n她平时居住在命莲寺中，有时会负责寺内洗涤的工作[醉蝶华17话]。\n她因为忘不了旧血池地狱的滋味，时不时会回到旧血池地狱。[深秘录]\n",
    abilities: "村纱水蜜拥有引发水难事故程度的能力。\n因为圣白莲的法力，只有村纱能操纵圣辇船。\n",
    appearance: "村纱有着一头黑色及肩短发，略卷，在人妖名鉴中头发偏绿。头戴白色无帽墙的海军军官大檐帽1，上面有船锚图案，在刚欲异闻中有帽墙，帽檐为带金边的深蓝色，船锚图案为金色。\n她有着湖绿色的眼瞳。\n她上身穿着传统型水手服，衣领款式为关东襟，袖口和领口的颜色为深青色，在刚欲异闻中打着红色领带，上有白色船锚图案，在其他作品中系着红色三角领巾。在刚欲异闻中，她还身披一件深蓝色的金边大衣。\n在刚欲异闻中，她腰间系有一条挂有木舀子的腰带。\n她下身穿着及膝裙裤，裤脚颜色也是深青色，在刚欲异闻中身侧裤脚有白色船锚图案。\n她脚穿白色及膝袜和棕色短靴，靴子在人妖名鉴中为中靴。\n在刚欲异闻中，她双手戴着白色手套，左手托着现实样式的船锚。在其他作品中，她左手托着一枚巨大的、外观为船锚标志的船锚，右手持一支木舀子。\n",
    relationships: "圣白莲是村纱的救助者与村纱所追随的人，曾经用法力造出一艘船，帮助村纱脱离了束缚她的大海。\n村纱与云居一轮、云山、寅丸星、娜兹玲是朋友，都十分景仰白莲。\n"
  },
  {
    id: "Joutougu Mayumi",
    name: "杖刀偶磨弓",
    alias: [
      "埴轮"
    ],
    introduction: "杖刀偶磨弓是东方Project系列中的官方角色，首次登场于东方鬼形兽，担任鬼形兽的五面Boss。\n她的原型是日本国宝“挂甲武人埴轮”。\n她是埴安神袿姬制造的埴轮之一，是袿姬制作的埴轮兵团的首长。\n作为埴安神袿姬制造的偶像，埴轮不具备肉体、灵体、欲望[鬼形兽]，身躯内空空如也，但是其上寄宿着魂魄和强大的魔力，因此能作为御神体聚集信仰[鬼形兽]。\n在鬼形兽之后，磨弓尚未在官方游戏中再次登场过，在官方出版物中则偶有出场。\n",
    lifestyle: "她平时居住在畜生界，守卫着灵长园外围。[鬼形兽设定文档]\n埴轮最初被用于帮助人类灵对抗动物灵，以强大的战斗能力和埴轮免疫灵体攻击的特殊性质击败动物灵，支配畜生界；在获得人类灵的信仰后，他们又反过来将人类灵也置于支配之下。\n作为埴轮兵团的首长，她平时负责统领埴轮兵团，守卫灵长园。\n",
    abilities: "磨弓拥有让忠心直接化为实力程度的能力。\n杖刀偶磨弓是埴轮兵团的首长，纯粹的战斗能力非常高，精通剑术、弓术、骑术[鬼形兽设定文档]。\n作为埴轮，被毁坏之后也能立刻修复，不会生病，也无需休息。另外埴轮拥有实体但不具备灵体，故几乎完全免疫动物灵的攻击。[鬼形兽设定文档]\n在战斗中磨弓还会指挥其他埴轮进行协同作战，包括埴轮剑士、埴轮弓手、埴轮骑兵。\n",
    appearance: "磨弓有着一头金色及肩短发，头上用两条竖起来的丝巾扎起两个圆发髻。\n她有着金色的眼瞳。\n她上身穿着白色短袖，袖口系紧，外面披着金色盔甲，盔甲前襟为红色蝴蝶结状盘扣，领口佩戴着“舞蹈的埴轮”形状的装饰物。\n她腰上用一根蓝绳系着护裙“草折”，在人妖名鉴中挂着“舞蹈的埴轮”。\n她下身穿着裤状的及膝护腿，裤口系紧。\n她脚穿深蓝色短靴。\n她小臂上用红绳系着紫色护臂，在鬼形兽中右手握着“舞蹈的埴轮”。\n",
    relationships: "磨弓是埴安神袿姬所创造的埴轮，被袿姬任命为埴轮兵团的首长。\n她与畜生界以吉吊八千慧、骊驹早鬼、饕餮尤魔为首的动物灵敌对。[鬼形兽设定文档]\n"
  },
  {
    id: "Sunny Milk",
    name: "桑尼米尔克",
    alias: [
      "桑妮米尔克",
      "光明牛奶",
      "三月精"
    ],
    introduction: "桑尼米尔克是东方Project系列中的官方角色，首次登场于东方三月精E，担任三月精系列的主要角色。\n她是日光妖精，从不知道什么时候开始她就居住在了幻想乡当中。与露娜切露德、斯塔萨菲雅合称为光之三妖精。\n她是光之三妖精的头脑[三月精S6话]，是三人之中头脑最机灵的，表情丰富又开朗，精神十足。不过她其实也是失败次数最多的那个。[上海爱丽丝通信]。\n除三月精外，桑尼还作为Boss登场于妖精大战争中，在其他官方出版物中也时有出场。\n",
    lifestyle: "光之三妖精一起住在魔法森林之中的“自亘古以来便矗立着的大树”[上海爱丽丝通信]内三妖精的家中，后光之三妖精搬家到位于博丽神社内外分界线[三月精S]的大水楢树[三月精O]中。\n桑尼貌似领导着光之三妖精进行恶作剧，但三人没什么配合。[上海爱丽丝通信]\n她十分喜爱美味的食物，乃至于常常不想太多而潜入宴会中。[史纪]\n她平时吵吵嚷嚷，但是早上却爱赖床。[三月精O]\n",
    abilities: "桑尼拥有折射光线程度的能力。\n她能够通过沐浴日光来治愈伤势，相比之下则比较怕雨。[上海爱丽丝通信]\n",
    appearance: "桑尼身高很低，不到一米[上海爱丽丝通信]。\n她有着一头橙色及肩短发，用红色蝴蝶结系成短双马尾，头顶戴着白色蕾丝状发箍。\n她有着蓝色的眼瞳，左边长有一颗虎牙。\n她上身穿着白色长袖，衣摆一直垂到下身并有花边，袖摆宽松并有一圈红色细线，在大战争和人妖名鉴中左袖摆有红色太阳图案，在史纪中大臂处各系着一个红色蝴蝶结。脖子上戴着黄色领巾和红色大蝴蝶结，蝴蝶结两边上各有一条白线和白色花边。\n她身后长着两对昆虫般的薄翼[史纪]。\n她用前小后大各一个白色蝴蝶结系着红色腰带，在人妖名鉴中腰带上有白色太阳图案，在史纪中腰带和蝴蝶结颜色相反，后面也没有系大蝴蝶结。\n她下身穿着红裙，边缘有白色花边，在史纪和大战争中及踝，在人妖名鉴中及膝，裙摆在大战争和人妖名鉴中有一圈白线。\n她脚穿白色短袜和黑色玛丽珍鞋。\n",
    relationships: "桑尼与露娜切露德、斯塔萨菲雅合称为光之三妖精，三个妖精同居在一起，也往往共同行动。\n光之三妖精经常一起在博丽灵梦身上搞恶作剧。\n光之三妖精先后在恶作剧与玩乐中结识了琪露诺、克劳恩皮丝、爱塔妮缇拉尔瓦等妖精，并在结识后会不时叫上她们中的一位或几位一起行动。\n"
  },
  {
    id: "Medicine Melancholy",
    name: "梅蒂欣·梅兰可莉",
    alias: [
      "梅蒂馨·梅兰可莉",
      "毒人偶"
    ],
    introduction: "梅蒂欣·梅兰可莉是东方Project系列中的官方角色，首次登场于东方花映塚。\n她本是被扔到铃兰田的人偶，天长日久而在几年前妖怪化，因为年轻而经验和知识严重不足。\n她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "梅蒂欣生活在无名之丘的铃兰田中，在花之异变时第一次离开铃兰田[花映塚]。\n八意永琳认为，梅蒂欣用铃兰的毒素为自己创造了躯体而变成了妖怪[花映塚]。因此，她可以自由自在地行动和思考全是靠铃兰的毒[花映塚]。\n她很希望去解放人偶，但几乎没有人偶支持她。[花映塚设定文档]\n",
    abilities: "梅蒂欣拥有操纵毒素程度的能力和使用毒素程度的能力。\n",
    appearance: "梅蒂欣的外表是用作表演腹语术的大型人偶的样子。原本的人偶也被认为是这般大小。[史纪]\n她有着一头黄色齐肩短发，头上带着红色缎带，扎成蝴蝶结。\n她有着蓝色的眼瞳。 \n她上身穿着黑色短袖，领子为白色。在花映塚和人妖名鉴中身前和袖子上有类似缝线的红色花纹，在求闻史纪中则是类似于标签的扣子。戴着红色领结。在求闻史纪中右手腕上戴着一个有两个类似标签的装饰的手环。\n她下身穿着红色长裙，中间有类似缝线的黑色花纹，裙摆打着褶子。背后系着白色大蝴蝶结。\n她在求闻史纪中穿黑色鞋子，腿上和鞋上缠着缎带；在人妖名鉴中穿着白色短袜和红色圆头鞋。\n她身旁常有一个小人偶，外表和梅蒂欣相似，但是头上的缎带改为蝴蝶结头饰，衣服的黑与红与梅蒂欣相反，背后多出两对类似于花映塚道中妖精的翅膀。在人妖名鉴中穿白色短袜，不穿鞋；在求闻史纪中还有单马尾；在人妖名鉴中穿黑色鞋子。\n梅蒂欣的2P色将红色改为紫色，将较浅的黑色改为深蓝色。\n",
    relationships: "暂无相关资料"
  },
  {
    id: "Merlin Prismriver",
    name: "梅露兰·普莉兹姆利巴",
    alias: [
      "骚灵二姐",
      "小号手",
      "骚灵三姐妹"
    ],
    introduction: "梅露兰·普莉兹姆利巴是东方Project系列中的官方角色，首次登场于东方妖妖梦，担任妖妖梦的四面Boss。\n她是蕾拉·普莉兹姆利巴创造的骚灵，是吵闹、喜欢举办音乐会的灵体。\n她从容开朗，不知道什么叫低落，甚至有点狂躁病的苗头。她偶尔也会说些令人无法理解的话[妖妖梦角色设定]。\n在妖妖梦之后，梅露兰还作为自机登场于东方花映塚中，在官方出版物中则登场次数不多。\n",
    lifestyle: "梅露兰生活在雾之湖附近的废弃洋馆中。\n她在普莉兹姆利巴乐团解散前是普莉兹姆利巴乐团的一员，在乐团中负责演奏小号，常被邀请去妖怪们的聚会进行演出[史纪]。\n普莉兹姆利巴乐团解散后三姐妹均加入堀莉兹姆利巴乐团，梅露兰仍负责小号。\n",
    abilities: "梅露兰拥有不用双手操控就能演奏乐器程度的能力和演奏狂躁之音程度的能力，演奏的音乐会让人激昂，甚至让人会突然开始手舞足蹈或者没法进行连贯的对话[史纪]。\n她拥有三姐妹中最强的魔法力量，但使用不当。[妖妖梦角色设定]\n",
    appearance: "梅露兰属于身高较低[ZUN的邮件答复]的角色，身高在三姐妹中最高，外表和人类没有区别[史纪]。\n她有着一头明亮[史纪]的蓝色齐肩卷发，刘海呈M字，同样是卷发，右半边垂到肩，左半边向上收束到头的左后方。头戴浅粉色圆锥形帽子，边缘折回且打着褶子，还有一条黑色条纹。帽子前端有一条裂口，顶端有蓝色太阳形装饰。\n她有着蓝色的眼瞳。\n她上身穿着浅粉色的衬衫和同样为浅粉色的马甲。马甲上扣着蓝色扣子，领子边缘打着褶子。\n她下身穿着同样是浅粉色的荷叶裙。马甲的下摆、裙子的末端、领子边缘的褶皱上同样各有一条黑色条纹。马甲和裙子的黑色条纹上方各有一圈蓝色“U-U”形图案。\n她脚穿白色短堆堆袜，在妖妖梦立绘中只穿堆堆袜，妖妖梦小人图和花映塚中则穿缀有蓝色圆珠的白色皮鞋，在凭依华和人妖名鉴中穿蓝色鞋子。\n她身旁经常悬浮着一把金黄色小号，传说是吸了很多爵士小号手的血、可怕的小号幽灵[史纪]，但不知真假。\n梅露兰的2P色将浅粉色改为浅绿色，黑色改为紫色，小号为银色。\n",
    relationships: "梅露兰是骚灵三姐妹中的次女，露娜萨·普莉兹姆利巴的妹妹，莉莉卡·普莉兹姆利巴的姐姐。也是三人组成的普莉兹姆利巴乐团的一员。\n在普莉兹姆利巴乐团解散后三姐妹均加入堀莉兹姆利巴乐团，以堀川雷鼓为队长。[文果真报]\n"
  },
  {
    id: "Yumeko",
    name: "梦子",
    alias: [
      "魔界女仆"
    ],
    introduction: "\n",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Mugetsu",
    name: "梦月",
    alias: [],
    introduction: "\n",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Morichika Rinnosuke",
    name: "森近霖之助",
    alias: [
      "乡长",
      "香霖"
    ],
    introduction: "森近霖之助是东方Project系列中的官方角色，首次登场于东方香霖堂，担任香霖堂的主要角色。\n他是人类与妖怪的混血，旧货店香霖堂的店主，是东方角色中少有的有姓名设定的男性之一。\n他博识而爱独自沉思，很少出店，对客人也很冷淡，所以他尽管开着商店却不是做生意的性格。[史纪]\n在香霖堂初登场之后，霖之助在其他官方出版物中也时有出场。\n",
    lifestyle: "霖之助曾经是雾雨家最得力的员工，后来独立出来开店。\n他现在经营着香霖堂，是香霖堂的店主，直到宇佐见堇子开始在香霖堂打工前香霖堂都没有其他店员[史纪]。\n他会以祭拜无缘塚的死者为借口，到无缘塚捡拾从外面世界流入的道具。[香霖堂]\n",
    abilities: "霖之助拥有判别物品名字和用途程度的能力。\n作为人类与妖怪的混血，他比人类长寿，但因为很少锻炼，身体并不强壮。[史纪]\n",
    appearance: "霖之助有着一头灰白齐脖短发，头顶有根特别显眼的呆毛。\n他有着金色的眼瞳，戴着半框眼镜，颈部系有Choker1。\n他身穿一件主体为蓝色的和服，里面有一副黑色袖套，大臂上系着浅蓝色皮带。\n他腰带上系有一个棕色方形腰包，在人妖名鉴中还系着深蓝色蔽膝。\n他下身还穿着一条蓝色烟管裤，裤脚为深蓝色，且被撸了起来。\n他脚穿浅紫色切尔西靴。\n在人妖名鉴中，他左手拿着一个迷你八卦炉。\n",
    relationships: "博丽灵梦作为巫女工作所使用的器具和服装均由霖之助提供[香霖堂2话]。\n霖之助曾在雾雨家修行，后离开独自开店。在雾雨家的独女雾雨魔理沙离家出走到魔法森林后，霖之助为魔理沙制作了魔法器具迷你八卦炉。[香霖堂6话]\n魔理沙管霖之助叫“香霖”。[香霖堂]\n魔理沙也常会拜访香霖堂，就连霖之助也不知道她是有事还是没事[香霖堂1话]。\n霖之助偶尔也会提及关于她父亲的事情，但魔理沙会刻意回避。\n霖之助对宇佐见堇子带来的小玩意儿评价很高[文果真报]。\n霖之助最近似乎一旦有不知该怎么用的器具，就会去找堇子。[新香霖堂8话]\n后来，堇子开始在香霖堂给霖之助打工，帮助霖之助鉴定外面世界的物品之类的。[新香霖堂9话]\n"
  },
  {
    id: "Chen",
    name: "橙",
    alias: [
      "黑猫",
      "橙喵"
    ],
    introduction: "橙是东方Project系列中的官方角色，首次登场于东方妖妖梦，担任妖妖梦的二面Boss和EX面道中Boss。\n她是凭依在栖息于山中的猫妖的式神1，是八云蓝的式神，八云紫式神的式神，但并没有被冠以八云姓，也不和蓝及紫住在一起。\n无论在式神状态还是猫妖状态她的性格都不变，都怕水，且对木天蓼无抵抗力[求闻史纪]。\n她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "橙在妖怪之山深处的迷途之家生活，管理着占领了此处的野猫种群。\n她有事就会来人类村落袭击人类，也会在妖怪兽道活动。[史纪]\n没有被式神附身的平时，她有着和猫类似的习性，会和来人恶作剧，冬天会在被炉里蜷成球状[妖妖梦设定文档]。\n",
    abilities: "橙作为式神时会拥有使用妖术程度的能力，\n橙在式神状态之外只有吓唬人类程度的能力。\n她会说人话，看上去很聪明，但是事实上只有附近人类的小孩程度的智慧。[求闻史纪]\n她作为猫妖，非常敏捷、力量也强。\n",
    appearance: "橙属于身长低[ZUN的邮件答复]的角色。她在式神状态和猫妖状态外貌没有区别。\n她有着一头棕色及肩短发，长着棕黑色猫耳，左耳戴着金色耳环（在求闻史纪中双耳均有耳环），戴着有荷叶边的绿色帽子。\n她有着深棕色的眼瞳，长着尖锐的牙[求闻史纪]（但是立绘没有表现）。\n在妖妖梦和人妖名鉴中，她身穿红色无袖及膝连衣裙，内穿白色长袖，裙子领子有金边，裙摆为白色，在妖妖梦中裙摆红色部分有一圈白色条纹。在妖妖梦和人妖名鉴中，系着白色领结，在求闻史纪中，她上身穿着马褂，下身穿着及膝裙。\n在妖妖梦中，她脚穿白色短袜。在求闻史纪中，她脚穿皮鞋。\n她长着两条棕黑色尾巴，尖端为白色。\n她有着尖锐的爪子，表现为长着红色长指甲。\n",
    relationships: "橙是八云蓝的式神及八云紫式神的式神，对主人蓝很亲昵，而对紫则非常尊重。\n她经常和火焰猫燐一起玩，在阿燐的影响下变得看见尸体就会兴高采烈[兽王园]，现在已经能把尸体玩出花来[兽王园]。\n"
  },
  {
    id: "Hinanawi Tenshi",
    name: "比那名居天子",
    alias: [
      "统领娘",
      "M子",
      "天女"
    ],
    introduction: "比那名居天子是东方Project系列中的官方角色，首次登场于东方绯想天。\n她本是比那名居家的大小姐，随家族成为天人，因为不具备天人应有的品行，性格也与其他天人不同，所以被称为“不良天人”。\nZUN认为天子在形象上与《西游记》里的孙悟空比较接近。[人妖名鉴]\n她有着温室娇女般的性格，任意妄为、自鸣得意[绯想天设定文档]。因此，只有捧着顺其心意才能让她好好听话[茨歌仙45话]。\n同时，她天性贪玩[绯想天设定文档]、害怕寂寞[交叉评论]，因而羡慕幻想乡里人类与妖怪的生活。\n在绯想天之后，她还作为自机登场于东方凭依华中，并在官方出版物中时有出场。\n",
    lifestyle: "在完全凭依异变前不久，天子因为偷吃天界宴会上的丹药被放逐到地面上。[东方凭依华、茨歌仙46话]\n",
    abilities: "天子拥有操纵大地程度的能力。\n绯想之剑是天界的道具，只有天人能操纵，被天子带走作为自己的武器。\n此外，天子虽不具备天人应有的品行，但具备天人的许多特质。\n",
    appearance: "天子有着一头蓝色及腰长发，末端稍卷。头戴一顶黑色礼帽，帽子上装饰有可以吃的桃子[东方凭依华]和桃树叶。\n她有着红色的眼瞳。\n她身穿白色短袖连衣裙，袖口有着金箍花纹，门襟为黑色，两侧有白色褶边。裙摆分为两层，上层为白色围裙，有黑色藤蔓状花纹，边缘缀着彩虹色带子。下层为蓝色，有着天空的图案，边缘为白色荷叶边。领子上戴着红色蝴蝶结。\n她腰后系着浅蓝色大蝴蝶结。\n她脚穿深棕色长筒靴。\n在凭依华和人妖名鉴中，她手持绯想之剑。\n",
    relationships: "天子在天气异变之前便与永江衣玖有来往，衣玖称她为“长女大人”（私下也叫过她“天子大人”），二人存在着更多是间接意味上的上下级关系。[绯想天]\n在完全凭依异变期间天子与少名针妙丸组队，两人被传为最强的二人[凭依华]。\n在被天界放逐后的一段时间内她曾与依神紫苑结伴。\n"
  },
  {
    id: "Mizuhashi Parsee",
    name: "水桥帕露西",
    alias: [
      "水桥帕露希",
      "水桥帕露茜",
      "桥姬"
    ],
    introduction: "水桥帕露西是东方Project系列中的官方角色，首次登场于东方地灵殿，担任地灵殿的二面Boss。\n她是看守着连结地上与地下的纵坑的桥姬，被嫉妒心驱使着行动，并以人们的嫉妒为食，因此可以说她身为妖怪的本体就是嫉妒心本身。\n在地灵殿之后，她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "帕露西居住在地底，守护着连接幻想风穴和旧都的桥，负责守望着他人能够平安从地上世界到达地下世界，以及从地下世界来到地上世界[地灵殿设定文档]。\n她嫉妒心很强，没有情理可言，只要一觉得别人过得比自己幸福[口授]或看到有似乎很欢乐的家伙[地灵殿设定文档]就会开始嫉妒，并会去捣乱。\n她自认为职业是心理咨询师，并已经掌握了绝大多数的旧地狱怨灵心怀的怨念。[智灵奇传]\n",
    abilities: "帕露西拥有操纵嫉妒心程度的能力，有着促进嫉妒心膨胀的强大力量。\n",
    appearance: "ZUN在设计帕露西时有意体现出波斯风味，突出中亚还是西亚的那种风格[地灵殿采访]。\n她有着一头金色及肩短发，在人妖名鉴中脑后有一条小辫子。长着尖耳。\n作为嫉妒的妖怪，她有着绿色的眼瞳。\n她上身穿着棕色长衣，长衣有紫色滚边，滚边上有白色菱形条纹。长衣里面穿着黑色无袖内衣。脖子上戴着一条白色围巾。小臂戴着白色袖套。\n她下身穿着黑色裙子，裙摆挂着象征着桥的红色桁架图案。腰间和裙子上缠着白色丝带，挂着蓝色布料。\n她在地灵殿和求闻口授中穿着白色泡泡袜，在人妖名鉴中穿着白色小腿袜。脚穿黑色玛丽珍鞋。\n",
    relationships: "暂无相关资料"
  },
  {
    id: "Nagae Iku",
    name: "永江衣玖",
    alias: [
      "19",
      "皇带鱼",
      "龙宫使者"
    ],
    introduction: "永江衣玖是东方Project系列中的官方角色，首次登场于东方绯想天。\n她是被称作龙之代言人的龙宫使者，负责将龙神说出的重要的信息和地震的预兆透露给人类和妖怪。\n她性格悠然自得，是个飘然的角色，有着游于空中的感觉[ZUN访谈]，对他人行动毫无兴趣。她因为怕麻烦而不会做主角，更多地观察他人的行动。\n在绯想天之后，衣玖还作为自机登场于东方非想天则中。\n",
    lifestyle: "衣玖生活在龙的世界与人类的世界之间，居住在雷云[符卡、DS]之中。\n她大部分时间都在云中悠游度日，并关注着龙神的一举一动，只有当听到龙神说到重要的内容时，她才会动身将其透露给人类和妖怪。\n此外，她也负责预报地震[绯想天]和天气[DS]。\n",
    abilities: "衣玖拥有解读空气程度的能力，能够立即掌握和适应身处的环境。\n此外，她也能够听懂龙的语言。\n衣玖还能稍微借用一下龙神的力量[DS]。\n",
    appearance: "衣玖有一头蓝紫色及肩短发，头上戴着一顶黑色帽子，延伸出两根红带。\n她的眼瞳在绯想天和非想天则中为红色，在人妖名鉴中为棕色。\n她上身穿着白色长袖衬衫，胸前系红色丝带。\n她周围复杂地缠绕着长长的白色羽衣，打着红色的褶边。羽衣边缘会自己散发绯色的光泽，有着难以言喻的美丽[绯想天设定文档]。\n她下身穿着黑色长裙，褶边为白色。\n她脚穿白色袜子和棕黑色皮鞋。\n",
    relationships: "她是龙的代言人，能听懂龙的语言，负责将龙神说出的重要的信息透露给人类和妖怪，还能稍微借用一下龙神的力量。\n衣玖过去便与比那名居天子有来往。衣玖称天子为“长女大人”（私下也叫过“天子大人”），二人存在着更多是间接意味上的上下级关系。[东方绯想天]\n心绮楼“云上的宝船”场景以及同时期的官方漫画里，两人作为背景角色结伴参与幻想乡内的盛事。[东方心绮楼、东方铃奈庵]\n弹幕烟火大会的评委们将衣玖和天子关联在一起，依据没有明文解释。[GoU]\n"
  },
  {
    id: "Kawasiro Nitori",
    name: "河城荷取",
    alias: [
      "河城似鸟",
      "河童"
    ],
    introduction: "河城荷取是东方Project系列中的官方角色，首次登场于东方风神录，担任风神录的三面Boss。\n她是河童，通称“溪谷河童”[风神录]，手艺精巧，擅长制作道具，是个刻板印象里的工程师[风神录设定文档]。\n她会突然改变态度和语气，有着奇怪的性格[风神录设定文档]。\n她很怕生[风神录设定文档]，有着胆小的一面[口授]，独处时如果有人类或者其他妖怪靠近就会立即逃跑。只有在同伴圈里，她才表现出开朗活泼[口授]的另一面。\n然而，她又热衷于赚钱，守财如命。\n在风神录之后，荷取还作为自机登场于东方心绮楼、东方深秘录和东方凭依华中，在官方出版物中也时有出场。\n",
    lifestyle: "荷取和整个河童群体一起居住于妖怪之山山麓的玄武涧中，是河童中的领导级成员之一[智灵奇传]。\n她热爱研究机械，无论是睡着还是醒着都在摆弄机械[凭依华]。\n她对商机很敏感，每当幻想乡内举办稍具规模的节庆活动或是集会，她总会带领众河童出摊叫卖。\n",
    abilities: "荷取拥有操纵水程度的能力。\n作为河童，荷取手艺非常精巧，擅长制作道具，但不太擅长做魔法道具或咒术的道具[口授]。\n此外，荷取与其他河童一样拥有通背的特征，能用道具使两只手连在一起，伸缩自如[口授]。\n",
    appearance: "荷取有着一头水蓝色的头发，略卷并有些反翘，各用两圈串两个红珠子的发绳扎成双马尾。在深秘录和凭依华中鬓发及胸，在其他作品中头发及肩。头戴绿色太阳帽，除了黑市外上面有白色蛇形图案。\n她有着水蓝色的眼瞳。\n她上身穿着蓝色长袖上衣，两肩各有一个口袋。胸口有一把用黑色绳子交叉固定的金色钥匙。\n她背着一个帆布背包[口授]，背包在风神录、黑市、人妖名鉴为深绿色，在心绮楼、深秘录、凭依华、求闻口授为深蓝色且体积非常巨大，在格斗作中可以从背包中伸出螺旋桨。在背包和衣服口袋中，装着各种各样的工具、材料、燃料、谜之物质[口授]。\n她下身穿着蓝色短裙，在风神录、黑市中颜色比上衣深，在心绮楼、深秘录、凭依华、人妖名鉴中颜色与上衣相同。裙摆上有一圈口袋。\n她脚穿雨靴一样的蓝色登山套鞋。\n她在风神录、求闻口授、人妖名鉴中左手持香蒲，在深秘录、凭依华中左手持撬棍。在风神录中右手持小根蒜，在心绮楼中右手抛出扳手。\n",
    relationships: "荷取与其他河童一起信仰着妖怪之山上新来的神八坂神奈子。\n因为黑谷山女会污染河水，荷取十分厌恶山女。[地灵殿]\n她曾是星熊勇仪的部下，因此十分敬畏勇仪。[地灵殿]\n在完全凭依异变中，她与秦心组队，以利用心的能力解析完全凭依的原理。\n她与山城高岭为首的山童敌对，为了毁灭其操控的黑市，与天弓千亦合作。\n"
  },
  {
    id: "Moriya Suwako",
    name: "洩矢诹访子",
    alias: [
      "青蛙子"
    ],
    introduction: "洩矢诹访子是东方Project系列中的官方角色，首次登场于东方风神录，担任风神录的EX面Boss。\n她原本是生活在外面世界的土著神，是八百万神之一；现在则是守矢神社供奉的神之一、山神和住在山里的各种各样的神明的领导者[风神录设定文档]，并统领着以御社宫司神（又名赤口神）为代表的祟神。\n她的性格初看好像很温厚，总是装出一副呆呆的样子。但是无法看透在想什么，真实性格或许很坏[口授]。她还有些任性妄为，多次不告诉神奈子与早苗擅自进行自己的计划。\n在风神录之后，她也作为敌机和可选自机出现在东方非想天则中，并多次为东风谷早苗提供支援和在早苗的结局中出场，在官方出版物中也时有出场。\n",
    lifestyle: "诹访子通过管束只有她能控制住的御社宫司神，曾作为神的同时作为王建立起洩矢之国，但在抵抗失败后将王国交给了八坂神奈子，不过之后一直都在实质上继续支配着王国。[风神录设定文档]\n如今诹访子居住在守矢神社，不怎么离开神社[口授]。\n作为山神，她统率着山中的神明。[风神录设定文档]\n她平时以人形态示人，祭祀请神之时，则常以青蛙的形态出现。[口授]\n",
    abilities: "诹访子拥有创造坤程度的能力。\n诹访子有统领祟神，尤其是管束与控制御社宫司神的力量，这种力量是她取得信仰的重要来源。\n诹访子不是掌管青蛙的神明，仅仅是非常喜欢青蛙。[口授]\n",
    appearance: "诹访子的身材与孩童相近。\n她有着一头金色的齐肩短发。头上一般戴着带有两个眼珠的特殊市女笠。\n她的眼瞳在风神录中为黑色，非想天则中为褐色，人妖名鉴为紫色。\n她身穿以青和白为基调的女性外出时的装束“壶装束”，衣服的各处都画着鸟兽戏画的青蛙。\n她穿着白色过膝袜和皮鞋。\n她手下的御射宫司神有着如同石制之蛇一般的身姿，嘴里发着红光[口授]，但在非想天则中是白蛇[符卡]的形象。\n",
    relationships: "诹访子曾经抵抗过八坂神奈子对自己王国的入侵，并在看到神力的差距后投降并交出王国。\n但是现在两人早已成为利害关系一致，而且实际上也很要好[风神录设定文档]的朋友。并且，诹访子因神奈子使自己开启在幻想乡的第二段人生而对她抱有一分感谢。\n神奈子所依仗的神德和信仰心基本都是源于诹访子的力量。[风神录]\n守矢神社本来是诹访子的神社，诹访子败给神奈子后神社也被抢走[风神录]。经过一系列事件后，如今守矢神社表面上是神奈子的神社，实际上是诹访子的神社，也是诹访子在让整个神社的机能运转[风神录]。\n诹访子是东风谷早苗所祭祀的神之一，早苗还是诹访子的遥远的子孙[风神录设定文档]。\n"
  },
  {
    id: "Seiran",
    name: "清兰",
    alias: [],
    introduction: "清兰是东方Project系列中的官方角色，首次登场于东方绀珠传，担任绀珠传的一面Boss。\n她是月兔，曾是月之都的月兔士兵，现在则已叛逃地上。\n在绀珠传之后，清兰还作为自机登场于东方兽王园中，在官方出版物中则少有出场。\n",
    lifestyle: "在绀珠传前夕，清兰曾在月之都地面调查部队“Eagle Rabbit”服役，负责潜伏渗透，干着危险的工作却只有微薄的薪水，是名副其实的炮灰。[绀珠传设定文档]\n在绀珠传后，她于人类村落路边开团子摊“清兰屋”，因味道不如铃瑚而在与铃瑚屋的竞争中处于下风。[文果真报]\n",
    abilities: "清兰拥有从异次元发射子弹程度的能力。\n",
    appearance: "清兰有着一头蓝色卷发，在绀珠传中及肩，在人妖名鉴和兽王园中及胸，脑后扎着下双马尾。\n她有着红色的眼瞳。\n她身穿蓝色短袖连衣裙，裙摆有一圈黄色星星和弯月图案。裙子有紫红色荷叶边和橘红色线围成的镂空图案，在线条交会处有黄色圆点。\n她裙内穿灯笼裤。\n尽管ZUN曾指出清兰虽然看不到，但其实有尾巴[绀珠传Music Room]，然而在人妖名鉴中清兰并没有尾巴。\n她脚穿白色短袜，袜口打着褶子，不穿鞋。\n她手持巨大的槌状横杵，上面沾有浆果[兽王园]汁液，给人暴力的印象[人妖名鉴]。\n",
    relationships: "清兰与铃瑚曾经是月之都的地面调查部队Eagle Rabbit的战友，现在是卖团子的同行。\n她与铃仙·优昙华院·因幡是前战友，曾经均在月之都服役，且两人互相认识。但是，清兰至今不知道铃仙在哪里[兽王园]。\n她与Reisen曾是同在月之都服役的战友，但两人关系未知。\n"
  },
  {
    id: "Watari Nina",
    name: "渡里贝子",
    alias: [
      "渡里妮娜"
    ],
    introduction: "渡里贝子是东方Project系列中的官方角色，首次登场于东方锦上京，担任锦上京的EX面Boss。\n她是蜃，是在信息海洋中呱呱坠地的、新生的贝之妖怪。\n",
    lifestyle: "贝子觉醒后，吸收了过分庞杂的信息，却将辨别真伪之事抛诸脑后，将这些信息全盘接收。\n她一度坚信真相的无误性，沉浸于狂热之中，不过在自机出现后被自机所带来的事实击碎了原本的这种想法，并放弃觉醒、迈向地上。\n",
    abilities: "贝子拥有展现海市蜃楼程度的能力。\n",
    appearance: "贝子有着一头黄绿色过腰卷发，头戴黑色发卡，左侧有蚌壳状装饰，用三个黑色发圈松散地扎住头发。\n她有着暗黄色的眼瞳。\n她身穿白色左衽短袖低开叉、类似旗袍但下摆未及膝的衣服，大臂和腰上用黑色绑带扎住，衣服边缘都有褶边，形似贝类外套膜，褶边整体从上到下由紫色经粉色、黄色过渡到蓝色。\n裸足。\n她曲腿漂浮在一瓣巨大的内白外棕的贝壳之上，身后的阴影形成了高楼、高塔的形状，其中一个楼房状阴影还被她伸出的手吸引了过去。\n",
    relationships: "暂无相关资料"
  },
  {
    id: "Kaenbyou Rin",
    name: "火焰猫燐",
    alias: [
      "阿燐",
      "猫车"
    ],
    introduction: "火焰猫燐是东方Project系列中的官方角色，首次登场于东方地灵殿，担任地灵殿的四、五、六面道中Boss和五面Boss。\n她是栖息在火焰中的火车。喜欢收集尸体，但对已埋葬的尸体不感兴趣。\n因为讨厌很长的名字而总叫别人称呼自己“阿燐”。\n性格开朗单纯，不会反复无常，只朝前看[口授]，能说善辩[地灵殿设定文档]。\n在地灵殿之后，她还作为自机登场于东方兽王园中，在官方出版物中也时有出场。\n",
    lifestyle: "居住在地灵殿中，平日里负责管理灼热地狱遗址的怨灵。\n有收集尸体的习性，但对活着的人类不感兴趣，也不会主动杀人。会到地面上去偷窃尸体。\n虽然是猫，却喜欢泡温泉[地灵殿]。\n",
    abilities: "阿燐拥有带走尸体程度的能力。\n阿燐也能和尸体以及灵体对话。\n阿燐还能捕捉和操纵尸体和怨灵。\n此外，阿燐也能让活蹦乱跳的妖精装成僵尸的样子攻击敌人[GoM]。\n作为火车，阿燐会不受自己控制地导致火灾乱子[醉蝶华]，使没有着火的地方却有着火一样的烟味并且随后开始着火。\n",
    appearance: "阿燐有着一头红色及耳短发，两侧各用两个黑色蝴蝶结缎带系成披肩麻花辫。她同时长着人耳和前面红后面黑的猫耳。\n她有着红色眼瞳。\n她身穿长袖连衣裙，在地灵殿和兽王园中为黑色，在人妖名鉴中为绿色。在地灵殿和人妖名鉴中，裙子上面有绿、蓝、白色的植物花纹，在兽王园园中则为蓝色。裙摆有绿色荷叶边。\n她脚穿黑色玛丽珍鞋，鞋上有黑色蝴蝶结缎带。腿上缠着黑色布带，在地灵殿和求闻口授中为左腿，在人妖名鉴和兽王园中为右腿，除兽王园外布条最上面也系着黑色蝴蝶结。布带上在兽王园中用蓝色、在其他作品中用白色写着一行字符。\n她身旁常跟着几只蓝色的怨灵。\n在地灵殿和人妖名鉴中，她推着木质手推车“阿燐的猫车”，盖着白布。尽管叫“猫车”1，在人妖名鉴中手推车却画出了两个轮子。\n阿燐的猫形态为红黑相间的猫又。阿燐虽然是猫又，但只在猫形态有两条尾巴，在人形态没有尾巴。\n",
    relationships: "是古明地觉的宠物，被觉任命管理灼热地狱遗址的怨灵。\n与灵乌路空从被觉饲养开始就是朋友，现在两人交情很深。[地灵殿设定文档]\n经常陪橙玩。[兽王园]\n与天火人血枪是友人[兽王园]。\n与娜兹玲是旧地狱的老相识[兽王园]，但娜兹玲和阿燐却处不来。\n"
  },
  {
    id: "Reiuji Utsuho，",
    name: "灵乌路空",
    alias: [],
    introduction: "灵乌路空是东方project系列中的官方角色，通称阿空，首次登场于东方地灵殿，担任地灵殿的六面Boss。\n她是生活在旧地狱的灼热地狱遗址的地狱鸦，被八坂神奈子选中而被八咫乌寄宿在体内。\n作为地狱鸦，她是个鸟脑袋，脑袋空空，十分健忘。这也是她体内能寄宿神灵的原因。\n在地灵殿之后，她又作为自机在东方非想天则中出场，作为敌机在东方刚欲异闻中出场。\n",
    lifestyle: "阿空本来就住在地狱，是地狱最早的居民。[地灵殿设定文档]\n她被古明地觉收为宠物后，负责看守火焰地狱遗迹防止其失控。[地灵殿设定文档]\n在被八坂神奈子驯养后，她成为神奈子手下的看守，负责排除核聚变炉中的异物[非想天则、刚欲异闻]、维持灼热地狱遗址的温度[刚欲异闻]。\n",
    abilities: "在被八咫乌寄宿于体内后，阿空拥有了操纵核聚变程度的能力。\n她是个鸟脑袋，只擅长于不需要多动脑子的单纯劳动的作业。[口授]\n",
    appearance: "阿空有着一头黑色及腰长发，头上戴着绿色缎带。\n她的眼瞳在地灵殿、非想天则、人妖名鉴中是红色，在刚欲异闻中是黑色。\n她上身穿着白色短袖，领子上有一行绿色三角形的图案，门襟上有白色扣子，上三颗下四颗。受八咫乌的影响[口授]，胸部有着深红的「赤之目」，右手上安着一门大炮一样的「第三足」。门襟和「赤之目」周围为黑色，再往外为绿色，绿色与白色的分界线为尖刺状。\n背后有一对黑色翅膀，挂着内面有蓝色星空图案的白色披风。\n她下身穿着绿色裙子，上有两圈白色三角形图案。裙边和裙子内面为黑色。\n她左足是「分解之足」，穿着制服鞋，在人妖名鉴中有原子样的光缠绕。右足是看起来很重的「融合之足」，被类似岩石的物质包裹。在刚欲异闻以外的作品中腿穿黑色及膝袜，在刚欲异闻中腿穿黑色过膝袜。\n",
    relationships: "阿空是古明地觉的宠物，对觉十分忠诚。被觉委托以调节灼热地狱火力的工作。[地灵殿设定文档]\n她和火焰猫燐是交情很深的朋友，两人从刚被觉饲养开始便成了朋友。\n她被八坂神奈子驯养并赐予了八咫乌的力量，是神奈子的部下，神奈子将维持核聚变炉正常运转的工作交给了阿空。\n"
  },
  {
    id: "Alice Margatroid",
    name: "爱丽丝·玛格特洛依德",
    alias: [
      "爱丽丝·玛格特罗伊德",
      "小爱",
      "人偶师"
    ],
    introduction: "爱丽丝·玛格特洛依德是东方Project系列中的官方角色，初登场作品为东方怪绮谈，担任怪绮谈的三面和EX面Boss1；新作初登场作品为东方妖妖梦，担任妖妖梦的三面Boss，并且由原有的名字“爱丽丝”变更为“爱丽丝·玛格特洛依德”。本条目仅说明新作中的爱丽丝，在旧作中登场的爱丽丝请参考爱丽丝（旧作）。\n她是由人类修行而成[求闻史纪]的魔法使，擅长操控人偶的魔法，被称为七色的人偶师[东方妖妖梦]。\n爱丽丝对于东方Project系列来说算的上是有点比较特别的角色[东方妖妖梦]。\n爱丽丝对他人一点都不关心，却对魔法很执着，尽管外表看起来坚强却有着弱小的一面[萃梦想设定文档]。她基本上不拘束于事物，性格上不固执不厌恶。她喜欢一个人独处，不过却常常参加宴会和在祭典上表演人偶剧。\n她看上去像个大人，非常好战，和她挑起胜负的话会立刻欣然接受[史纪]，但是爱丽丝不喜欢以压倒性的力量战胜对方，所以总是用比对手稍微高一点的力量战斗，甚至哪怕打输都不以全力进行战斗，因为全力战斗输了后就没有退路了。这一点和博丽灵梦很像[妖妖梦设定文档]，也就是很重视保留实力。\n在妖妖梦之后，爱丽丝还作为自机登场于在东方永夜抄、东方萃梦想、东方绯想天、东方非想天则中，在官方出版物中也偶有出场。\n",
    lifestyle: "爱丽丝平时独居在位于魔法森林的家玛格特洛依德邸中，喜欢一个人在家制作各种人偶，正在尝试制造一种会自动进行保养的人偶[永夜抄设定文档]，也会撰写魔法书[GoM]。因此，她不怎么爱出门，但是也会去祭典上表演人偶技艺[史纪]。\n她是个收集家，有着收集书籍之类的魔法道具的癖好，最近热衷于收集有说道的人偶。[妖妖梦角色设定]\n她拥有来自各地的人偶[妖妖梦里音乐评论]，家里摆满了大量的人偶[萃梦想设定文档]。\n她平时的料理、洗衣、打扫等家事大都是她操纵人偶完成的。[史纪]\n尽管身为魔法使，她仍然保持着和人类一样的吃饭与睡觉的习惯。[史纪]\n",
    abilities: "爱丽丝拥有使用魔法（人偶操纵）程度的能力。\n她并没有什么格外擅长或不擅长的属性。[妖妖梦设定文档]\n她的体术、移动身体和使用魔法都很普通。[萃梦想设定文档]\n",
    appearance: "爱丽丝属于身长较高[ZUN的邮件答复]的角色，有着白色的皮肤和人偶般的外表[史纪]。\n她有着金色及肩短发，头戴红色发箍，在永夜抄和人妖名鉴中发箍有白色褶子。\n她的眼瞳在妖妖梦、人妖名鉴中为蓝色，在其他作品中为褐色。\n她身穿蓝色短袖连衣裙，在妖妖梦、萃梦想、永夜抄、绯想天、非想天则中及踝，在史纪、人妖名鉴中及膝。裙子门襟用一排一字扣系住，扣子在妖妖梦、永夜抄中为黑色，在萃梦想、绯想天、非想天则中为红色，在人妖名鉴中为白色。领子上系着红色领巾，领巾有白色褶边。红色肩披白色披肩，边缘在人妖名鉴中有两圈黑色细线条，在其他作品中有一圈黑色粗线条。\n她腰间系着红色腰带，腰带有白色褶子，结系在身前。\n在妖妖梦、永夜抄中，她脚穿白色短袜。在史纪、人妖名鉴中，她脚穿棕色中靴。\n手持一本锁住的黑色封皮的魔法书，在妖妖梦、萃梦想、绯想天、非想天则、人妖名鉴为右手，在永夜抄、史纪为左手。\n在永夜抄中身旁有一只穿着红色连衣裙、脑后戴着红色大蝴蝶结的金发人偶，在除妖妖梦外其他作品中身旁有一只穿着黑色连衣裙和白色围裙、脑后戴着红色大蝴蝶结的金发蓝瞳人偶。\n",
    relationships: "作为同为魔法森林的住客，雾雨魔理沙经常到爱丽丝家串门。\n爱丽丝称博丽灵梦为“旧友”[妖妖梦]，但是随即被灵梦否认。\n由于爱丽丝在旧作中登场，二次设定中她和旧作人物的人际关系设定非常丰富，如与神绮的母女关系等，由此也衍生出了大量二次创作。\n"
  },
  {
    id: "Eternity Larva",
    name: "爱塔妮缇拉尔瓦",
    alias: [
      "大蛾子",
      "爱塔",
      "⑧"
    ],
    introduction: "爱塔妮缇拉尔瓦是东方Project系列中的官方角色，首次登场于东方天空璋，担任天空璋的一面Boss。\n她是凤蝶的妖精，但摩多罗隐岐奈认为她也许不是凤蝶的妖精而是常夜神[天空璋]。\n她平时性格非常温厚，在天空璋中因为进入暴走状态而变得很有斗志。\n作为妖精，她的脑袋与其他妖精一样空空如也。[天空璋Music Room]\n在天空璋之后，拉尔瓦还出场于东方三月精V，在官方游戏中也时有出场。\n",
    lifestyle: "在冬季以外的季节，拉尔瓦以太阳花田为据点活动。[三月精V]\n到了冬天她则会在魔法森林自己位于地下洞穴中的别墅里冬眠。[三月精V]\n",
    abilities: "拉尔瓦拥有播撒鳞粉程度的能力。\n此外，拉尔瓦可以在感到危险时从触角产生弹幕和很臭的气味。[天空璋设定文档]\n在四季异变后，拉尔瓦将异变中感受到的“生命力的失控”逐渐据为己有。凭借这种理解，她可以通过向克劳恩皮丝的火把中注入生命力，使冬天的博丽神社长出热带树木，充斥盛夏气息。[三月精V]\n作为妖精，她是不会死[史纪]的。\n",
    appearance: "拉尔瓦有着一头蓝色及肩短发，头发上有许多绿叶，头顶长着黄色触角，在天空璋中为“Y”形，在人妖名鉴中为“V”形。\n她的眼瞳在天空璋中为粉色，在人妖名鉴中为橙色。\n她身穿自上而下分别为黑色、深绿、浅绿的及膝连衣裙，图案分别对应成虫、蛹、幼虫。成虫部分，领口为黄色，袖口为黄色蝴蝶翅膀状，右侧有蓝色图案。蛹部分形似卷起的叶子。幼虫部分有两圈黑色图案，裙摆有一圈白色卵状图案。裙内穿灯笼裤。\n她背后长着一对黑黄相间的凤蝶翅膀，并有少量蓝色图案。\n裸足。\n",
    relationships: "拉尔瓦被摩多罗隐岐奈认为是敌人[天空璋]，不过本人并不知道。\n在四季异变中，她结识了琪露诺。之后她又先后结识了光之三妖精和克劳恩皮丝，不过平常并不经常与她们一起玩闹，但在紧急情况时会与她们一起行动。\n"
  },
  {
    id: "Ellen",
    name: "爱莲",
    alias: [
      "艾伦",
      "艾莲",
      "埃伦",
      "恋爱魔女",
      "蓬松头"
    ],
    introduction: "暂无相关资料",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Ushizaki Urumi",
    name: "牛崎润美",
    alias: [
      "牛妈"
    ],
    introduction: "牛崎润美是东方Project系列中的官方角色，首次登场于东方鬼形兽，担任鬼形兽的二面Boss。\n她是牛鬼，本是一种利用人类的善意袭击人类的可怕的鬼，但如今她已不再袭击人类。\n她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "润美平时生活在三途河畔。\n过去，她会把怀中的婴儿石像递给别人，然后增加其重量，让对方沉入河底。\n但自从幻想乡禁止妖怪袭击人类之后，她转而驯养着外界已经灭绝的超大型鱼，时而会前往幻想乡贩卖水产维生。虽然有妖怪嘲笑她威风不再，但本人却对现在的生活非常自豪。\n时不时她还会将尝试擅自渡过三途河的人诱导回其原本的世界。[鬼形兽设定文档]\n她经常在雾之湖畔卖鱼。[黑市]\n",
    abilities: "润美拥有改变身边物体重量程度的能力，尤其以“增重”为主。\n",
    appearance: "润美有着一头左黑右白的过肩短发，略卷，头上长着一对红色牛角，两侧长着一对牛耳，颜色与周围头发相同。\n她有着红色的眼瞳。\n她上身穿着黄色黑边露脐背心，下摆有白色荷叶边，荷叶边末端有一圈红点。背心外披着白色黑边半袖外套，外套上有形似奶牛花斑的灰白斑块纹样。\n她身后长着红色的牛尾巴。\n她下身穿着黄色黑边短裤，同样有着带有边缘红点的白色荷叶边。\n她脚穿红色拖鞋，鞋带为黑色，在鬼形兽中脚腕上的腕带上系着锁链，连着鞋带；在人妖名鉴中，脚腕上戴着锁链断开的脚镣。\n她怀中抱着一个裹在红色襁褓里的婴儿石像。\n",
    relationships: "暂无相关资料"
  },
  {
    id: "Mononobe no Futo",
    name: "物部布都",
    alias: [
      "布嘟嘟"
    ],
    introduction: "物部布都是东方Project系列中的官方角色，首次登场于东方神灵庙，担任神灵庙的五面Boss。\n她是古代日本豪族物部氏的成员，在苏我氏与物部氏的宗教战争中暗中穿针引线，侍奉圣德太子丰聪耳神子并随神子成为尸解仙。\n她在初次登场时给人留下了非常落伍的糟糕的第一印象，但每次在作品中再次登场时她都变得更加习惯现代，逐渐变成了只是有点傻傻的女孩子。[人妖名鉴]\n她虽然性格温厚，但思考方式也跟古时一直毫无变化，与普通人完全脱节了，然而姑且不论这点的话，也可说是很有仙人那种风格。她对人类没有敌意，但对妖怪则抱有无缘无故的敌意。[口授]\n在神灵庙之后，还作为自机登场于东方心绮楼、东方深秘录、东方凭依华等多部格斗作中，在官方出版物中出场不多。\n",
    lifestyle: "布都现在有时候会和丰聪耳神子一同行动，有时候则自己一人在努力修行，又或者是试着治好自己的时差问题。[口授]\n",
    abilities: "布都拥有操纵风水程度的能力。\n此外布都还做得到通过进行打碎摆放在场地上的盘子的“仪式”，来增强自己的仙力，仙力充实之后种种攻击将会得到强化。\n",
    appearance: "她有着一头灰色及胸长发，在脑后扎成马尾。头戴蓝色的乌帽子，上面缠着白色丝带。\n她的眼瞳在神灵庙、心绮楼、人妖名鉴中为灰色，在深秘录、凭依华中为蓝色。\n她上身穿着白色狩衣，里面穿着一层绿色狩衣和一层黄色狩衣。在神灵庙中领子上系着黑色丝带，在心绮楼、深秘录、凭依华、人妖名鉴中用紫色丝带系成蝴蝶结。胸前有两个黑色绒球。左袖口有红色虚线条纹，袖底系着红色丝带；右袖口有绿色虚线条纹，袖底系着绿色丝带。\n她下身的狩衣左下方有红点和黑线组成的类似河图的图案。狩衣下面穿着蓝色百褶裙，在人妖名鉴中有白色褶边。\n她脚穿深蓝色短靴，在神灵庙、人妖名鉴中系着黄色丝带，在心绮楼、深秘录、凭依华中左、右靴分别系着黄色和蓝色丝带。\n",
    relationships: "布都与苏我屠自古同是丰聪耳神子的部下、追随者，布都对神子十分忠诚。[神灵庙设定文档]\n她和云居一轮在完全凭依异变时组队。两人起初为争夺主役而争吵，最后一度与云山一起成为最强三人组，但在与依神姐妹对战时打了个同室操戈后绝交。[凭依华]\n"
  },
  {
    id: "Inubashiri Momizi",
    name: "犬走椛",
    alias: [
      "椛椛"
    ],
    introduction: "犬走椛是东方Project系列中的官方角色，首次登场于东方风神录，担任风神录的四面道中Boss。\n她是在妖怪之山中负责巡逻和警戒的白狼天狗之一，性格协调性高，执行任务忠实。\n在风神录之后，她在官方作品中出场很少，且和剧情没什么关系。\n",
    lifestyle: "椛不能出山，只能在山上做些低端基本的工作，例如没有意义的巡回和给地位高的天狗当保镖。[文果真报]\n她平日在九天瀑布内侧待机。\n因为妖怪之山入侵者很少，所以她平时都很闲，于是会找附近同样闲的河童下大将棋。\n",
    abilities: "椛拥有看见千里之外程度的能力，加上拥有的优秀嗅觉，她能够瞬间发现入侵者。[风神录设定文档]\n",
    appearance: "椛有着白色及肩短发，头戴小型红色六角帽（头襟），在人妖名鉴中帽子两侧会垂有各两个绒球，而在文果真报中，两侧只垂下长长的红色丝线并在末端有穗子。在人妖名鉴和文果真报的封袋中，头上长着一对白色狼耳。\n在人妖名鉴中她的眼瞳为红色。\n她上身穿着白色露腋装，正前方镶着两个白色绒球。\n她下身穿着上黑下红的袴。在人妖名鉴中，红色部分为枫叶图案。\n她在文果真报和人妖名鉴中穿着白色短袜。尽管是天狗，却在风神录中似为裸足，在人妖名鉴中则穿着白色四分之三袜和红色的，常由舞伎穿的鞋「おこぼ」，并用红色鞋带系着蝴蝶结。\n在文果真报和人妖名鉴中，她身后长着白色狼尾。\n她左手持盾，上面有枫叶形花纹。右手持长刀。\n",
    relationships: "她和同为天狗的射命丸文关系有些僵硬，一见面就很容易争吵[DS]。\n与周围的河童是棋友。平时待机时，经常去找附近同样闲的河童下大将棋。\n"
  },
  {
    id: "Genjii",
    name: "玄爷",
    alias: [],
    introduction: "\n",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Tamatsukuri Misumaru",
    name: "玉造魅须丸",
    alias: [
      "玉造大妈"
    ],
    introduction: "玉造魅须丸是东方Project系列中的官方角色，首次登场于东方虹龙洞，担任虹龙洞的四面Boss。\n她是从古代的矿物制造勾玉的神明。\n在虹龙洞之后，魅须丸几乎再未在官方作品中出场过。\n",
    lifestyle: "魅须丸并不常驻幻想乡。她在各地看过无数任由欲望开山，又随着资源耗竭而被抛弃的矿山遗址。\n她的主业是制造勾玉，也制造阴阳玉等其他玉，以制玉为生。[虹龙洞]\n",
    abilities: "魅须丸拥有制造勾玉程度的能力。\n此外，魅须丸也能制作阴阳玉，博丽灵梦的阴阳玉就是魅须丸制造的。[虹龙洞]\n",
    appearance: "魅须丸有着一头前浅黄后棕的及肩短发，鬓发为浅黄，用小玉扎住；脑后头发为棕色，用大玉扎住。\n她有着粉红色的眼瞳。\n她上身穿着古坟时代风格的红色短袖上衣，袖子为白色。上衣有许多红棕色勾玉图案。左肩挂着用绳子串起的七彩勾玉。腰间系着紫色绑带，带子两端挂着七彩勾玉。\n她下身穿着土黄色及膝裙，有许多绿色勾玉状图案。裙摆挂着一圈七彩勾玉。\n裸足。\n",
    relationships: "暂无相关资料"
  },
  {
    id: "Ma maru chi",
    name: "玛○奇",
    alias: [
      "玛玛露奇",
      "玛露奇"
    ],
    introduction: "暂无相关资料",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Maribel Hearn（官方资料未给出拼写，",
    name: "玛艾露贝莉·赫恩",
    alias: [
      "玛艾里贝利·哈恩",
      "梅莉"
    ],
    introduction: "玛艾露贝莉·赫恩是东方Project系列中的官方角色，首次登场于莲台野夜行。\n她是近未来的女大学生，是灵异社团“秘封俱乐部”的成员之一。\n她被宇佐见莲子称作梅莉。这个别名的出现很可能是因为用日文难以发出玛艾露贝莉·赫恩的音。[梦违科学世纪]\n在莲台野夜行之后，梅莉便一直作为主要角色登场于ZUN's Music Collection系列的专辑中，她也一直出现在系列专辑的封面上。\n",
    lifestyle: "梅莉是外面世界的一名大学生，在京都的一所大学中[卯酉东海道]专攻相对性精神学[梦违科学世纪]。\n梅莉与宇佐见莲子一同经营着名为秘封俱乐部的社团，进行着在科学世纪探寻遍布四处的结界的活动[莲台野夜行、梦违科学世纪]。\n她们生活的时代被称作科学世纪。其中科学昌明而信息科技高度发达，人们能够平等地获取信息，而物理学也进入了解释和哲学的时代。[大空魔术]相反的是，想象力灭绝了，而无法解释的事物则被当做一个错误抹煞，无法解释的神秘也被否定。[伊奘诺物质]相比起数量与获得信息的速度，人们更愿意追求质量[燕石博物志]，也存在富有的人更愿意选择古老的方式进行出行、享受的逆转的思潮[卯酉东海道、旧约酒馆]。\n梅莉习惯于昼夜颠倒。[七夕坂梦幻能]\n",
    abilities: "暂无相关资料",
    appearance: "梅莉有着一头金色及肩短发，微卷。其服饰在各个bk上不尽相同，但大致存在以下共同点：紫色的白领口上衣和裙子，戴着一顶有荷叶边的白色小帽，穿着白色短袜。\n",
    relationships: "梅莉与宇佐见莲子是关系要好的朋友。她们在同一所大学学习，并且都是灵异社团秘封俱乐部的成员[莲台野夜行]。\n由于外貌特征与八云紫极为相似，二次设定中一般认为两人有联系。\n"
  },
  {
    id: "Kisume",
    name: "琪斯美",
    alias: [
      "琪丝美",
      "小桶"
    ],
    introduction: "琪斯美是东方Project系列中的官方角色，首次登场于东方地灵殿，担任地灵殿的一面道中Boss。\n她是钓瓶落，是地底一种恐怖的妖怪，性格内向[地灵殿设定文档]而凶暴[口授]。\n在地灵殿之后，她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "琪斯美平常待在水井里或洞窟（包括旧地狱的幻想风穴）内。\n不知道她平时在干些什么。可确定的是她性格凶暴，会二话不说就来砍人的头，然后把头放在桶里拿回去。[口授]\n她非常喜欢狭窄的地方，所以一直都在桶里。[地灵殿设定文档]\n",
    abilities: "琪斯美拥有降下鬼火程度的能力。\n八云紫认为包括琪斯美在内的地下妖怪的力量来自人类的负的能量[口授]。\n",
    appearance: "琪斯美有着绿色及肩短发，用串着两个白色珠子的头绳扎成双马尾。\n她的眼瞳在地灵殿中为黑色，在人妖名鉴中为绿色。\n她身穿白色和服。\n她呆在一个吊桶中，从肩膀以下都在吊桶里面，只有手和头露在外面。\n",
    relationships: "暂无相关资料"
  },
  {
    id: "Cirno",
    name: "琪露诺",
    alias: [
      "奇鲁诺",
      "笨蛋",
      "冰精",
      "⑨",
      "黑皮⑨",
      "9"
    ],
    introduction: "琪露诺是东方Project系列中的官方角色，首次登场于东方红魔乡，担任红魔乡的二面Boss。\n她是冰之妖精。\n她脑子有些笨笨的[红魔乡设定文档]，和其他妖精一样天真，喜欢恶作剧。\n铃仙·优昙华院·因幡评价她波长很短，对应着她容易冲动。[花映塚]\n她从不考虑自己的力量就去恶作剧，因而每次都会吃苦头。对于全部妖精来说，无论吃多少苦头也不会反省一点，下次就继续恶作剧了。[花映塚角色设定]\n在红魔乡后，琪露诺也多次在官方游戏和出版物中出场，并在东方花映塚、东方非想天则、妖精大战争和东方天空璋中作为自机出场。\n",
    lifestyle: "琪露诺平时以雾之湖作为根据地。\n她是湖附近妖精们中的领袖般的存在，力量也比其他妖精强。她是属于好战型的，所以必须留神。[史纪]但是她其实和杂鱼没什么大区别[辉针城设定文档]。\n她喜欢玩一种把青蛙冻住后放到水里解冻的恶作剧游戏。她称之为“结冰的修行”[文花帖（书籍）]。但是每玩三次大概就会有一次失败，青蛙就会悲惨地支离破碎[红魔乡设定文档]。\n博丽神社开始举行各类祭典后，她常常会在活动时去神社开刨冰摊[东方三月精、东方茨歌仙]。\n",
    abilities: "琪露诺拥有操纵冷气程度的能力和操纵冰程度的能力。\n她作为妖精是不会死[史纪]的。\n",
    appearance: "琪露诺属于身长低[ZUN的邮件答复]的角色。\n她有着一头浅蓝色短发，脑后扎着大蝴蝶结，在花映塚、非想天则中为绿色，在其他作品中为蓝色。\n她有着蓝色的眼瞳。\n她身穿蓝色连衣裙，裙子下摆为白色，与蓝色交界处为锯齿状，在史纪中裙摆侧面有缺口，并有菱形绳结装饰。裙底穿着白色灯笼裤。领口系着红色领结，在天空璋和人妖名鉴 常世篇中，领口还戴着一朵向日葵，身上缠着牵牛花。\n她背后生有三对冰晶状的菱形翅膀（在红魔乡、非想天则中并没有明显分开，在辉针城中仅能看见两对）。\n在妖妖梦、求闻史纪中脚穿白色短袜，在人妖名鉴宵暗篇中脚穿蓝色玛丽珍鞋，在其他作品中为裸足。\n",
    relationships: "琪露诺会和光之三妖精一起恶作剧和玩耍，被光之三妖精用于避暑，也和光之三妖精展开过战斗。[妖精大战争]\n后来，她还结识了克劳恩皮丝和爱塔妮缇拉尔瓦，会与她们一起玩耍。\n她曾和大妖精捉迷藏。[三月精S]\n"
  },
  {
    id: "Ru~koto",
    name: "留琴",
    alias: [
      "露柯特",
      "核能女仆"
    ],
    introduction: "\n",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Konngara",
    name: "矜羯罗",
    alias: [],
    introduction: "暂无相关资料",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Yatadera Narumi",
    name: "矢田寺成美",
    alias: [
      "地藏"
    ],
    introduction: "矢田寺成美是东方Project系列中的官方角色，首次登场于东方天空璋，担任天空璋的四面Boss。\n她是在魔法森林的魔力驱动下得到生命的地藏像，属于一种魔法使。\n她性格内向[天空璋]，但在四季异变中受涌出的魔力影响变得好战。\n她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "成美过去被安置在魔法森林中，现在仍然居住在此。\n她是个家里蹲，即便在异变发生时也不愿离开森林去调查。\n",
    abilities: "成美拥有使用魔法程度的能力（生命操纵）。\n",
    appearance: "成美有着一头黑色及腰长发，脑后系着两条麻花辫。头戴一顶遍路笠，在天空璋中上面写着“迷故三界城/悟故十方空/本来东西无/何处有南北/同行二人/यु”。斗笠上覆盖着残雪里面内衬白布，边缘打着褶子。\n她有着红色的眼瞳，长着长耳垂。\n她身穿灰色大衣，纽扣为红色，左肩披着红色披巾，在天空璋中有黑色的汉字“毕竟成佛”。\n她脚穿红绳短袜和黑色木屐。\n作为地藏像，她的立绘总是双手合十。\n",
    relationships: "成美与雾雨魔理沙同住在魔法森林，很早就相互认识了。她被魔理沙叫作成子[天空璋]。\n"
  },
  {
    id: "Iwanaga Ariya",
    name: "磐永阿梨夜",
    alias: [],
    introduction: "磐永阿梨夜是东方Project系列中的官方角色，首次登场于东方锦上京，担任锦上京的六面Boss。\n她是石之女神，被月之民连带着浅间净秽山封印在地底深处。\n",
    lifestyle: "阿梨夜因为拒绝成为月之民，在神社被月之民接管后仍然顽抗到底，最终与神社一同被封印在地底深处，毫无悔意地接受了孑然一身的必然结局。\n",
    abilities: "磐永阿梨夜拥有阻止变化程度的能力。\n",
    appearance: "阿梨夜有着一头棕色齐脖短发。\n她有着红色的眼瞳，左脸戴着棕色石质面具，面具上部为螺旋纹路。\n她上身穿着白色窄长袖低领连衣裙，扣子为古铜色，手肘、左肩、左腹至躯干正下方有古铜色脊椎状图案。身后左侧有着类似巨大肋骨的古铜色装饰，末端燃烧着红色火焰；右侧有着古铜色的翅膀骨架状装饰，形似始祖鸟化石的翅膀骨架，其上挂着深青蓝色披风，披风末端延伸至左下，上面有白色眼睛状图案，还有数个眼睛外有等边三角形，左侧披风在两条直线框柱的范围内笼罩着棕色阴影；在肋骨与翅膀骨架中间朝左下延伸出古铜色脊椎骨状装饰。\n她下身在裙子外粘着一圈排列紧密的深灰色石头，为形似玄武岩的结晶化石柱。[二轩目]\n裸足。\n她左手扶着面具。\n",
    relationships: "阿梨夜与维缦·浅间是以浅间净秽山为本殿的神社所祭祀的两尊祭神。阿梨夜曾为了拯救维缦而不再拒绝一切，出手干预异变。\n"
  },
  {
    id: "SinGyoku",
    name: "神玉",
    alias: [],
    introduction: "神玉是东方Project系列中的官方角色，也是系列官方作品的第一个敌方角色。首次登场于东方灵异传，担任该作品的5面BOSS。\n另外，神玉还是系列中罕见的拥有多个形态的角色之一。\n",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Shinki",
    name: "神绮",
    alias: [
      "太太",
      "呆毛神",
      "女儿怪"
    ],
    introduction: "暂无相关资料",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Aki Minoriko",
    name: "秋穰子",
    alias: [
      "秋姐妹",
      "烤红薯"
    ],
    introduction: "秋穰子是东方Project系列中的官方角色，首次登场于东方风神录，担任风神录的一面Boss。\n她是掌管幻想乡秋天的其中一位八百万之神，掌管着丰收，是丰收之神。\n作为丰裕与收成的象征，她性格比较朴素开朗，没什么神的威严。\n在风神录之后，在官方游戏和出版物中出场很少，而且跟剧情没什么关系。\n",
    lifestyle: "穰子擅长烤番薯，她会通过花长时间加热，来增加甜味[GoU]，因此烤的番薯十分美味。\n她身上有生的烤红薯的香气1[风神录]，因为她把红薯当成香水[风神录]。\n因为掌管着谷物与果实的收成，她受到人们的爱戴，每年都会被人类邀请参加收获祭以表达感谢之意。\n因为得到的都是个人性质的信仰而工作量少，不过她反而为此高兴。\n当遇到蔑视或者排斥她的人[史纪]时，她会教训对方一顿。\n她中意于自然务农法，刻意避免过度除草整地的行为，因此敌视反此道而行的农户。\n她在冬天会变得没精神。\n",
    abilities: "穰子拥有掌管丰收程度的能力，可以使作物发育成熟，也可以使农作物枯萎。\n",
    appearance: "穰子有着一头金色齐颈短发，略卷。头戴红色荷叶边帽子，右侧的帽檐上有一串葡萄作为装饰，葡萄藤绕着帽子缠了一圈。\n她有着红色的眼瞳。\n她身穿红色围裙，系着黑色带子，在人妖名鉴中带子在背后系着蝴蝶结。围裙里面穿着宽松的黄色长袖。围裙下部有金色稻穗图案，裙摆有荷叶边。\n她下身围裙下穿着黑色过膝长裙，裙摆上有一圈白色花纹，裙下穿着灯笼裤。\n裸足。\n",
    relationships: "她是秋静叶的妹妹。在漂浮着果物和农作物的香味时，总是对安静的姐姐保持着优越感[风神录设定文档]。\n"
  },
  {
    id: "Aki Sizuha",
    name: "秋静叶",
    alias: [
      "秋姐妹"
    ],
    introduction: "秋静叶是东方Project系列中的官方角色，首次登场于东方风神录，担任风神录的一面道中Boss。\n她是掌管幻想乡秋天的其中一位八百万之神，掌管着红叶，是红叶之神。\n作为寂寞与终焉的象征，她性格比较悲观，总是发愁年末马上就要到来。[口授]\n在风神录之后，静叶在官方游戏和出版物中出场很少，而且跟剧情没什么关系。\n",
    lifestyle: "静叶在秋天会使幻想乡的落叶阔叶林变为红色，再踹树使红叶落下。[口授]\n她在秋天之外则无所事事。[口授]\n她不擅长战斗，但是仍会惩罚妨碍秋天的人。[风神录设定文档]\n她生气时脸会变得通红。[口授]\n",
    abilities: "静叶拥有掌管红叶程度的能力，可以使落叶阔叶林的树叶变成红色，也会使红叶掉落。\n",
    appearance: "静叶有着一头金色齐颈短发，头戴枫叶状头饰。\n她有着金色的眼瞳。\n她上身穿着枫叶红衣服，领子为枫叶状碎花。左侧胸口有一个白色口袋。\n她下身穿着像枫叶一样从红向下渐变为黄的裙子，下摆也为枫叶状碎花。\n她脚穿白色短袜和黑色鞋子。\n",
    relationships: "她是秋穰子的姐姐。给妹妹看美丽的红叶时，会沉浸在优越感中[风神录设定文档]。\n"
  },
  {
    id: "Hata no Kokoro",
    name: "秦心",
    alias: [
      "心心",
      "心酱"
    ],
    introduction: "秦心是东方Project系列中的官方角色，首次登场于东方心绮楼。\n她是面灵气，是秦河胜使用的66个面具被长久放置后化成的付丧神。\n她在稳定的时候基本不会流露出自己的感情，对于什么事都不感兴趣。\n在心绮楼之后，心还作为自机登场于东方深秘录和东方凭依华，在官方出版物中也时有出场。\n",
    lifestyle: "在有必要使用面具的时候以外心只会悄悄地作为一个付丧神。[心绮楼设定文档]\n",
    abilities: "心拥有操纵感情程度的能力。\n",
    appearance: "心有着一头粉色及腰长发，头的左前方浮着一个面具，即心正在佩戴的面具，代表着此时心的心情。\n她有着粉色的眼瞳。\n她上身穿着有着方格花纹的蓝绿色长袖衬衫，纽扣自上到下为红色五角星、黄色圆、绿色三角、粉色叉字。\n她下身穿着橘红色南瓜裙，裙边打着褶子，裙子上有月牙形镂空，形似哭脸和笑脸。\n她脚穿白色短靴，左脚靴子系着绿色蝴蝶结，右脚靴子系着红色蝴蝶结。\n",
    relationships: "组成心的66个面具是秦河胜使用过的面具。\n丰聪耳神子作为圣德太子，秦河胜的上司，是亲手制作了六十六个面具的人，也以自己的脸为蓝本为心做了一个新的希望之面[心绮楼神子线]，同时当她的面具受损时也会来到神灵庙求助神子帮忙修复[深秘录]。\n心曾在命莲寺跟随圣白莲修业以控制住自己情感的失控，并在这个过程中用自己的希望做出了新的希望之面。[心绮楼白莲线]\n古明地恋捡到了因地裂掉到地底的心的希望之面[心绮楼]，但恋并没有打算还给心，两人因此曾大打出手，最终心也没能从恋手里夺回希望之面。\n"
  },
  {
    id: "Kisin Sagume，",
    name: "稀神探女",
    alias: [],
    introduction: "稀神探女是东方Project系列中的官方角色，首次登场于东方绀珠传，担任绀珠传的四面Boss。\n她是月之民，虽然算是神灵，但是其性质非鬼非神亦非精灵，是天邪鬼的一种[绀珠传Music Room]，也是位居天邪鬼之上的神灵[绀珠传设定文档]。她也同时拥有天津神、国津神双方的属性。[绀珠传访谈]\n由于能力的缘故，她性格寡言，甚至在梦中也是如此[噩梦日记]。\n她在官方游戏与出版物中登场次数不多。\n",
    lifestyle: "探女在月之都担任高官，却不会经常在外界面前出现。\n在绀珠传前后的一段时期，她多次试图利用幻想乡，使幻想乡每每陷入[东方深秘录、东方绀珠传]或差点陷入[东方文果真报]危机。\n",
    abilities: "探女拥有从口中说出便可使事态逆转程度的能力。\n",
    appearance: "探女有着一头银灰色及肩短发，略卷，扎成公主辫，在脑后收束为一条小辫。\n她有着红色的眼瞳。\n她上身穿着紫色长袖衬衫和米色外套，衬衫领子和袖口有白色曲线图案，领口戴着一个蝴蝶结，中间有一颗绿色宝石。外套肩部有黑色曲线花纹，底部有黑色箭头状花纹，通过门襟的黑线连接在一起。\n背后右侧长着一只从上到下由深灰色渐变为浅灰色的鸟翼。\n她下身穿着紫色过膝长裙，裙摆为指向逆时针方向的箭头形状。\n她脚穿棕色短靴，靴帮有两个白色叉子图案。\n总是一手遮挡住嘴，在绀珠传中用左手，在人妖名鉴中用右手。\n",
    relationships: "为了应对纯狐的攻击，探女嘱咐哆来咪·苏伊特，让她在梦中再现了月之都，将想要前往月之都的人送到那里，从而隐蔽真正的月之都的存在，并让她守护连接地上的通道。\n她对身为月之贤者的八意永琳至今仍怀敬意，在绀珠传之后曾亲自去永远亭拜访永琳。[文果真报]\n"
  },
  {
    id: "Hieda no Akyuu",
    name: "稗田阿求",
    alias: [],
    introduction: "稗田阿求是东方Project系列中的官方角色，于幺乐团的历史1中首次被提及1，正式登场于东方求闻史纪。\n她是第九代御阿礼之子，稗田家的家主，幻想乡的书记，历史丛书《幻想乡缘起》和连载推理小说《全都是妖怪干的吗》的作者。\n在求闻史纪之后，阿求还作为主要角色登场于东方求闻口授中，并在东方铃奈庵中活跃，在其他官方出版物中则少有出场。\n",
    lifestyle: "阿求居住在稗田邸，是以编纂历史[铃奈庵46话]和记录妖怪[铃奈庵16话]为工作的稗田家的大小姐和家主。因此，阿求最重要的工作便是撰写《幻想乡缘起》。\n除了《幻想乡缘起》外，她也在以阿求的名义撰写新的历史书。[铃奈庵46话]\n她转生为阿求之后，爱上了红茶。[史纪]\n她喜欢吃兔肉。[史纪]\n在阅读了各种推理小说后，她开始用“阿加莎克里斯Q”的笔名写推理小说。[铃奈庵40话]\n",
    abilities: "御阿礼之子拥有转生之术，能够在死后一百二十年到一百八十年[史纪]转生，并在出生后便拥有历代御阿礼之子的记忆，阿求便是稗田阿礼转生到第九代的御阿礼之子（阿礼少女）[史纪]。\n作为御阿礼之子，阿求还拥有求闻持的能力[史纪]，即过目不忘程度的能力。\n作为御阿礼之子，她头脑聪明，比起稗田家一般人更博识，相对的身体孱弱。[史纪]\n所有御阿礼之子，可能因为转生不完全或智能太高，寿命无法长久，大概活不过三十岁。[史纪]\n",
    appearance: "阿求有着一头紫色及肩短发，头顶偏左处有一朵山茶花作为头饰。\n在幺乐团的历史、ZUN的设定、铃奈庵中，她有着紫色的眼瞳。在人妖名鉴中，她有着红色的眼瞳。\n她身穿和服，上面有花和蝴蝶的图案。挂衿和本衿为青葱色，袖为黄色，袂为森林绿色。\n她下身还穿着红色袴裙。在袴裙的后面也有花的图案。\n在幺乐团的历史、ZUN的设定中，她脚穿白色足袋，不穿鞋。在人妖名鉴中，她脚穿黑色皮靴。\n",
    relationships: "八云紫负责审查与修订《幻想乡缘起》的内容。[记忆幻想乡]\n《幻想乡缘起》的印刷装订是在铃奈庵进行的。[铃奈庵1话]\n上白泽慧音与稗田家的关系非常密切。尽管阿求最初不打算去当老师[史纪]，但是后来仍然成为了慧音开的寺子屋的老师[文果真报]。\n"
  },
  {
    id: "Mystia Lorelei",
    name: "米斯蒂娅·萝蕾拉",
    alias: [
      "老板娘",
      "小碎骨",
      "米斯琪"
    ],
    introduction: "米斯蒂娅·萝蕾拉是东方Project系列中的官方角色，首次登场于东方永夜抄，担任永夜抄的二面Boss。\n她是被称为夜雀的鸟妖怪。\n尽管夜雀原本是只闻其声、不见其形的妖怪，但她却很爱表现自己[大·东方Project展]，并非常喜欢热闹、吵闹的事情[花映塚]。\n在永夜抄之后，她还登场于东方花映塚中，在官方出版物中也时有作为摊贩出场。\n",
    lifestyle: "她只会于深夜出没[永夜抄]，在黑暗的夜道和无人的森林用歌声迷惑人类使人迷路[史纪]，进而袭击被迷惑的人。\n在白天她则往往隐藏起来[史纪]。\n她可能是文盲。[文花帖（书籍）]\n她用一辆挂着红灯笼的移动货摊在兽道开烤八目鳗店。她会将八目鳗卖给被自己变成雀盲眼的人，还会混入鳗鱼、泥鳅和解除施加的夜盲症来骗人。[文花帖（书籍）]\n她一天到晚用鸟头唱歌，歌声即使在白天也没有停息。[花映塚]\n",
    abilities: "米斯蒂娅拥有用歌声诱人发狂程度的能力和用歌声迷惑人程度的能力。\n她拥有让人类变得夜盲的能力[史纪]。\n",
    appearance: "米斯蒂娅有着一头粉色短发，在永夜抄、花映塚中齐颈，在求闻口授、人妖名鉴中齐肩。耳朵为羽翼状，在永夜抄、花映塚中为粉红色，在人妖名鉴中为紫色。头戴的帽子在人妖名鉴以外的作品中为暗红色，在人妖名鉴中为棕色。帽子顶端有暗红色绒球，两侧有羽翼状装饰，除人妖名鉴外帽子上有一圈白色月牙状图案，在人妖名鉴中帽子有荷叶边。\n她有着黑色的眼瞳。\n在人妖名鉴以外的作品中，她身穿暗红色长袖连衣裙，领子和袖子为白色，袖子有褶边，大臂处各绑着一根棕色带子，裙摆有荷叶边。戴着淡粉色羽翼状蝴蝶结领结。裙子上有许多淡粉色羽翼状装饰，用同色线串在一起，从上到下并绕裙摆一圈。\n她长着大型羽翼[史纪]，连所有羽翼状装饰和蝴蝶结均为紫色骨架和白色羽毛。\n她在永夜抄、花映塚中穿着恰好恰好卡在膝盖上的暗红色及膝袜，在人妖名鉴中穿黑色袜子。除人妖名鉴外，脚踝处各有一个羽翼状装饰。在永夜抄中，脚穿黑色鞋子。在求闻史纪中，鞋子上也有羽翼状装饰。在人妖名鉴中，脚穿棕色皮鞋。\n她长着长长的手指甲，指甲在永夜抄中为白色，在花映塚中为绿色，在人妖名鉴中为紫色。尽管手指在永夜抄中只能看见三根，但其实有五根[永夜抄符卡说明]。\n在人妖名鉴中，她身边围绕着蓝色音符和高音符号。\n米斯蒂娅的2P色将暗红色改为蓝绿色，翅膀变为红色骨架褐色羽毛。\n",
    relationships: "米斯蒂娅与幽谷响子组成“鸟兽伎乐”组合，演唱朋克摇滚风格的音乐。[口授]\n"
  },
  {
    id: "Hoan Meirin / Hong Meirin",
    name: "红美铃",
    alias: [],
    introduction: "红美铃是东方Project系列中的官方角色，首次登场于东方红魔乡，担任红魔乡的三面Boss。\n她是中国妖怪[C76对话]，身穿中国风的服装，使用中国武术，担任着红魔馆的门卫。\n虽然她的种族为妖怪，但她的外表和谈吐与人类没有任何区别[东方求闻史纪]。\n性格开朗率直，有些热血。偶尔会偷懒和发牢骚。\n在红魔乡之后，她也作为自机登场于格斗作东方萃梦想和东方非想天则中。\n",
    lifestyle: "因为擅长体技[上海爱丽丝通信]，美铃被任命为红魔馆门卫。红魔馆很少接待客人，所以她经常会阻拦不速之客[非想天则]。\n同时她也负责管理红魔馆的花坛[文花帖（书籍）]，被认为是花坛的看护人[GoM]。\n看门时，她会打太极拳、睡觉[东方求闻史纪]或看热血漫画[非想天则]。\n因为她由红魔馆提供饮食[史纪]，所以不会主动袭击人类。\n不仅如此，因为职务关系，她和人类接触率很高。经常有人和她搭话。[史纪]\n来拜访的人有时会向她发起挑战，测试自己的身手[史纪]。\n",
    abilities: "美铃拥有运用气程度的能力，尤其擅长配合“气”使用的武术。\n武艺高强[幻想揭示板]，行动也很轻巧[史纪]。\n虽然她的种族是妖怪，但是她很少使用妖术[史纪]。\n是万能型的妖怪，没有特别的弱点，因此虽然不算强但面对人类没有死角。[史纪]\n除此之外，作为花坛看护人，她也使用过以开花为印象的弹幕（华符「芳华绚烂」）[GoM]。\n",
    appearance: "美铃属于身长高[ZUN的邮件答复]的角色，外表和人类没有任何区别[史纪]。\n她有着一头红色及腰长发，两侧的鬓发扎成麻花，末梢系着黑色蝴蝶结，头戴绿色帽子，帽子前面有一个写着“龍”字的金属星形物。\n她有着蓝色的眼瞳。\n她上身穿着军绿色马甲和白色短袖衬衣，马甲上边缘有白色回纹，门襟为白色，扣子为一字扣，领口有黑色丝绳系成的蝴蝶结。\n她下身穿着长度到小腿的军绿色长裙，在人妖名鉴中右侧开衩，开衩处旁边有浅绿色回纹；在除人妖名鉴外的其他作品中在左侧开衩，开衩处为白色，在红魔乡中有绿色回纹，在萃梦想、非想天则中有灰色回纹。\n她在史纪中穿着白色短袜和黑色鞋子，在人妖名鉴中穿着黑色船鞋。\n",
    relationships: "十六夜咲夜是美铃的上司，美铃睡觉时会为了让她好好工作把她打醒[东方非想天则]。\n美铃也会听从帕秋莉·诺蕾姬、蕾米莉亚·斯卡蕾特等人的命令。\n比起红魔馆的其他人，她对人类亲近得多[东方求闻史纪]。\n"
  },
  {
    id: "Junko",
    name: "纯狐",
    alias: [
      "老佛爷",
      "纯妈"
    ],
    introduction: "纯狐是东方Project系列中的官方角色，首次登场于东方绀珠传，担任绀珠传的六、EX面Boss。\n她是神灵，自称“仙灵”，是被怨恨纯化的灵。\n她一方面无比强烈地仇恨嫦娥和月之都，另一方面又十分达观，能将一时成败轻轻放下。\n在绀珠传游戏中，她的名字字体比其他角色大一号，这是为了体现威压感。[绀珠传访谈]\n她在官方游戏与出版物中登场次数不多。\n",
    lifestyle: "纯狐在丈夫羿杀死自己儿子的怨恨纯化失控后，开始定期侵略月之都。\n",
    abilities: "纯狐拥有纯化程度的能力。\n",
    appearance: "纯狐有着一头金色波浪卷发，在绀珠传中及腰，在人妖名鉴中及膝。头戴黑色的扇形冠冕，形制类似于满族的“大拉翅”，上面有红色和金色的月牙图案，两侧垂下黑色穗子。\n她有着红色的眼瞳。\n她身穿外黑内红的及地长裙，形制结合了满汉风格。袖子很宽大，领子用黄色丝线系着蝴蝶结，上身外穿红色无袖围裙，上有黄色九尾狐图案和蓝色图案。袖口和裙摆有一圈黄色图案。\n她身后有七条紫色灵气，形似尾巴。\n",
    relationships: "因为嫦娥和纯狐共同的丈夫羿杀死了纯狐的儿子，所以纯狐杀死了羿[绀珠传]，并强烈地憎恨身为羿坏妻子的嫦娥，把她当作不共戴天之敌，为此也憎恨拥戴嫦娥的月之民们，定期侵略月之都。\n她与同样怨恨嫦娥的赫卡提亚·拉碧斯拉祖利很快就意气相投，两人联手进行了绀珠传中对月之都的袭击。\n"
  },
  {
    id: "Yuiman Asama",
    name: "维缦·浅间",
    alias: [],
    introduction: "维缦·浅间是东方Project系列中的官方角色，首次登场于东方锦上京，担任锦上京的四面Boss和EX面道中Boss。\n她是古神人，曾是名为维缦的国度的公主，被赋予了与月之民同等的神格，如今则被束缚在浅间净秽山中为月之民工作。\n",
    lifestyle: "作为维缦国公主时，维缦原本居住在浅间山[锦上京]，在自然之中以猎鹿为乐，过着悠然自得的田园牧歌生活。\n仿照浅间山而筑的浅间净秽山竣工后，她还在以其为本殿的神社中作为神格化的维缦国公主受到祭祀。[锦上京]\n她如今被月之民篡改记忆并强行囚禁在浅间净秽山，被歪曲为卑贱的存在。月之民在浅间净秽山中为她准备了再现故乡名胜、展现四季美景的场所。\n",
    abilities: "维缦拥有驱蛇噬物并使其转生程度的能力。\n",
    appearance: "维缦有着一头白色及腰长发，留着长长的刘海。\n她有着红色的眼瞳。\n她上身穿着黑色无袖上衣，下身穿着深蓝色短裙，裙摆末端漂浮着大量深蓝碎布料并向左延伸至布条处，其中夹杂着黄色人形布片。布条为青蓝色，上有白色点并渐变为两侧的白色虚线，又在中间有一排黄色的各种几何图案，从右肩开始缠绕着身体，缠绕身体的布条向下渐变为白色，图案也愈发复杂，右胸前图案类似于“全视之眼”。布条在裙子左侧化为蛇状，蛇头恰好衔住最开始的黄色人形布片。\n裸足。\n",
    relationships: "维缦与磐永阿梨夜是以浅间净秽山为本殿的神社所祭祀的两尊祭神。[锦上京]\n"
  },
  {
    id: "Watatsuki no Toyohime，",
    name: "绵月丰姬",
    alias: [],
    introduction: "绵月丰姬是东方Project的官方角色，首次登场于东方儚月抄。\n她与妹妹绵月依姬同为月之公主和月球的防卫队的首领，该防卫队被称呼为“月之使者”[儚月抄小说6话]。此外，丰姬还是浅间净秽山的管理人。\n她待人态度和蔼，头脑聪慧，学识渊博，说话风趣[儚月抄小说6话]。\n在儚月抄之后，丰姬还作为五面Boss登场于东方锦上京中，在官方出版物中则几乎再未出场过。\n",
    lifestyle: "丰姬是生活在月之都的月之民。月之都是相当完善的都市，物质生活和技术水平都相当高，丰姬等月之民生活的重心便是提高精神上的充足感[儚月抄小说3话]。丰姬平时或是读书或是散步，一个人过着自由的生活[儚月抄小说6话]。\n绵月家的职责是监视地上，包括被流放到地上的有罪或沾染污秽的月之民[儚月抄小说3话]。这一工作需要绵月家饲养的月兔即月之使者执行，丰姬作为月之使者的首领，负责连接通往地上的道路以及引导使者兔[儚月抄小说3话]。\n丰姬作为能自由往来于山海之间的月之民，还是浅间净秽山的管理人，负责保障浅间净秽山将污秽无害化，以维系月之都的永恒。\n",
    abilities: "丰姬拥有连接山海程度的能力，是月之都少数掌握该能力的人[儚月抄小说6话]。\n除此之外，她还使用着以月之都科技制造的道具。\n",
    appearance: "绵月丰姬有着一头黄色及肩长发，前额梳着中分的刘海，略卷，戴着白色礼帽，帽檐左侧系着蝴蝶结，在设定画、锦上京中为紫色，在人妖名鉴中为粉色。在锦上京中，帽檐还有一圈三角形镂空。\n她的眼瞳在设定画中为左红右粉，在人妖名鉴中为金色，在锦上京中为红色。\n她上身穿着一件白色长袖衬衫，袖子能包住手掌，衬衫外面穿着紫色无袖连衣裙，仅左肩有带子将裙子固定在身上，右肩则完全露出。在锦上京中，裙摆有塔形锯齿。衬衫和围裙的前襟均有纽扣，围裙纽扣在红色设定画中为红色，在锦上京中为金色；在设定画、锦上京中从膝盖往下没有扣上，在人妖名鉴中则是从大腿往下都没有扣上。\n她腰间左高右低地系着一条棕色腰带，带有圆环套着“⊕”形图案式样的金色饰品，在锦上京中腰带上有金色祥云状图案。\n她在设定画中脚穿紫色短靴，在锦上京中脚穿白色短袜和红棕色短靴。\n",
    relationships: "丰姬的妹妹是绵月依姬，两人同为月之公主。\n八意永琳曾是绵月姐妹的师父，按人类的说法，两人分别是永琳外甥孙的妻子和外甥孙夫妇的儿媳[儚月抄小说1话]，绵月姐妹放弃搜索永琳已有好几百年[儚月抄]。\n丰姬曾瞒着永琳把水江浦岛子藏匿在月之都，后将其送回地面。[儚月抄小说3话]\n绵月姐妹是月之使者的首领，绵月家中饲养的兔子就是月之使者[儚月抄小说3话]。\n铃仙·优昙华院·因幡曾是绵月姐妹所属的士兵兼“宠物”，丰姬给她起名为“Reisen”[儚月抄漫画7话]。铃仙逃往地上后，绵月姐妹将一只受永琳之托前来送信的月兔作为士兵兼宠物收入麾下，给她也取名Reisen。\n作为浅间净秽山的管理人，丰姬管理着维缦·浅间，有权根据污秽量决定维缦的工作负荷。\n"
  },
  {
    id: "Watatsuki no Yorihime",
    name: "绵月依姬",
    alias: [],
    introduction: "绵月依姬是东方Project的官方角色，首次登场于东方儚月抄。\n她与姐姐绵月丰姬同为月之公主和月球的防卫队的首领，该防卫队被称呼为“月之使者”[儚月抄小说6话]。\n在儚月抄之后，依姬几乎再未在官方作品中出场过。\n",
    lifestyle: "依姬是生活在月之都的月之民。月之都是相当完善的都市，物质生活和技术水平都相当高，依姬等月之民生活的重心便是提高精神上的充足感[儚月抄小说3话]。\n绵月家的职责是监视地上，包括被流放到地上的有罪的月之民[儚月抄小说3话]。这一工作需要绵月家饲养的月兔即月之使者执行，绵月依姬作为月之使者的首领，负责对战斗要员兔子们进行战术指导[儚月抄小说3话]。\n",
    abilities: "依姬拥有能够召唤神灵程度的能力，可以使神道教的神灵附体，以使用相应的能力。\n",
    appearance: "依姬有着一头紫色及肩短发（在设定画中略长一些），略卷，用黄色蝴蝶结系着高马尾。\n她有着紫色的眼瞳。\n依姬上身穿着白色短袖衬衫，领子边缘有黑色虚线，衬衫外穿着无袖棕红色连衣裙，仅右肩有带子将裙子固定在身上，左肩则完全露出。衬衫和围裙的前襟均有纽扣，围裙纽扣从大腿往下没有扣上，在设定画中为黑色，在人妖名鉴中为金色。\n她腰间右高左低地系着一条带有的粉色腰带，腰带右侧系着一个圆环套着长刀样式的金色饰品。\n她脚穿棕红色短靴，在人妖名鉴中上面有金色细线纹样。\n她右手抱着一部古书外形的电脑[人妖名鉴]，两只手腕上各戴着两个金镯子。\n",
    relationships: "依姬的姐姐是绵月丰姬，两人同为月之公主。\n八意永琳曾是绵月姐妹的师父，按人类的说法，两人分别是永琳外甥孙的妻子和外甥孙夫妇的儿媳[儚月抄小说1话]，绵月姐妹放弃搜索永琳已有好几百年[儚月抄]。\n绵月姐妹是月之使者的首领，绵月家中饲养的兔子就是月之使者[儚月抄小说3话]。\n铃仙·优昙华院·因幡曾是绵月姐妹所属的士兵兼“宠物”，被二人称为Reisen。铃仙逃往地上后，绵月姐妹将一只受永琳之托前来送信的月兔作为士兵兼宠物收入麾下，依然称其为Reisen。\n"
  },
  {
    id: "Kurumi",
    name: "胡桃",
    alias: [],
    introduction: "暂无相关资料",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Mai",
    name: "舞",
    alias: [],
    introduction: "\n",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Elly",
    name: "艾丽",
    alias: [],
    introduction: "\n",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Flandre Scarlet",
    name: "芙兰朵露·斯卡蕾特",
    alias: [
      "芙兰朵尔·斯卡雷特",
      "二小姐",
      "芙兰",
      "二妹",
      "破坏之神",
      "吸血鬼姐妹"
    ],
    introduction: "芙兰朵露·斯卡蕾特是东方Project系列中的官方角色，首次登场于东方红魔乡，担任红魔乡的EX面Boss。\n她是蕾米莉亚·斯卡蕾特的妹妹，与蕾米莉亚一样是居住在红魔馆的吸血鬼。\n平常并不太易怒，但精神有些问题。\n在红魔乡之后，芙兰朵露还作为自机&敌机登场于东方刚欲异闻中，在官方出版物中也偶有出场。\n",
    lifestyle: "芙兰朵露生活在红魔馆的地下室里，在红雾异变前的495年间从未外出过[红魔乡]，如今也极少外出红魔馆[史纪]。\n虽然红魔馆的其他人因为芙兰朵露拥有危险的能力和精神有些问题[红魔乡设定文档]而限制她离开红魔馆，但其实芙兰朵露是觉得住着挺舒服才老实地待在红魔馆里[智灵奇传]。\n",
    abilities: "芙兰朵露拥有将一切悉数破坏程度的能力。\n作为吸血鬼，芙兰朵露还拥有吸血鬼超越常人的身体能力[史纪]。\n",
    appearance: "芙兰朵露属于身高低[ZUN的邮件答复]的角色，身高和姐姐蕾米莉亚差不多[史纪]。\n她有着一头浅黄色齐肩短发，略卷，左侧扎着更长一些的侧马尾。头戴形似门把手套的睡帽，装饰着红色缎带，左侧系成蝴蝶结，侧马尾从蝴蝶结下帽子的洞中穿出。\n她有着红色眼瞳。\n她上身穿着红色马甲，领子打着数层白色褶子，内穿白色短袖。胸前系着黄色领巾。在求闻史纪和人妖名鉴中，手腕上有红色腕带。\n她背后长着一对散发着七色不可思议之光的翼，有着其它生物、妖怪、幽灵无法想象的奇怪扭曲形状[史纪]。在红魔乡中，两翼上各挂着8个彩色结晶，晶体由里到外的颜色顺序为：天蓝，蓝，紫，粉，橙，黄，浅绿和天蓝。在其他作品中，晶体数量均少于8对，且颜色也有差异。\n她下身穿着红色短裙，有白色褶边。在求闻史纪中则穿超短裙。在刚欲异闻中则是在里面穿白色带褶边短裙，外面在两侧披着红色布料，布料在下端有一圈白线，还在腰间系着一条粉色带子，在身后垂下。\n她穿着白色短袜和白色脚环，在求闻史纪中脚穿短靴，在人妖名鉴中脚穿棕色玛丽珍鞋。\n她在红魔乡、求闻史纪、刚欲异闻中手持一根S形的棒子，两端像扑克牌中的黑桃，在刚欲异闻中前端黑桃后面系着红色蝴蝶结。\n",
    relationships: "芙兰朵露是蕾米莉亚·斯卡蕾特的妹妹，喜欢蕾米莉亚姐姐[红魔乡设定文档]，但很少见到她和姐姐蕾米莉亚在一起[史纪]。\n平日里与蕾米莉亚一起受女仆长十六夜咲夜的照顾。\n帕秋莉·诺蕾姬受蕾米莉亚之托照看芙兰朵露，防止芙兰朵露外出[红魔乡]。\n芙兰朵露曾受摩多罗隐岐奈的委托，通过隐岐奈的门和其他角色对战来训练，最后到石油之海寻找饕餮尤魔将其击败。[刚欲异闻]\n"
  },
  {
    id: "Soga no Toziko",
    name: "苏我屠自古",
    alias: [
      "大根"
    ],
    introduction: "屠自古是东方Project系列中的官方角色，首次登场于东方神灵庙，担任神灵庙的五面道中Boss。\n她是亡灵，因为抱有怨恨，性质是怨灵，她的能力也与此有关。\n她为人粗野豪爽，容易心软，也容易生气。[口授]\n她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "在上了物部布都的当后，屠自古以亡灵的形态生活在神灵庙，服侍着丰聪耳神子。\n尽管出身于崇佛的苏我氏，但她却很厌恶佛教[神灵庙设定文档]。\n",
    abilities: "屠自古拥有引发雷电程度的能力。\n",
    appearance: "屠自古有着一头绿色齐脖卷发，头戴黑色冠帽，帽子后侧扎着丝带，前侧贴着蓝边白底长贴。\n她有着绿色的眼瞳。\n她身穿深绿色长袖连衣裙，领子为白色，胸前有两组蓝色扣子，用白线连成叉形。袖口打着白色褶子，裙摆上贴着许多蓝边白底长贴。\n她身下没有腿，而是有两条白色的灵体。\n",
    relationships: "屠自古与物部布都一起侍奉丰聪耳神子。\n在围绕佛教的战争中，屠自古本与布都属于敌对的两方，却因为布都的号召转而在暗中帮助她。后来，布都把屠自古用于寄托身体的壶掉包成了一个未经烧制的壶，使屠自古失去肉体变为亡灵[口授]，将屠自古玩弄于股掌之中。\n然而，屠自古和布都关系却很好，两人甚至是互帮互助的好伙伴。\n她很厌恶佛教，因此对命莲寺十分厌恶。\n"
  },
  {
    id: "Sokuratesu",
    name: "苏格拉底",
    alias: [],
    introduction: "暂无相关资料",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Wakasagihime",
    name: "若鹭姬",
    alias: [
      "人鱼"
    ],
    introduction: "若鹭姬是东方Project系列中的官方角色，首次登场于东方辉针城，担任辉针城的一面Boss。\n她是淡水中的人鱼，性格稳重，对人类也没有任何敌对心理，乃至于今泉影狼评价她“性格软弱到连个虫子都杀不死”[东方辉针城]。因为被万宝槌魔力影响，一度变得慷慨激昂，在被教训后重新变得温顺。\n她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "若鹭姬平常就是唱唱歌、捡捡石头，过着平稳的生活。[辉针城设定文档]\n",
    abilities: "若鹭姬拥有在水中力量会增加程度的能力。\n而在弹幕狂们的黑市中，通过若鹭姬的能力卡能游到一个只有小鱼知道的异世界而实现短时间无敌。[弹幕狂们的黑市]\n",
    appearance: "若鹭姬有着一头深蓝色及肩短发，在两鬓处有螺旋状卷发，长着白色鳍形耳朵。\n她有着深蓝色的眼瞳。\n她身穿从上到下由深绿色过渡到灰色的和风长袖裙子，打着白色褶子，衣服上有白色叶子状花纹，用金色绳子绑着紫色腰带，在右侧系成蝴蝶结。\n没有腿，长着一条淡蓝色的鱼尾。\n",
    relationships: "若鹭姬与今泉影狼是在互助组织“草根妖怪网络”上认识的[辉针城]友人。\n"
  },
  {
    id: "Ibaraki Kasen",
    name: "茨木华扇",
    alias: [
      "茨华仙",
      "仙人"
    ],
    introduction: "茨木华扇是东方Project系列中的官方角色，通称“茨华仙”，首次登场于东方茨歌仙，担任茨歌仙的主要角色。\n她是仙人，在东方茨歌仙第四十九话下中明确揭示了她是鬼的事实。她自称成为仙人的目的“只是想要接近人类”[茨歌仙18话]。\n她言谈举止柔缓和婉，对人类和妖怪都温柔对待[香霖堂]，但非常爱说教[茨歌仙1话]。\n在茨歌仙初登场之后，华扇又作为自机登场于格斗作东方深秘录和东方凭依华中，在其他官方出版物中也时有出场。\n",
    lifestyle: "尽管华扇被认为住在妖怪之山中[茨歌仙1话]（她也会如此自称）[茨歌仙42话]，但严格来说她居住于自己仙界内的茨华仙邸。\n她在仙界里饲养着自己的宠物们，并且会派它们办事，乃至在战斗中役使它们。\n经常到博丽神社指导与帮助博丽灵梦的工作。\n厌恶怨灵，常常毫无缘由地将怨灵捏爆。\n尽管身为仙人，却放出接近于常人的气场。[凭依华]\n",
    abilities: "华扇拥有引导动物程度的能力。\n丰聪耳神子能从华扇身上感受到远超自己的强大力量。[茨歌仙18话]\n作为仙人会使用仙人的法术，也开辟了自己的仙界。[茨歌仙46话]\n华扇有一定的感知与操纵结界和间隙的能力。\n她被封印的右臂茨木童子之臂中寄宿着鬼的邪气，能够幻化出形貌。[茨歌仙50话]\n设定中也将其称作影华扇、影之茨华仙。[茨歌仙设定资料图]\n华扇拥有的酒器“茨木的百药枡”（简称“百药枡”），把酒倒入其中后喝下去可以治疗疾病和伤势，还可以使健康人获得怪力，但代价是性格在一段时间内会变得和鬼一样，并且有伤病的人在治疗后身体本身也会逐渐变成鬼。[茨歌仙16话]\n",
    appearance: "华扇有着一头过肩粉色短发，头上用两个白色布套包成双丸子头以隐藏作为鬼特征的角。\n她有着粉色的眼瞳。\n她上身穿着白色短袖，袖口用红线系住，边缘为很长的锯齿状。\n她身前披着深红色及膝挂巾，边缘为金色，上面有金色麦穗状图案，胸口有一朵粉色牡丹花，在深秘录、凭依华中还带有萼片。\n她下身穿着绿色及膝裙，边缘有一圈虚线，在深秘录、凭依华中为深红色，在人妖名鉴中为深绿色。\n她脚穿船鞋，脚腕系着腕带，在深秘录、凭依华中为红色，在人妖名鉴中为黑色。\n她左手手腕戴着镣铐，连着断了的锁链，整个右臂均为绷带缠成的空壳。\n",
    relationships: "华扇经常到博丽神社指导与帮助博丽灵梦的工作，甚至使灵梦很烦她。\n尽管并非负责华扇的死神，小野塚小町却常去华扇的家茨华仙邸，把茨华仙邸当成用来休息的秘密基地[茨歌仙46话]。\n与伊吹萃香、星熊勇仪同为“山之四天王”[茨歌仙49话下]。\n自发监视[凭依华]着宇佐见堇子，为此而与堇子交好。\n二人常常在香霖堂见面。[新香霖堂2话、茨歌仙34话]\n八云紫将华扇视为自己“这边的人”，认为华扇与自己理念一致，但华扇并不承认。[茨歌仙]\n华扇很早就认识了摩多罗隐岐奈，并且很清楚隐岐奈的性格和思想。[茨歌仙42话]\n华扇饲养了很多动物，包括：竿打（大鹫）、久米（大鹫）、黄帝（龙）、彭祖（老虎）、务光（雷兽）。\n"
  },
  {
    id: "Wriggle Nightbug",
    name: "莉格露·奈特巴格",
    alias: [],
    introduction: "莉格露·奈特巴格是东方Project系列中的官方角色，首次登场于东方永夜抄，担任永夜抄的一面Boss。\n她是萤火虫妖怪，身边总会围绕着很多虫子。[永夜抄设定文档]\nZUN感觉莉格露有点傻，认为她去和琪露诺那样的玩刚刚好。[永夜抄]\n她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "莉格露生活场所不明，总是伴随着一大群虫子出现，主要活动在草丛之类的地方。[求闻史纪]\n",
    abilities: "莉格露拥有操纵虫子程度的能力，使用各种虫子作为弹幕。\n",
    appearance: "莉格露拥有着幼小少女的形态，外表和人类小孩相似[求闻史纪]。\n她有着一头齐脖短发，在永夜抄中为蓝绿色，在人妖名鉴中为绿色。头上长着昆虫样的触角。\n她有着蓝绿色的眼瞳。\n她上身穿着白色长袖衬衫，身后披着一件像是虫翅膀的外黑内红的披风，披风在求闻史纪中被直接称为翼[求闻史纪]。\n在永夜抄和人妖名鉴中，她下身穿着蓝色的及膝灯笼裤，在求闻史纪中则穿着短裤。\n她脚穿松垮的白色短袜和皮鞋，皮鞋在永夜抄中为红色，在人妖名鉴中为黑色。\n",
    relationships: "暂无相关资料"
  },
  {
    id: "Lyrica Prismriver",
    name: "莉莉卡·普莉兹姆利巴",
    alias: [
      "骚灵三妹",
      "键盘手",
      "骚灵三姐妹"
    ],
    introduction: "莉莉卡·普莉兹姆利巴是东方Project系列中的官方角色，首次登场于东方妖妖梦，担任妖妖梦的四面Boss。\n她是蕾拉·普莉兹姆利巴创造的骚灵，是吵闹、喜欢举办音乐会的灵体。\n她的性格在三姐妹之中最像人类，因而交谈也比较容易。但是，她也更狡猾世故，只想着用最小程度的气力去获得最大程度的利益。她精神又聪明，态度和行为都计算到了三步以后[妖妖梦角色设定]。\n在妖妖梦之后，莉莉卡还作为自机登场于东方花映塚中，在官方出版物中则登场次数不多。\n",
    lifestyle: "莉莉卡生活在雾之湖附近的废弃洋馆中。\n她在普莉兹姆利巴乐团解散前是普莉兹姆利巴乐团的一员，在乐团中负责演奏键盘和打击乐，常被邀请去妖怪们的聚会进行演出[史纪]。\n普莉兹姆利巴乐团解散后三姐妹均加入堀莉兹姆利巴乐团，莉莉卡负责键盘。\n她平时教唆姐姐们而自己不去战斗。[妖妖梦角色设定]\n她的乐器是普莉兹姆利巴乐团中最有活力的。[史纪]\n",
    abilities: "莉莉卡拥有不用双手操控就能演奏乐器程度的能力和演奏幻想之音程度的能力，能演奏这个世界所没有的幻想之音。\n",
    appearance: "莉莉卡属于身长低[ZUN的邮件答复]的角色，身高在三姐妹中最矮，体格在三姐妹中最小，外表和人类没有区别[史纪]。\n她有着一头淡棕色齐肩短发，头戴红色圆锥形帽子。帽子边缘折回且打着白色褶子，还有一条黑色条纹；前端有一条裂口，顶端有绿色星形装饰。\n她有着棕色的眼瞳。\n她上身穿着白色的衬衫和红色的马甲。马甲上扣着绿色圆珠扣子，领子边缘打着白色褶子。\n她下身穿着与另外两位姐妹不同的红色荷叶边裙裤。马甲的下摆、裙子的末端、领子边缘的褶皱上同样各有一条黑色条纹。马甲和裤子的黑色条纹上方各有一圈白色折线与点形图案。\n她脚穿白色短袜，在妖妖梦立绘中不穿鞋，在妖妖梦小人图和花映塚中穿缀有绿色圆珠的红色皮鞋，在凭依华和人妖名鉴中穿没有圆珠的红色皮鞋。\n她身旁经常悬浮着一把键盘乐器，刻着白色的名字缩写“L.P.”，据说是某著名艺术家使用过的、因为发出的声音过于独特不畅销而消失的合成器的幽灵[史纪]，但不知真假。\n莉莉卡的2P色，将红色改为绿色，绿色改为蓝色，黑色改为白色。\n",
    relationships: "莉莉卡是骚灵三姐妹中的三女，露娜萨·普莉兹姆利巴、梅露兰·普莉兹姆利巴的妹妹。也是三人组成的普莉兹姆利巴乐团的一员。\n在普莉兹姆利巴乐团解散后三姐妹均加入堀莉兹姆利巴乐团，以堀川雷鼓为队长。[文果真报]\n"
  },
  {
    id: "Lilywhite",
    name: "莉莉霍瓦特",
    alias: [
      "莉莉白",
      "莉莉怀特",
      "白莉莉",
      "莉莉",
      "莉莉黑"
    ],
    introduction: "莉莉霍瓦特是东方Project系列中的官方角色，首次登场于东方妖妖梦，担任妖妖梦的四面道中Boss。\n她是运送春天的妖精。\n她作为妖精危险度并不高，也并不好战[史纪]。\n她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "莉莉的住处不明。常常从西边飞来，到妖怪之山那边去。[求闻史纪]\n在春天来临之际能觉察到普通人未注意到的细节，将春天即将来临的消息传递给还在冬眠的生物，在春天以外的时候则很少被人们见到。[求闻史纪]\n不能在春天以外的季节自由行动，因此会积攒压力。[GoU]\n据说她是个小富豪，出现时身上带着大量金钱和弹币。[弹幕狂们的黑市]\n",
    abilities: "莉莉拥有告知春天已经来临程度的能力。\n莉莉非常弱，也就拥有比杂鱼强点程度的能力[妖妖梦设定文档]。\n作为妖精是不会死[史纪]的。\n",
    appearance: "莉莉身高颇低[史纪]。\n她有着一头金发，在求闻史纪中过肩，在人妖名鉴中及腰，头戴白色圆锥形帽子，边缘折回并有红色折线图案。\n她的瞳色没有表现。\n她身穿宽袖过膝连衣裙（也可能是上衣下裙结构)，上身披着白色披肩，在人妖名鉴中披肩、裙摆和袖口边缘有红色折线图案，在求闻史纪中仅裙摆有红色折线图案，袖口边缘有一圈红色直线图案。\n她身后长着一对白色透明的大型翅膀，分为数枚薄翅。\n她脚穿白色短靴，边缘外折。\n莉莉也会cos成四季映姬·夜摩仙那度[枯萎广播]，此时她的衣着改为黑色，原红色图案颜色不变。在人妖名鉴中，cos四季时穿的短靴改为淡粉色，帽子上没有图案，右靴和帽子上各有一个粉红色蝴蝶结。\n",
    relationships: "暂无相关资料"
  },
  {
    id: "Kudamaki Tsukasa",
    name: "菅牧典",
    alias: [
      "管狐",
      "阿典"
    ],
    introduction: "菅牧典是东方Project系列中的官方角色，首次登场于东方虹龙洞，担任虹龙洞的五面、六面、EX面道中Boss。\n她是管狐，能使听从她的建议的人得到一时金钱上的恩惠和最终的毁灭性结局。\n在虹龙洞之后，典还作为自机登场于东方兽王园中，在官方出版物中则几乎再未出场过。\n",
    lifestyle: "典作为饭纲丸龙的助手，和龙一起生活在妖怪之山上，主要作为龙的使者负责各方的交涉。\n",
    abilities: "典拥有抓住灵魂弱点乘虚而入程度的能力。\n作为管狐，典能使听从她建议的人得到金钱上的恩惠，且一定伴随毁灭性的结局。\n典还可以役使作为她眷属的管狐，让它们附身他人[兽王园]，她以此构建出了强大的情报网。\n",
    appearance: "典有着一头黄褐色及肩短发，留着长长的刘海，长着一对同样为黄褐色的狐耳，耳朵尖端为白色。\n她有着金色的眼瞳。\n她身穿白色衣服，上下一体，样式类似于越南长袄。领口用绿色绳子系着一个蝴蝶结，袖口、大腿的裤口用绿色绳子系成蝴蝶结收紧扎住。左腿部分的衣服上有浅绿色植物状图案。\n她脚穿白色足袋，不穿鞋。\n虹龙洞中，她左手拿着一个塞上的试管，右手摆出狐狸的手势。兽王园中，她右手持三个试管，里面液体分别为红色，绿色与紫色。\n",
    relationships: "典是饭纲丸龙可靠的助手，主持龙和天弓千亦之间的交涉，还向姬虫百百世作出指示。龙、千亦和百百世都对典信赖备至，找典询问各种意见，因此都得到了金钱上的恩惠。而千亦和百百世不得不与自机战斗，也是缘于她的教唆。\n"
  },
  {
    id: "Kikuri",
    name: "菊理",
    alias: [],
    introduction: "暂无相关资料",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Sariel",
    name: "萨丽爱尔",
    alias: [
      "萨丽艾尔"
    ],
    introduction: "暂无相关资料",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Sara",
    name: "萨拉",
    alias: [
      "沙罗",
      "莎拉"
    ],
    introduction: "\n",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Houraisan Kaguya",
    name: "蓬莱山辉夜",
    alias: [
      "NEET",
      "竹取姬",
      "公主大人"
    ],
    introduction: "蓬莱山辉夜是东方Project系列官方作品中的官方角色，首次登场于东方永夜抄，担任永夜抄六面Final B的Boss。\n辉夜就是「竹取物语」里面登场的那位“辉夜姬”。[人妖名鉴]\n她是月之公主，永远亭的主人，拥有操纵永远和须臾的能力。\n来到地面后，通过学习她对地上的知识已经有一些了解，但是也有展示出不足的一面。[儚月抄]\n她性格就是像二次创作里常见的那种宅家少女的形象，有着对外界没有兴趣的大小姐气质。[幻想巡礼]\n在永夜抄之后，辉夜在之后的官方游戏与出版物中时有出场。\n",
    lifestyle: "辉夜在被流放到地上前曾居住在月之都，在杀死月之使者后的一千多年里隐居在迷途竹林内的永远亭中，如今不再隐居，过着普通的生活[永夜抄设定文档]。\n她每年都会举行一次月之都博览会“月都万象展”[史纪]，展示各种关于月之都的物品和资料甚至月兔捣年糕表演，大受好评。\n为了打破无事可做的无聊生活，她把养护盆栽当成了自己的工作[儚月抄]。\n她会在藤原妹红带路下定期溜出永远亭[智灵奇传]到人类村落游玩。\n",
    abilities: "辉夜拥有操纵永远和须臾程度的能力。\n她由于服下了蓬莱之药[儚月抄]而不老不死，同时会产生和人类同样的污秽[儚月抄]。具体效果请参照相关考据。\n辉夜拥有许多宝物，也喜欢向人展示她所收藏的奇珍异宝。\n",
    appearance: "辉夜有着一头黑色及膝长发，留着姬发式，刘海过眉。\n她有着黑色的眼瞳。\n她上身穿着粉色和风上衣，胸前用白色丝带扎着领结，衣服扣子是一排白色小领结。两袖长到能藏住手，上有橙黄色图案，左袖为遮住月亮的云，右袖为花札“芒与月”。\n她下身穿着深红色和风长裙，裙摆拖到地上，并有白色荷叶边。裙子上有金色的樱花、竹子、枫叶、梅花的描边图案。\n她脚穿白色短袜和皮鞋，袜口打着褶子。\n在永夜抄中，身边从脚下起按顺时针顺序依次围着燕的子安贝、蓬莱玉枝、佛的御石钵、火鼠的皮衣和龙颈之玉。\n",
    relationships: "八意永琳是辉夜的侍从，她们的交往始于辉夜还在月球居住的时候[永夜抄]。两人一起杀害月之使者，之后永琳为她修建了永远亭[儚月抄]，两人一起居住其中。\n铃仙·优昙华院·因幡是辉夜的宠物，辉夜为她起了“因幡”（イナバ）的爱称，但其实辉夜管所有兔子都这么叫[永夜抄]。\n藤原妹红视辉夜为仇敌，因为使妹红无法死亡的蓬莱之药就是辉夜留下的。两人的日常就是互相厮杀，互相使绊子，两人都乐在其中。\n"
  },
  {
    id: "Layla Prismriver（官方资料未给出拼写，",
    name: "蕾拉·普莉兹姆利巴",
    alias: [],
    introduction: "暂无相关资料",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Remilia Scarlet",
    name: "蕾米莉亚·斯卡蕾特",
    alias: [
      "蕾米莉雅·斯卡雷特",
      "大小姐",
      "蕾咪",
      "大妹",
      "威严",
      "抱头蹲防",
      "吸血鬼姐妹"
    ],
    introduction: "蕾米莉亚·斯卡蕾特是东方Project系列中的官方角色，首次登场于东方红魔乡，担任红魔乡的六面Boss。\n她是居住在红魔馆的吸血鬼，是红魔馆的主人。\n她像小孩子一样幼稚任性，并且拥有旺盛的好奇心。同时也十分的高傲、傲慢，自认为没有比她更厉害的存在。[史纪]\n在红魔乡之后，蕾米莉亚还作为自机登场于东方萃梦想、东方永夜抄、东方绯想天、东方非想天则中，在官方出版物中也时有出场。\n",
    lifestyle: "蕾米莉亚居住在红魔馆中。\n作为吸血鬼，她一般在夜晚活动，散步、赏花或者开宴会。[史纪]\n而在白天，她一般会睡觉[萃梦想]，但偶尔会打着阳伞出门[史纪]。\n她讨厌雨天[绯想天]和晴天[绯想天]，这样的天气会阻碍她的出行。\n她喜欢喝红茶[萃梦想]、吃纳豆[史纪、二轩目]，讨厌大蒜，沙丁鱼头之类，不过不怕十字架[永夜抄Manual]。接触炒豆会有被火烧的感觉。[文花帖（书籍）]\n她似乎不吃幻想乡的人类。[史纪]\n她喜欢谈论残忍血腥的东西。[茨歌仙16话]\n她以观看别人对自家门卫红美铃发起的挑战赛为乐。[史纪]\n",
    abilities: "蕾米莉亚拥有操纵命运程度的能力。\n她拥有吸血鬼族的强悍的身体能力。[萃梦想设定文档]\n她以蝙蝠和矢作为武器。[永夜抄Manual]\n她可以汇聚暗夜力量，用不是火的红色灵气（一说是吹起的气流）[|萃梦想]制造巨大的十字架攻击目标，据说如果盯着这样制造出的十字架看的话就会两眼充血辗转难眠。[GoM]\n她可以从指尖放出密度上更接近宝石的雾气。[文花帖（书籍）]\n她可以永远地活下去，但不会再继续生长。[永夜抄Manual]\n",
    appearance: "蕾米莉亚属于身长低[ZUN的邮件答复]的角色，外表年幼，看起来不满十岁；身高较低[史纪]。\n她有着一头及肩卷发，在红魔乡、永夜抄中为灰蓝色，在萃梦想、绯想天、非想天则中为蓝紫色，在人妖名鉴中为蓝色。头戴白色荷叶边洋帽，荷叶边底有一圈红色虚线图案，帽子上系着红色缎带，在红魔乡、萃梦想、永夜抄、史纪、儚月抄中位于右侧，在绯想天、非想天则、人妖名鉴中位于左侧。\n她有着红色的眼瞳。\n她身穿白色短袖连衣裙，裙摆及踝，领子边缘为红色，在红魔乡、永夜抄、史纪、儚月抄中还有三个红点，在萃梦想、绯想天、非想天则、史纪中袖子末端系着红色蝴蝶结。\n她背后有对比身高还要大[史纪]的蝙蝠翅膀，指为黑色，翼膜为白色。\n她后腰系着红色大蝴蝶结，蝴蝶结边缘有一圈白色细线。\n她在史纪中裸足，在人妖名鉴中穿着带有红色蝴蝶结的白色船鞋。\n在萃梦想、史纪、人妖名鉴中，她手腕带着红色腕带，有着白色荷叶边，手戴白色手套。\n",
    relationships: "蕾米莉亚是芙兰朵露·斯卡蕾特的姐姐，但很少见到两人在一起[史纪]。\n蕾米莉亚是十六夜咲夜的主人，并赐予了她“十六夜咲夜”之名[ZUN的邮件答复]，咲夜发誓要效忠于蕾米莉亚[永夜抄]。\n帕秋莉·诺蕾姬是蕾米莉亚的好友，二人会亲切地互以昵称“蕾米”“帕琪”相称，帕秋莉经常纵容蕾米莉亚的任性要求。\n因为性格的缘故，蕾米莉亚对所有人友好度都很低[史纪]，并且经常对身边人提出任性的要求。\n"
  },
  {
    id: "Letty Whiterock",
    name: "蕾蒂·霍瓦特洛克",
    alias: [
      "⑨妈"
    ],
    introduction: "蕾蒂·霍瓦特洛克是东方Project系列官方作品中的角色，首次登场于东方妖妖梦，担任妖妖梦的一面Boss。\n她是只能在冬天见到的妖怪，是雪女的一种。\n她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "蕾蒂只在冬天出现，且都是在极寒冷的天气出现，出现时会高兴地飞来飞去，造成大骚动。\n到春天她就会马上躲在太阳完全晒不着的地方睡过春夏秋三个季节[文花帖（书籍）]，直到下个冬天。\n只要是冬天她就会很幸福，而春天则令她感到忧郁。[妖妖梦设定文档]\n",
    abilities: "蕾蒂拥有操纵寒冷程度的能力。\n她的实力不明，虽然ZUN曾说如果她全力施为，会引起异变的（比如红雾异变，春雪异变）[亚特兰大AWA座谈会]，但她也曾被博丽灵梦殴打至不省人事[文花帖（书籍）]。\n",
    appearance: "蕾蒂看起来是个穿着不像是能防寒的轻便衣服的少女形象[求闻史纪]，属于身长较高[ZUN的邮件答复]的角色。\n她有着一头淡粉色及肩短发，略卷。头戴白色帽子，右侧折起。\n她有着蓝色的眼瞳。\n她上身穿着白色长袖和蓝紫色短背心，后面披着白色披风，胸前别着一个“Ψ”形的胸针。\n她下身穿着蓝紫色裙子，有白色褶边。裙子外穿白色围裙，里穿低于裙摆的灯笼裤。\n她在妖妖梦和人妖名鉴中脚穿白色三折袜，在求闻史纪中穿着白色中靴。\n",
    relationships: "暂无相关资料"
  },
  {
    id: "Huziwara no Mokou",
    name: "藤原妹红",
    alias: [
      "爷们红",
      "不死鸟",
      "蘑菇炭",
      "蘑菇汤"
    ],
    introduction: "藤原妹红是东方Project系列中的官方角色，首次登场于东方永夜抄，担任永夜抄的EX面Boss。\n她原是贵族家的女儿，因服用蓬莱山辉夜留下的蓬莱之药而成为不老不死的人类。在再次遇到辉夜后开始了与辉夜无尽的厮杀日常。\n在永夜抄之后，妹红还作为自机在东方深秘录和东方凭依华出场，在官方出版物中也时有出场。\n",
    lifestyle: "妹红会护送在迷途竹林迷路的人回到人类村落。如果拜托她担任在迷途竹林的护卫一定会答应，她喜欢听拜托者讲家族的事，但过程中自己却沉默寡言[史纪]。\n她居住在隐藏于迷途竹林的小家中[儚月抄]。\n从约四百年前[儚月抄]开始，与蓬莱山辉夜厮杀成为她的日常，她们在相互死斗中找到乐趣。\n她会到永远亭里赏月，但在不和里面的人玩。[深秘录]\n",
    abilities: "妹红自从服用蓬莱之药后，就拥有了不老不死程度的能力。\n由于活了很久，她身上有各种妖术，据说能和妖怪势均力敌。[史纪]\n她能够在某种程度上操纵火焰，有许多以不死鸟、火焰为主题的符卡。\n",
    appearance: "妹红有着一头白色及踝长发。头发扎着许多蝴蝶结，脑后扎着一个大蝴蝶结，蝴蝶结均为红白相间的颜色。\n她的眼瞳为红色。\n在永夜抄中，她上身穿着米色长袖衬衫，两袖大臂处各绑着一条红色带子。在求闻史纪中，她上身穿着白色长袖衬衫。在儚月抄、深秘录、凭依华和人妖名鉴中，她上身穿着白色短袖衬衫。\n她下身穿着类似贯袴的红色长裤，用背带吊着。在永夜抄、求闻史纪、人妖名鉴中，裤子上贴着许多白底红纹符纸。在深秘录、凭依华中，裤子上打着许多白色补丁[凭依华]。\n她脚穿红色鞋子，鞋上各有一个蝴蝶结，在永夜抄中为白色，边缘为红色；在儚月抄中为红色，在人妖名鉴中为白色。\n妹红在服下蓬莱之药之前，头发为黑色及肩短发，身穿白色和服。\n",
    relationships: "妹红与蓬莱山辉夜是仇敌，因为使妹红无法死亡的蓬莱之药就是辉夜留下的。两人的日常就是互相厮杀，互相使绊子，两人都乐在其中。\n她与上白泽慧音是挚友。慧音是为数不多的妹红的理解者[儚月抄]。\n她是普莉兹姆利巴乐团的粉丝。[凭依华]\n"
  },
  {
    id: "Saigyouji Yuyuko，",
    name: "西行寺幽幽子",
    alias: [],
    introduction: "西行寺幽幽子是东方Project系列中的官方角色，首次登场于东方妖妖梦，担任妖妖梦的六面Boss。\n她是亡灵公主，西行寺家的大小姐，负责管理冥界的幽灵。\n她性格开朗，而且给人呆呆的感觉[永夜抄Manual]，十分慢性子[史纪]，相当无法捉摸[萃梦想角色介绍]，任性妄为。她行事轻浮[永夜抄角色设定]，整天游手好闲，看不出所想的事情，总是做出让人很困扰的行动，却是一个真心爱着幻想乡之外的这个国家的爱国者[萃梦想设定文档]。不过，尽管她看上去糊涂，但是她的言行举止从容冷静[绯想天角色介绍]。\n在妖妖梦之后，幽幽子还作为自机登场于东方永夜抄、东方萃梦想、东方绯想天、东方非想天则中，作为一面Boss登场于东方神灵庙中，在官方出版物中也时有出场。\n",
    lifestyle: "幽幽子已经以亡灵的姿态存世千年以上，也将永远居住在冥界的白玉楼中。[史纪]\n她受阎魔之命，管理着冥界的幽灵。[史纪]\n她对人没有怨恨。\n",
    abilities: "幽幽子拥有操纵、统制死之后的幽灵的能力。\n幽幽子还拥有操纵死亡程度的能力。\n",
    appearance: "幽幽子属于身长较高[ZUN的邮件答复]的角色，样子和是人类时没太大差别，只是肌肤和发色变得有些淡薄[史纪]。\n她有着一头粉色短发，略卷，在妖妖梦、永夜抄、儚月抄、神灵庙、人妖名鉴中及肩，在求闻史纪、绯想天、非想天则中及胸。头戴蓝色ZUN帽，脑后有白色布料垂下，正前方系着天冠，上有红色魂状图案。\n她有着粉色的眼瞳。\n她身穿蓝色和服，上面有着大量白色荷叶边和蕾丝边装饰，在神灵庙中腰带和门襟处为黑色，在人妖名鉴中腰带为黑色，中间系着红色绳子，衣缝为白色，在其他作品中腰带为蓝色，门襟为白色。腰间左侧系着大蝴蝶结。除人妖名鉴外，和服上有着白色图案，几乎每一作都各不相同。\n在妖妖梦、永夜抄中，她穿着白色短袜和黑色玛丽珍鞋，鞋上有蓝色蝴蝶结，在妖妖梦中袜子口系着蓝色带子。在求闻史纪中，她裸足穿一双厚底木屐。在神灵庙中，她穿着白色泡泡袜和黑色鞋子。\n周围常常环绕着许多幽灵，在妖妖梦中一只幽灵拿着一条树枝，在永夜抄中一只幽灵提着一盏人魂灯。\n",
    relationships: "魂魄妖忌是西行寺家的第一代专属园艺师，在当了大概300年园艺师后顿悟而幽居。[妖妖梦]\n魂魄妖梦本来是幽幽子的剑术指导[永夜抄、花映塚]，在妖忌幽居后继承了他的职务，现在也是西行寺家的第二代专属园艺师兼幽幽子的护卫。幽幽子总是把有着认真性格的妖梦耍来耍去[萃梦想]。\n八云紫是幽幽子的故知，在幽幽子生前就认识她，也知道她以死封印西行妖。幽幽子见过紫发动并败北的幻想月面战争[儚月抄]。\n"
  },
  {
    id: "Goutokuzi Mike",
    name: "豪德寺三花",
    alias: [
      "大吉猫咪"
    ],
    introduction: "豪德寺三花是东方Project系列中的官方角色，首次登场于东方虹龙洞，担任虹龙洞的一面Boss。\n她是招财猫，但因为是三花猫而不是白猫而被歧视，于是离开招财猫社会。\n在虹龙洞之后，三花还作为Boss登场于弹幕狂们的黑市中，在官方出版物中则几乎再未出场过。\n",
    lifestyle: "三花在豪德寺因为毛色被歧视，有时被当作异类疏远，有时毛发险些被染为白色。\n由于她反倒主张身为三花猫有什么错，所以她被彻底排挤，未能进行招财猫的修行。\n最终她离开了招财猫社会，之后在妖怪之山过起了悠然自得的新生活。[虹龙洞设定文档]\n",
    abilities: "三花拥有招财或揽客程度的能力。\n",
    appearance: "作为三花猫，三花有着一头白、橙、棕三色相间的齐脖短发，头上长着一对外白内红的猫耳。\n她有着橙色的眼瞳。\n她上身穿着白色短袖，下摆很短，上衣有几块棕色或橙色的补丁，补丁上有许多白色圆点。脖子上系着黑色项圈与一个金色铃铛。\n她下身穿着外白内粉的超短裙，打着和上衣一样的许多补丁。\n裸足。\n她身后长着一条白、橙、棕三色相间的猫尾巴。\n她手腕上也系着与脖子上相同的项圈与铃铛。左手持小判金币，上面写着黑色的“千万両”。右手摆出招财猫的经典抬起姿势。\n",
    relationships: "暂无相关资料"
  },
  {
    id: "Yomotsu Hisami",
    name: "豫母都日狭美",
    alias: [],
    introduction: "豫母都日狭美是东方Project系列中的官方角色，首次登场于东方兽王园。\n她是黄泉丑女，会用甜言蜜语将不慎接近地狱的倒霉蛋拖入地狱，以此获得报酬。\n在兽王园之后，日狭美几乎再未在官方作品中出场过。\n",
    lifestyle: "日狭美通过甜言蜜语、和亡者约好瓜分将人拖入地狱而获得的报酬，诱导过量亡者进入地狱，导致堕入地狱的灵远远超过了预定的数量，因此被阎魔大人盯上。\n",
    abilities: "日狭美拥有令目标无处可逃程度的能力。\n",
    appearance: "尽管种族是“黄泉丑女”，但日狭美的称号为“地狱的美貌跟踪狂”，因此她并不丑，反而很美。\n她有着一头黑色及臀长发，戴着形似六倍利的头饰，头饰两边有紫色帘子。\n她有着紫色的眼瞳，但她的头饰遮住了半张脸，几乎完全盖住了眼睛。\n她身穿紫袍，形制类似高衩旗袍，上有叶子状花纹，自上到下有葡萄藤图案，袖口形似花瓣。\n她脚穿黑色中靴。\n她双手戴黑色中长手套，向前张开。\n",
    relationships: "日狭美单方面景仰着日白残无。\n"
  },
  {
    id: "Sekibanki",
    name: "赤蛮奇",
    alias: [
      "⑦"
    ],
    introduction: "赤蛮奇是东方Project系列中的官方角色，首次登场于东方辉针城，担任辉针城的二面Boss。\n她是辘轳首，但是是飞头类型还是伸长脖子类型的辘轳首并不确定，似乎都可以做到。\n她的自尊心有点高，与人类和妖怪都没法打成一片，否定流行文化，总给人一种高高在上的感觉。被万宝槌的魔力所影响时，变得洋洋自得。[辉针城设定文档]\n\n她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "赤蛮奇混在人类之间，独自生活在人类村落中。[辉针城设定文档]\n",
    abilities: "赤蛮奇拥有让头飞出去程度的能力。\n此外，她还可以从眼中射出激光。[天邪鬼]\n",
    appearance: "赤蛮奇有着一头红色齐脖短发，脑后戴着蓝色蝴蝶结缎带，缎带边缘有着红色刺绣。\n她有着红色的眼瞳。\n她上身穿着黑色长袖，边缘有着红色刺绣。外面穿着内蓝外红的披风，有着高高的领子遮住脖子，领子上有三个蓝色一字扣。\n她下身穿着红色短裙。\n她脚穿黑色短靴，靴筒有着一条红色线状图案，从靴后绕半圈。\n",
    relationships: "暂无相关资料"
  },
  {
    id: "Hecatia Lapislazuli",
    name: "赫卡提亚·拉碧斯拉祖利",
    alias: [
      "地狱的女神",
      "赫卡"
    ],
    introduction: "赫卡提亚·拉碧斯拉祖利是东方Project系列中的官方角色，首次登场于东方绀珠传，担任绀珠传的EX面BOSS。\n她是拥有三副身体，司掌月球、地球、异界三界地狱的神明。\n赫卡提亚的原型为希腊神话中的地狱女神、三相女神赫卡忒。\n她爽朗好战，对敌人毫不留情，但也有重视情义的一面。她处事冷静、善于谋划，能够根据情况随机应变，采取灵活的策略。她对于自己的力量充满自信，但是也会根据情况调整力度。\n在绀珠传之后，赫卡提亚在官方游戏和官方出版物中也时有出场。\n",
    lifestyle: "赫卡提亚在月球、地球、异界三界地狱中拥有身体，其核心的灵魂都在地狱，平时也居住在地狱中。\n她能够在不同的世界间自由穿越，也经常去往地狱以外的地方。\n她在是非曲直厅建立之前就已作为地狱的女神存在，游离于是非曲直厅的管辖之外，是地狱中一位强大的统帅者，对于阎魔和鬼神在地狱中建立组织和秩序的做法感到无所谓[东方文果真报]。\n敌视月之都，一度与纯狐联手攻击月之都。\n她喜爱地上的美丽与富饶，对幻想乡抱有好感，认为其充满魅力，打算友好相处[东方文果真报]，甚至会震慑觊觎幻想乡的敌人。\n她将部下克劳恩皮丝派入幻想乡，也不时会前来造访。\n",
    abilities: "赫卡提亚有着拥有三个身体程度的能力，她的三副身体同时存在于月球、地球、异界三界地狱中。\n除此以外，单论实力赫卡提亚也非常强大。\n",
    appearance: "赫卡提亚的整体形象显得怪异而滑稽，东风谷早苗还称她为“奇怪的T恤衫混蛋”[绀珠传]。\n她可以任意切换身体，不同的身体会在外貌上产生差异。当她以某一副身体登场的时候，头上会顶着对应的星球，需要切换身体的时候，会由另一个星球取而代之。\n她长发过肩，留着齐眉刘海。\n她脖子上系着黑色颈带，用金色锁链连接着三个缩小的星球，分别为地球、月球、异界。\n她上身穿着黑底敞肩的衬衣，衬衣上有“Welcome ❤ HELL”的图案，字母为白色、爱心图案为红色，此外还点缀着鲜红的花朵图案。\n她下身穿着带有黑色内衬的百褶短裙，从左至右依次分成绿色、红色、紫色三大块，上面还覆盖着一层黑色的方格花纹。\n平时裸足，在三月精V13话中她穿着靴子。\n",
    relationships: "赫卡提亚是地狱的女神，地狱妖精克劳恩皮丝是她的下属。她对皮丝的评价很高，也十分关心她的生存环境，让她离开地狱去往幻想乡也有这一层考虑。\n她在地狱的地位远高于四季映姬·夜摩仙那度，独立于是非曲直厅的管辖之外，被四季映姬称呼为地狱的一位统帅者[三月精V]。\n她与纯狐是意气相投的盟友，受到纯狐影响，因为太阳被击落导致地狱的黑暗减弱而憎恨嫦娥。\n她也非常敌视月之都的月之民，认为她们在各式各样的异世界的居民中，属于最恶劣的那一类[文果真报]。\n她认可摩多罗隐岐奈的头脑[东方三月精V]，隐岐奈也对她抱有敬意[GoU]。\n"
  },
  {
    id: "Michigami Nareko",
    name: "道神驯子",
    alias: [
      "埃及"
    ],
    introduction: "道神驯子是东方Project系列中的官方角色，首次登场于东方锦上京。\n她是道祖神，道祖神是以守护人类为使命的民间信仰的神明，能阻碍恶神和疫病的进入途径，被人类与地藏混同[口授]，此外还司掌亲事和出产[茨歌仙]。\n",
    lifestyle: "驯子被遗忘在圣域地底的祭坛之上，她不是地底金字塔的看守者，相反她被古人放置于此是为了阻拦某种东西离开金字塔，因此她将不能让任何人踏出金字塔作为使命。[锦上京设定文档]\n因为金字塔内外没有活物通过，她无聊至极，梦想着效仿那传说中的斯芬克斯，用难解的谜题撵走来访者。\n",
    abilities: "驯子拥有挡道拦路程度的能力。\n",
    appearance: "驯子有着一头深蓝色及腰长发，末端用金色发带扎成多个辫子，头戴金色发饰，上面刻着双体道祖神的形象。\n她有着深蓝色的眼瞳，眼角贴着深蓝色三角形贴纸，耳朵上戴着金色钥匙扣状耳环，一边挂着两把钥匙。\n她身穿短袖短裤的黄褐色热带探险服饰，肩批金蓝条纹相间的披肩，系着扣头为金色的黑色腰带，裤子上两边各有一个较大的裤兜。\n她穿着黑色过膝袜和黄褐色短靴，过膝袜边缘有金色的字母“X”“O”相间。\n她双手各持一根金色权杖，左手中的一端为圆圈一端为十字叉，右手中的一端弯曲为“？”状。\n",
    relationships: "暂无相关资料"
  },
  {
    id: "Rika",
    name: "里香",
    alias: [],
    introduction: "暂无相关资料",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Reisen Udongein Inaba",
    name: "铃仙·优昙华院·因幡",
    alias: [
      "铃仙·优昙华院·稻叶",
      "受兔",
      "大兔子"
    ],
    introduction: "铃仙·优昙华院·因幡是东方Project系列中的官方角色，首次登场于东方永夜抄，担任永夜抄的五面Boss。\n铃仙曾是月之都中绵月家的月兔，在四十多年前[儚月抄]人类开始向月球发动侵略战争时从月球逃走。在大约三十年前[儚月抄]逃到幻想乡，被蓬莱山辉夜收养。\n她的性格疯狂与悠闲并存，绝算不上温柔。她偶尔会表现出悠闲的一面，但战斗时和日常时的性格截然不同。她自信较少，很少配合人类，完全是自顾自的改变自己的性格[绯想天设定文档]。她的性格比较胆小随便，合作能力差[儚月抄]。\n在永夜抄之后，铃仙作为自机在官方游戏中多次出场，在官方出版物中也时有出场。\n",
    lifestyle: "铃仙作为蓬莱山辉夜的宠物居住在永远亭里，过着安稳的生活。\n她能对因幡天为下命令，被阿求认为是真正的兔子们的领袖[史纪]。\n她有时会伪装成药贩到人类村落卖药[铃奈庵]和维护村民们的药箱。卖完药后就会像避开人类似的消失在迷途竹林里[史纪]。\n",
    abilities: "铃仙作为月兔，拥有操作波长程度的能力和无视距离感知其他月兔发出的兔之波动（念波）的能力[永夜抄]，而且这两项能力都十分优秀，因而绵月依姬评价她有才能得多[儚月抄]。\n铃仙操纵波长的能力，体现为她可以操纵寄宿在事物之上的波[口授]。\n铃仙的操纵疯狂程度的能力需要靠前述的操纵事物波长的能力，还与寄宿在红色瞳孔中的巨量疯狂有关。\n她能感知其他月兔发出的兔之波动，可以借此与远方的月兔通信。\n铃仙还可以从食指发射子弹，而且子弹可以带有精神效果[符卡、必杀技Mind Explosion]。\n铃仙自称会分身术。[深秘录]\n相比于妖兽，铃仙移动较缓慢。[史纪]\n",
    appearance: "ZUN设计铃仙时有意表现出千篇一律毫无个性的感觉[人妖名鉴]。\n她有着别的兽类很少有的直立姿势[史纪]，和雾雨魔理沙差不多高，比博丽灵梦矮一点[秋例11对话]。\n她有着一头浅紫色及踝长发，头上有一对皱巴巴的、从中间开始弯折的长长的兔耳朵，看起来像是人造品，但其实是真的兔耳[秋例11对话]，且她同时长着人耳和兔耳[绀珠传结局图]。在永夜抄、花映塚、凭依华中，兔耳朵根部长有像纽扣一样的东西。\n作为白兔，她有着红色的眼瞳。\n她上身穿着白色衬衫，在花映塚中和穿外套时为长袖，其他作品中为短袖。打着红色领带，除永夜抄外的作品上面别着一个胡萝卜形状的领带夹，人妖名鉴中还别着一个兔子领带夹。在永夜抄、求闻史纪、儚月抄和人妖名鉴中她在衬衫外穿着黑色的制服外套，左侧有一个月牙形的胸针，现在已不再使用[秋例11对话]。在永夜抄中，外套口袋上露出白色手帕。\n她下身穿着短裙，在不同作品中有白色、红色、蓝色之别。\n她脚穿棕色皮鞋，在史纪中穿着白色过膝袜，在其他作品中脚穿白色短袜。\n她身后长着兔尾巴，在非想天则中为淡紫色，在深秘录、凭依华中为暗蓝色。\n在深秘录、绀珠传、凭依华中，她手持喇叭状枪械，枪口有兔耳装饰。\n铃仙的2P色，将红色改为黄色，白色改为黑色，领带夹也改为黑色。\n",
    relationships: "铃仙曾是绵月依姬和绵月丰姬的宠物，被丰姬起名为“Reisen”[儚月抄漫画7话]。\n现在她是蓬莱山辉夜的宠物，和其他兔子一样，被辉夜称作因幡。\n她十分尊敬八意永琳，拜永琳为师并称呼她“师父大人”。被永琳起了“优昙华院”的爱称，还会被亲热地叫作“优昙华”。\n她与因幡天为是同伴，理论上能命令天为但是天为并不怎么听她的。\n她与清兰和铃瑚曾是同属月之都的战友。\n"
  },
  {
    id: "Ringo",
    name: "铃瑚",
    alias: [],
    introduction: "铃瑚是东方Project系列中的官方角色，首次登场于东方绀珠传，担任绀珠传的二面Boss。\n她是月兔，曾是月之都的月兔士兵，现在则已叛逃地上。\n她有个性鲜明的时尚感，不在乎旁人眼光而喜欢离群。\n她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "在绀珠传前夕，铃瑚曾在月之都地面调查部队“Eagle Rabbit”服役，负责情报管理。这项职务仅负责调查，是一项很轻松等级却很高的闲职。在调查中她早已知道，现在以为自己所住的月之都，实际上是梦境。[绀珠传设定文档]\n在绀珠传后，她于人类村落路边开团子摊“铃瑚屋”，因味道胜过清兰而在与清兰屋的竞争中处于上风。[文果真报]\n",
    abilities: "铃瑚拥有吃团子越多变得越强程度的能力。\n此外，铃瑚能在身上藏大量团子[GoU]并在弹幕中将它们发射出去。\n",
    appearance: "铃瑚有着一头黄色齐脖短发，头戴有黄色花纹的棕色贝雷帽，两侧垂着兔耳。\n她有着一双红色的眼瞳。\n她上身穿着橘色短袖，领子为白色褶子，两袖有绿色镂空装饰，衣服上有橘红色花纹。在人妖名鉴中，上衣颜色接近裤子的黄色。\n她下身穿着黄色南瓜裤，有白色藤状花纹，腰口打着白色褶子。\n裸足。\n她手里总是拿着一串团子。在绀珠传中，另一只手拿着五颗团子。\n",
    relationships: "铃瑚与清兰曾经是地面调查部队Eagle Rabbit的战友，现在是卖团子的同行。\n她与铃仙·优昙华院·因幡是前战友，曾经均在月之都服役，且两人互相认识。\n她与Reisen曾是同属月之都的战友且互相认识，曾从Reisen口中听说博丽神社。[绀珠传]\n"
  },
  {
    id: "Kagiyama Hina",
    name: "键山雏",
    alias: [
      "转转",
      "不认识的孩子"
    ],
    introduction: "键山雏是东方Project系列中的官方角色，首次登场于东方风神录，担任风神录的二面Boss。\n她是厄神，疫病神的一种[口授]，实际上不是普通的神明而是一种妖怪。\n因为能力的原因，提起她的名字会变得不幸。\n因为初登场时在不停旋转，她又被爱好者们称为“转转”。\n她的性格十分开朗且平易近人，尽管是一种疫病神，却待人友好，对人类完全没有恶意。[口授]\n在风神录之后，她在官方游戏与出版物中登场次数不多，而且跟剧情往往没有什么联系。\n",
    lifestyle: "雏为了厄运不再回到人类，通过回收顺流而下的雏人偶，收集并看守着厄运，最终将其交诸众神[风神录]。\n她与人类的接触很少。[口授]\n她的住所都是一些雏人偶。[口授]\n她会将回收的雏人偶反卖给人类村落。[口授]\n",
    abilities: "雏拥有储存厄运程度的能力，能储存通过消灾而被除掉的厄运。\n",
    appearance: "雏有着一头绿色及胸长发，头上扎着红色丝带，胸前两股头发也用红色丝带收为一股，丝带打着白色褶子。\n她有着绿色眼瞳。\n她身穿上黑下红的短袖连衣裙，裙摆有白色荷叶边，裙子左侧有绿色的“厄”字花纹。两肩挂着白色布料，用红色丝线连在一起。左手也缠着有白色褶子的红色丝带。\n她脚穿黑色长靴，鞋带为红色。\n",
    relationships: "暂无相关资料"
  },
  {
    id: "Yin-Yang Orb",
    name: "阴阳玉",
    alias: [],
    introduction: "\n",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Yuki",
    name: "雪",
    alias: [
      "黑之魔法使"
    ],
    introduction: "\n",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Kirisame Marisa",
    name: "雾雨魔理沙",
    alias: [
      "黑白",
      "东洋魔女",
      "黑白老鼠"
    ],
    introduction: "雾雨魔理沙是东方Project系列官方作品的第二主角，也是东方系列除博丽灵梦外的另一代表角色。初登场作品为东方封魔录，担任封魔录的四面Boss；新作初登场作品为东方红魔乡，担任红魔乡的自机。\n她的种族是人类，职业是魔法使。\n虽然看上去很别扭[风神录设定文档]，但她容易亲近、有人情味[幻想揭示板]，和她一起会很有意思，让人心情愉快[史纪]，并且性格争强好胜[永夜抄Manual]不服输[萃梦想设定文档]。虽然她稍有些扭曲[地灵殿设定文档]、乖僻[红魔乡设定文档]、爱戏弄人[史纪]和心术不良，本性却很正直[萃梦想设定文档]。她虽然头脑很灵活[红魔乡Manual]，态度看起来也很轻浮，但其实是个爱操心、认真的努力家[大东方展]类型的人。\n从东方梦时空开始，魔理沙一直作为大部分官方游戏可使用的自机角色登场，在所有官方出版物中也都是主角或常驻角色。她贯穿了东方系列的几乎整个故事线，是东方剧情中最重要的角色之一。\n",
    lifestyle: "魔理沙经营着位于魔法森林内的“雾雨魔法店”，她的家雾雨邸就是店铺。\n她同时也居住在雾雨邸，在有工作或异变发生时则会出现在幻想乡内的各个地方乃至幻想乡外的世界中。\n由于魔法店的位置，找到这家店十分困难。[文果真报]\n她平日里埋头于魔法研究，也经常出入博丽神社。尽管经常出门[永夜抄设定文档]，却自认为是个家里蹲[兽王园]。\n她比较怕冷。[大东方展]\n她有收集癖，且在年年加重[妖妖梦设定文档]。\n她经常小偷小摸。\n她会使用魔法扫帚、迷你八卦炉、自制魔导书等等道具。\n",
    abilities: "魔理沙拥有使用魔法程度的能力，早期也被描述为操纵魔法程度的能力和主要拥有使用魔法程度的能力。\n她拥有速度和力量，但却不擅长体术。移动很迅速，无奈招数迟钝。她通过在魔法上增加必要以上的力量来弥补。[萃梦想设定文档]\n虽说主要使用魔法，但是她力气很大，甚至曾抱着石头婴儿与牛崎润美战斗，并被润美夸赞臂力惊人[鬼形兽]。\n她体力远超一般人，是鬼形兽的三个自机中唯一一个打败骊驹早鬼后没有感觉到疲惫的角色[鬼形兽]。\n她能闻出血的味道等“战场的味道”。[茨歌仙]\n",
    appearance: "魔理沙身高是十多岁的样子，属于身高较低组[ZUN的邮件答复]。\n魔理沙有着一头金色卷发，长度从及肩到及腰不等。在有的作品中，一侧用蝴蝶结扎着麻花辫，所用的蝴蝶结颜色及位置也因作品而异。头戴巨大的黑色三角巫师帽，帽子上有白色、紫色、粉色或红色（花映塚2P）大蝴蝶结，在兽王园中蝴蝶结外白内粉，形似猫耳，在大战争中帽子上还有黄色星星装饰，在星莲船中帽子上则饰有红色星星和扫帚形装饰。\n她的瞳色在虹龙洞及之前的作品中为黄色，在黑市、兽王园中为红色。\n她在大部分作品身穿黑色连衣裙，在红魔乡中外穿着白色全围裙，之后的作品除了地灵殿和星莲船都披着白色半围裙，在星莲船中披着米黄色围裙并有“M”形图案，在鬼形兽中连衣裙裙摆有紫色猫爪印图案，围裙左侧有紫色猫又图案。衣领前有时会系着领结或者绳子。她裙子里穿白色衬衫，裙下穿着白色灯笼裤，冬天会穿一件黑色或白色的披肩。在天空璋中，戴着粉色的围巾和短手套。她深信着魔法使穿黑衣服的理由是因为黑衣服就算脏了也不容易看出来[风神录角色设定]。\n她脚穿白色袜子，长短从短袜到四分之三袜（漫画中也穿过黑色过膝袜等其他袜子）。她有时不穿鞋，穿鞋时穿的鞋有黑色乐福鞋、黑色玛丽珍鞋、棕色靴子、黑色靴子。\n以上的黑色在一些作品中其实是深蓝色，但是在描述中仍称为黑色。[地灵殿设定文档]\n她手里常拿着八卦炉，也会拿扫帚甚至魔杖（星莲船）。\n她常常坐在扫帚上。\n",
    relationships: "魔理沙是家族中的独女，她的父亲是人类村落中大道具屋雾雨店的主人[史纪]。\n在她与自己的家族断绝关系时，曾在雾雨家修行的森近霖之助为她制作了魔法道具迷你八卦炉。[香霖堂6话]\n魔理沙与博丽神社的巫女博丽灵梦私交甚密，是博丽神社的常客，但是魔理沙日常来神社只是为了找灵梦玩，因此并不会进行参拜与投入赛钱。\n红雾异变过后，魔理沙常会去红魔馆的大图书馆偷书，被帕秋莉·诺蕾姬称为“老鼠”[萃梦想]。\n作为人类村落中的借书屋铃奈庵的店主女儿兼店员，本居小铃和魔理沙也很熟络。[铃奈庵]\n同为魔法森林的魔法使住客，魔理沙经常到爱丽丝·玛格特洛依德家串门。\n魔理沙与独居在魔法森林中的地藏魔法使矢田寺成美关系也不错。\n三头慧之子目击了魔理沙过去哭着逃进魔法森林的场面。而魔理沙之前就知道有一只白色的山犬逃进了魔法森林里，并经常在魔法森林里看见她[兽王园]，对她很熟悉。\n魔理沙解决异变时，会遭遇到各式各样的妖怪和人类，有的时候会发生战斗，有的时候则会互相协助。\n比如河城荷取曾在东方地灵殿里为其提供协助，古明地恋曾于东方凭依华中与其组队。\n隐岐奈也十分欣赏魔理沙，有将魔理沙纳为部下的想法，但被魔理沙拒绝[东方天空璋]。\n由于魔理沙丰富的人际关系，在二次创作中，以魔理沙和他人的关系为基础展开的创作类型也十分兴盛。\n"
  },
  {
    id: "Kaku Seiga",
    name: "霍青娥",
    alias: [
      "青娥娘娘",
      "娘娘"
    ],
    introduction: "霍青娥是东方Project系列中的官方角色，通称“青娥娘娘”，首次登场于东方神灵庙，担任神灵庙的四面Boss。\n她是邪仙，是少有的活了一千年以上的仙人，因为思考和性格过于邪恶被断绝了成为天人的可能性。\n性格非常邪恶，只要对自己有利，身边的人类变成怎样都无所谓。\n在神灵庙之后，青娥在官方游戏中登场次数不多，在官方出版物中偶有出场。\n",
    lifestyle: "青娥对穿墙的能力感到相当满足，因此对于其他仙术的修行并不热心。[口授]\n在神灵骚动前，她待在地底[茨歌仙]。在神灵骚动后，她从地底出来，生活在幻想乡中。\n她在幻想乡里每天都到处晃荡嬉玩，看见感兴趣的人类和妖怪就会立即拉拢他们。[口授]\n",
    abilities: "青娥拥有穿越墙壁程度的能力。\n她能制造僵尸，并能通过在额头上贴符完全控制僵尸。\n作为仙人，她具有足以对抗来索命的地狱使者的力量。\n",
    appearance: "青娥有着一头深蓝色及肩短发，略卷，把用来穿墙的凿当成簪子，在脑后扎成双环。\n她有着深蓝色的眼瞳。\n她身穿青蓝色短袖连衣短裙，上面有红色和黄色的花图案，袖口和裙摆打着褶子。她上身披着一件白色汗衫，有着蓝色花纹。\n她腰上用带三篇叶子的桃花系着腰带，腰带在神灵庙中为黑色，在人妖名鉴中为白色。\n她两条小腿上各用红绳绑着一张符，脚穿白色短袜和黑鞋，鞋在口授中为喇叭口短靴，在人妖名鉴中为船鞋。\n她身旁缠绕着白色羽衣。\n",
    relationships: "青娥使用道术把一具日本古代尸体做成宫古芳香，通过在额头上贴符操纵芳香，对芳香有所有权，不给予芳香人权。\n青娥听说丰聪耳神子的功绩后，劝她表面信仰佛教，暗中信奉道教，被神子采纳。\n"
  },
  {
    id: "Luna Child，",
    name: "露娜切露德",
    alias: [
      "露娜切云德",
      "露娜柴尔德",
      "露娜切尔德",
      "露娜洽尔德"
    ],
    introduction: "露娜切露德是东方Project系列中的官方角色，首次登场于东方三月精E，担任三月精系列的主要角色。\n她是月光妖精，与桑尼米尔克、斯塔萨菲雅合称为光之三妖精，是光之三妖精中最接近妖怪的[月之妖精]。\n她名字的语源是月见草。[上海爱丽丝通信]\n她性格迟钝[史纪]，同时又有着爱讲理的性格，无论碰上什么事总要抱怨几句。她还是光之三妖精中最冷酷的一个，并会在什么地方迷上人类等不自然的东西[上海爱丽丝通信]。\n除三月精外，露娜还作为Boss登场于妖精大战争中，在其他官方出版物中也时有出场。\n",
    lifestyle: "光之三妖精一起住在魔法森林之中的“自亘古以来便矗立着的大树”[上海爱丽丝通信]内三妖精的家中，后光之三妖精搬家到位于博丽神社内外分界线[三月精S]的大水楢树[三月精O]中。\n光之三妖精会一起进行恶作剧，但三人没什么配合[上海爱丽丝通信]。露娜因为能力在其中担任主力，因此通常由她殿后，由于她很迟钝并过于依赖消音能力也通常是她被落单和抓住[上海爱丽丝通信、史纪]。\n她常在夜晚单独活动。[史纪]\n她想把自己的房间变成“地上的月亮”，为此她会在十六日之夜1外出收集从月亮上掉落的东西。[三月精E]\n她有阅读报纸《文文。新闻》的习惯。\n在认真地读书时，她会戴上眼镜。[三月精O]\n",
    abilities: "露娜拥有消除周围声音程度的能力。\n她可以在月光之中恢复。[上海爱丽丝通信]\n",
    appearance: "露娜身高很低，不到一米[上海爱丽丝通信]。\n她有着一头稻草黄及肩短发，两侧各有三个螺旋状发辫，戴着两侧各系着两个黑色蝴蝶结的白色帽子。\n她有着红色的眼瞳，在人妖名鉴中她的嘴型为经典的栗子嘴。\n她身穿白色及踝连衣裙，在大战争和人妖名鉴中有宽松的长袖且袖摆有一圈黑线，在史纪中为短袖。裙子正前方有一列黑色蝴蝶结，裙摆打着褶子，在大战争和人妖名鉴中为黑色，在史纪中为白色。\n她身后长着两对蜻蜓般的翅膀[史纪]，形状像是新月。\n在大战争和人妖名鉴中，她身后系着黑色大蝴蝶结。\n她脚穿白色拖鞋与同一颜色的中筒袜。\n",
    relationships: "露娜与桑尼米尔克、斯塔萨菲雅合称为光之三妖精，三个妖精同居在一起，也往往共同行动。\n光之三妖精经常一起在博丽灵梦身上搞恶作剧。\n光之三妖精先后在恶作剧与玩乐中结识了琪露诺、克劳恩皮丝、爱塔妮缇拉尔瓦等妖精，并在结识后会不时叫上她们中的一位或几位一起行动。\n"
  },
  {
    id: "Lunasa Prismriver",
    name: "露娜萨·普莉兹姆利巴",
    alias: [
      "骚灵大姐",
      "提琴手",
      "骚灵三姐妹"
    ],
    introduction: "露娜萨·普莉兹姆利巴是东方Project系列中的官方角色，首次登场于东方妖妖梦，担任妖妖梦的四面Boss。\n她是蕾拉·普莉兹姆利巴创造的骚灵，是吵闹、喜欢举办音乐会的灵体。\n她冷静阴沉，话不多[妖妖梦角色设定]。同时，她性格坦率，按部就班地做事，因而容易被欺骗[妖妖梦角色设定]。\n在妖妖梦之后，露娜萨还作为自机登场于东方花映塚中。\n",
    lifestyle: "露娜萨生活在雾之湖附近的废弃洋馆中。\n她在普莉兹姆利巴乐团解散前是普莉兹姆利巴乐团的领队，在乐团中演奏小提琴，常被邀请去妖怪们的聚会进行演出[史纪]。\n普莉兹姆利巴乐团解散后三姐妹均加入堀莉兹姆利巴乐团，露娜萨仍演奏小提琴。\n她是做什么都很出色的优等生类型。不论对待什么事都不喜欢拐弯抹角，会堂堂正正地一决胜负。[妖妖梦角色设定]\n",
    abilities: "露娜萨拥有不用双手操控就能演奏乐器程度的能力和演奏忧郁之音程度的能力，演奏的音乐能让人情绪低落，变得什么事都不想做，心情很忧郁[史纪]。\n尽管性格冷静，她的噪音等级却相当高，甚至连玻璃都能震碎[文花帖（书籍）]。\n她很强。[妖妖梦角色设定]\n",
    appearance: "露娜萨属于身高较低[ZUN的邮件答复]的角色，身高和十几岁的人类少女差不多，外表和人类没有区别[史纪]。\n她有着一头金色齐肩，中分刘海的短直发。头戴黑色圆锥形帽子，边缘折回且打着白色褶子。帽子前端有一条裂口，顶端有红色月牙形装饰。\n她有着金色的眼瞳。\n她上身穿着白色衬衫和黑色马甲。马甲上扣着红色扣子，领子边缘打着白色褶子。\n她下身穿着黑色卷裙，裙子左侧也扣着红色扣子。马甲的下摆、裙子的末端、领子边缘的褶皱上同样各有一条白色条纹。马甲和裙子的黑色条纹上方各有一圈红色“ω”形图案。\n她脚穿白色短袜，在妖妖梦立绘中不穿鞋，（妖妖梦小人图和花映塚则是穿缀有红色圆珠的黑色皮鞋）在史纪、凭依华和人妖名鉴中穿没有红珠的黑色鞋子。\n她身旁经常悬浮着一把小提琴，传说是连斯特拉迪瓦里都自愧不如的名器幽灵[史纪]，但不知真假。\n露娜萨的2P色将白色改为黑色。\n",
    relationships: "露娜萨是骚灵三姐妹中的长女，梅露兰·普莉兹姆利巴、莉莉卡·普莉兹姆利巴的姐姐。也是三人组成的普莉兹姆利巴乐团的领队[史纪]，两个妹妹都按照她的命令行事[文花帖（书籍）]。\n在普莉兹姆利巴乐团解散后三姐妹均加入堀莉兹姆利巴乐团，以堀川雷鼓为队长。[文果真报]\n"
  },
  {
    id: "Louise，",
    name: "露易兹",
    alias: [
      "露易丝",
      "路易丝"
    ],
    introduction: "\n",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Rumia",
    name: "露米娅",
    alias: [],
    introduction: "露米娅是东方Project系列中的官方角色，首次登场于东方红魔乡，担任红魔乡的一面Boss。\n她不仅是新作中第一个登场的boss，她的符卡夜符「Night Bird」（夜中鸟）也成了东方的第一张符卡[ZUN的人气投票记录]。\n她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "露米娅一般行动时用黑暗包裹着自己，因此她看不见外界，外界也看不见她，常常因为这样而自己撞到树上[史纪、文花帖（书籍）]。\n她讨厌阳光，因为对阳光不适，只要被阳光晒到了，皮肤就会觉得烧得慌，然后脑袋空空，最后还会发困[文花帖（书籍）]；但月光就没有问题，因而在新月的夜晚常常能遇见没有展开黑暗的露米娅。\n",
    abilities: "露米娅拥有操纵黑暗程度的能力。\n",
    appearance: "露米娅属于身长低[ZUN的邮件答复]的角色，有着年幼少女的外表[史纪]。\n她有着一头黄色及肩短发，头顶左侧系着一条红色丝带，丝带其实是自己无法解除的灵符[红魔乡设定文档]。\n她有着红色的眼瞳。\n她上身穿着白色长袖衬衣和黑色无袖外衣，系着红色领带。\n她下身穿着黑色长裙，在求闻史纪、人妖名鉴中有白色褶边。\n在求闻史纪中，她脚穿白色及膝袜和皮鞋。在人妖名鉴中，她脚穿白色三折袜和红色皮鞋。\n她在立绘中总是双手张开。\n",
    relationships: "暂无相关资料"
  },
  {
    id: "Kazami Yuka",
    name: "风见幽香",
    alias: [
      "花妈"
    ],
    introduction: "\n风见幽香是东方Project系列中的官方角色，初登场作品为东方幻想乡，担任幻想乡的五、六面Boss1；新作初登场作品为东方花映塚，并且在新作中由原有的名字“幽香”变更为“风见幽香”。本条目仅说明花映塚登场后的幽香，在旧作中登场的幽香请参考幽香。\n她是十分强大与危险的妖怪，但稗田阿求认为她与其说是花之妖怪更像是自然的化身。\n在花映塚之后，她在官方游戏与出版物中登场次数不多，而且跟剧情没有什么联系。\n",
    lifestyle: "幽香生活在太阳花田，会消灭一切闯入打扰的人类和妖怪。由于活得久，她最近很少离开花田周围活动[史纪]。\n她非常喜欢季节性开放的花朵，一年四季都生活在被自然的花包围的场所，以一年内所有时间都有花开放为目标而努力[史纪、花映塚设定文档]。\n她非常喜欢折磨人的精神[史纪]，但作为强大的妖怪，对同样拥有强大力量的妖怪或者拥有特别能力的人类[史纪]”以外的人不感兴趣，并且通常平时表现得很绅士[史纪]。\n",
    abilities: "幽香拥有操纵花朵程度的能力，能让花盛开、使向日葵面向太阳、让枯萎的花再度盛开等[史纪]。\n作为本身就是有纯粹的高等妖力和身体能力优秀的，妖怪中的妖怪[史纪]，这种能力只不过是她的附属物而已。\n在战斗中，她使用伞放出飞散的花这般优雅的攻击方式，比起妖术和魔法这类的精神攻击，更多的会用拥有压倒性力量的物理攻击[史纪]。\n",
    appearance: "幽香有着一头绿色齐肩卷发。\n她有着红色的眼瞳。\n她上身穿着白色长袖衬衫和红色与暗红色格子交错的马甲，戴黄色领巾。\n她下身穿着同为红色与暗红色格子交错的及膝裙，在花映塚中裙子左侧有一朵雏菊，上方排列着四个黄色纽扣；在求闻史纪中雏菊和纽扣在正前方，且菊花在从上数第三个纽扣和第四个纽扣之间；在人妖名鉴中则没有雏菊和纽扣。\n她脚穿棕色长靴。\n她手持一把洁白的、略带淡绿色的阳伞。\n",
    relationships: "暂无相关资料"
  },
  {
    id: "Toutetsu Yuma，",
    name: "饕餮尤魔",
    alias: [],
    introduction: "饕餮尤魔是是东方Project系列中的官方角色，于东方鬼形兽中首次被提及1，正式登场于东方刚欲异闻。\n她是饕餮的动物灵，是从空中、或是利用压倒性的身体大小，从俯瞰视角进行战斗的动物灵组织“刚欲同盟”的盟主。\n她的设计参考了中国古代传说中的凶兽——饕餮。她的立绘剪影出现在了刚欲异闻的封面上。\n她是贪婪的大胃王，尤为擅长卑鄙狡诈的手段，拥有与外表不相符的智谋和冷静，将刚欲同盟的信条定为“坐收渔利”，但却总想亲力亲为。同时，她的性格也会被吞下的事物影响。[刚欲异闻设定文档]\n在刚欲异闻之后，尤魔还登场于东方兽王园中。\n",
    lifestyle: "她是畜生界的组织：刚欲同盟的盟主[刚欲异闻设定文档]，以自己的方式率领刚欲同盟与其他动物灵组织互相争斗，企图支配畜生界。\n在东方刚欲异闻中，她盯上了旧血池地狱，最终与摩多罗隐岐奈合作，成为了旧血池地狱的管理者。\n",
    abilities: "尤魔拥有什么都能吸收程度的能力。\n",
    appearance: "尤魔有着一头蓬松卷曲的及肩白发，头上长着一对红色的卷曲的角，各系有一个蓝色的蝴蝶结，在刚欲异闻中蝴蝶结上有白色眼状图案，在兽王园中蝴蝶结边缘有白色饕餮纹。\n她有着红色的、如山羊般横着的方形眼瞳，长着尖耳，在刚欲异闻中上双耳戴着金色耳环，在兽王园中右耳带子红色耳环，在刚欲异闻中还长着锯齿状牙齿。\n她身穿蓝色无袖连衣裙，连衣裙边缘有白色饕餮纹；裙摆及膝，上有左右两个白色眼状图案和大量饕餮纹，边缘有荷叶边；领子中间有一个圆形银色大扣子，在刚欲异闻中胸前为两条红色一字扣，在兽王园中胸前为两个银色扣子，形状上者为勺下者为叉。肩上在裙内披着红色披肩，边缘有饕餮纹，在刚欲异闻中为白色，在兽王园中为黑色。\n她下身在裙内穿着白色灯笼裤。\n裸足。\n她左手拿着巨大的银色叉勺，在刚欲异闻中勺柄有蓝色饕餮纹。\n",
    relationships: "尤魔是畜生界动物灵组织“刚欲同盟”的盟主，大鹫灵是她的下属。\n她与吉吊八千慧为首的“鬼杰组”、骊驹早鬼为首的“劲牙组”等动物灵组织敌对，互相争夺畜生界的占有率。\n她与占据灵长园的埴安神袿姬、杖刀偶磨弓敌对，为了对抗而选择与其他动物灵组织合作。\n在旧血池地狱遇到天火人血枪之后，血枪和尤魔立刻就意气相投，随后血枪加入尤魔的刚欲同盟。\n尤魔和八云蓝是曾在畜生界一起生活的旧识，当时八云蓝还是动物灵，名字叫“蓝”。动物灵蓝因为厌倦了畜生思想而离开。[兽王园]\n"
  },
  {
    id: "Iizunamaru Megumu",
    name: "饭纲丸龙",
    alias: [
      "大天狗",
      "阿龙",
      "龙龙"
    ],
    introduction: "饭纲丸龙是东方Project系列中的官方角色，首次登场于东方虹龙洞，担任虹龙洞的五面Boss。\n她是大天狗，是天狗社会的管理者，鸦天狗的老大。\n为了天狗社会的发展而深谋远虑，会十分冷酷地利用他人，当合作者威胁到天狗社会时也会毫不迟疑地抛弃。\n在虹龙洞之后，龙还登场于弹幕狂们的黑市中，在官方出版物中也偶有出场。\n",
    lifestyle: "龙住在妖怪之山山顶附近，统率着鸦天狗。\n她可以向普通天狗发布绝对的命令，也可以向山里其他妖怪指派命令，但后者可能被违抗。\n尽管拥有这样命令别人的权力，但由于承担着发展、维系天狗社会的义务，她基本上不会为了一己私利下达命令。\n她会用三脚架打手下的鸦天狗。[东方Station]\n",
    abilities: "龙拥有操纵星空程度的能力。\n此外，她还能用龙珠制造能力卡牌，且还能在卡牌上设置机关，使仅限在集市之神的力量下交易的卡牌，才能被补充魔力而显现能力卡牌的能力。\n",
    appearance: "龙有着一头深蓝色及胸长发，头戴小型蓝色五角帽（头襟）。\n她有着红色的眼瞳。\n她身穿蓝色及膝连衣裙，袖子到小臂中部。裙子有着松松垮垮的白色领子，袖口和裙摆有白色短线，裙摆打着白色褶子。腰上缠着白色丝带。\n她身体左侧披着黑色披风，边缘有着白色短线，挂着白色绒球，腰间系着两条交叉的金色细线固定。左肩戴着金色肩甲，上面镶嵌着蓝色宝石。\n她脚穿黑色四分之三袜和紫色的一齿木屐。\n她右手扛着三脚架。\n",
    relationships: "龙作为鸦天狗的首领，是射命丸文、姬海棠果的上级。\n龙可以对包括文、果以及犬走椛在内的普通的天狗下命令，这种命令是绝对的[虹龙洞设定文档]。\n龙利用了天弓千亦以在集市中捞上一笔，而千亦也想利用与龙的合作取回神的力量。\n龙和姬虫百百世是亲友，她不厌恶与百百世相会。龙在百百世挖出龙珠时，与百百世进行交易，百百世接受开山挖掘虹龙洞的龙珠的职责，报酬是挖出的一部分龙珠，而剩下的交给龙制作能力卡牌。\n菅牧典是龙可靠的助手，主持龙和千亦之间的交涉。龙、千亦对典信赖备至，会找典询问各种意见，因此得到了金钱上的恩惠。\n"
  },
  {
    id: "Komakusa Sannyo",
    name: "驹草山如",
    alias: [
      "驹草太夫",
      "驹草大夫",
      "华子姐"
    ],
    introduction: "驹草山如是东方Project系列中的官方角色，通称“驹草太夫”，首次登场于东方虹龙洞，担任虹龙洞的三面Boss。\n她是山女郎，喜欢烟草的山中妖怪，在妖怪之山开办了一家赌场。\n在虹龙洞之后，山如在官方游戏中再未出场，在官方出版物中时有出场。\n",
    lifestyle: "山如栖息于妖怪之山的高地伪天棚。\n她在山上面向天狗、山童和河童们开办赌场，以赌博的庄家为生计。[虹龙洞设定文档]\n此外，为了防止闲杂人员进入遇到危险，她也负责看守虹龙洞。[虹龙洞]\n",
    abilities: "山如拥有以烟草的烟操纵精神程度的能力。\n",
    appearance: "山如有着一头淡紫色及胸长发，用黄色丝带在脑后扎成单马尾。\n她有着红色的眼瞳。\n她上身穿着红色长袖外套和右衽暗红色上衣，领子和门襟为黑色，外套衣摆上有重叠的黄色蔓草纹。\n她下身穿着多层的紫色及膝裙，裙摆上有重叠的淡紫色蔓草纹。\n她赤脚踏着一双深棕色木屐。\n她左手持金色折扇，扇柄有金色穗子；右手持龙形长烟管。\n",
    relationships: "暂无相关资料"
  },
  {
    id: "Kurokoma Saki",
    name: "骊驹早鬼",
    alias: [
      "天马"
    ],
    introduction: "骊驹早鬼是东方Project系列中的官方角色，首次登场于东方鬼形兽，担任鬼形兽的EX面Boss。\n她是骊驹的动物灵，是拥有强健的脚力、獠牙和肉体的动物灵组织“劲牙组”的组长。\n她的设计参考了传说中曾载圣德太子飞越富士山的“甲斐黑驹”和希腊神话中的天马“珀加索斯”（Pegasus）。她的立绘剪影出现在了鬼形兽的封面上。\n她崇尚实力，热衷于正面对决，对于自己的实力非常自信，甚至可以说是盲目自大，对于吉吊领导的“鬼杰组”背后袭人的战斗方式则非常鄙夷。\n她认为劲牙组是畜生界第一的最强最快的组织[鬼形兽]。\n她非常尊敬有实力的人，与自机们交手后都表达出想将自机招纳入劲牙组的欲望[鬼形兽]。\n但是她头脑并不是很灵光，被其他动物灵评价为“肌肉笨蛋”，劲牙组也被评价为“肌肉笨蛋组织”[东方鬼形兽]。\n她有着强烈的野心和扩张欲望，不仅想要支配畜生界，还觊觎着人界。\n她做出决定就会立即行动，尊重部下的想法和功绩，作为上司还算比较受欢迎。[鬼形兽设定文档]\n她喜欢自称为漆黑的天马，遇谁都要强调一次[鬼形兽]。\n在鬼形兽之后，早鬼还登场于东方兽王园中。\n",
    lifestyle: "早鬼平时居住在畜生界，作为动物灵组织“劲牙组”的组长[鬼形兽设定文档]率领劲牙组与其他动物灵组织互相争斗，企图支配畜生界。\n与其他动物灵组织一样，她以及她领导的劲牙组把人类灵当作奴隶进行奴役。\n同时，依附于组织生存的动物灵也都是组织的奴隶[鬼形兽]，并且早鬼在工作方面对部下很黑心[鬼形兽设定文档]。\n她会为了遇到强者而频繁到地面上。[黑市]\n她会精心保养她引以为傲的黑发和黑色羽翼。[人妖名鉴]\n",
    abilities: "早鬼有着拥有无双脚力程度的能力。\n早鬼拥有强健的肌肉和力量，一旦开始攻击就不会停手。这也是劲牙组共通的战斗风格。\n另外，动物灵能够凭依、占据其他人的身体。\n",
    appearance: "早鬼实际身高比她给人的印象要矮[人妖名鉴]。\n她有着一头黑色及膝长发，在身体侧后方绑成长马尾，头上戴着深棕色牛仔帽。\n她有着红色的眼瞳。\n她身穿形似骑马服和牛仔服的短袖连衣裙，颜色自上到下分别为蓝、粉、棕，分界处有上蓝下黄的锯齿状和三角形图案，蓝色部分有白色网状细纹，棕色部分有深棕色格子图案，中间开衩。脖子上系着打结的围巾，在鬼形兽、人妖名鉴中为绿色，在兽王园中为白色。\n她背后长着一对巨大的黑色翅膀，翅膀上没有羽毛[兽王园]。\n她下身内穿黄色短裙。\n她身后有一条黑色马尾巴。\n她脚穿棕色长筒靴，在人妖名鉴中脚后跟有马刺。\n",
    relationships: "早鬼是畜生界动物灵组织“劲牙组”的组长，野狼灵是她的下属。\n她与吉吊八千慧为首的“鬼杰组”、饕餮尤魔为首的“刚欲同盟”等动物灵组织敌对，互相争夺畜生界的占有率。\n她与占据灵长园的埴安神袿姬、杖刀偶磨弓敌对，为了对抗她们而一度选择与其他动物灵组织合作。\n日白残无向她介绍了三头慧之子，早鬼便把慧之子招揽为新的部下，任命她为劲牙组地上分队队长[兽王园]。\n她是丰聪耳神子的马。[兽王园]\n"
  },
  {
    id: "Komano Aunn，",
    name: "高丽野阿吽",
    alias: [],
    introduction: "高丽野阿吽是东方Project系列中的官方角色，首次登场于东方天空璋，担任天空璋的三面Boss。\n她是狛犬，不过其实她同时拥有狮子和狛犬两种性质，是二位一体的神兽。\n她十分冷静，身为神兽内心的狂暴和平和能够共存。\n在天空璋之后，阿吽还作为自机登场于东方兽王园中，在官方出版物中也时有出场。\n",
    lifestyle: "阿吽会找出、赖在并自说自话地守护可能聚集人类信仰的场所。\n她平时不会显现出身姿，只有持有敌意的人出现的时候才会现身攻击，但是因为并不强所以经常输。\n每到夏天她就特别招青蛙喜欢。[兽王园]\n自从在四季异变中现身之后，阿吽常驻于博丽神社，并代替了灵梦进行扫地等日常工作[东方醉蝶华]。\n",
    abilities: "阿吽拥有发现神佛程度的能力。\n作为二位一体的神兽，她可以分成两人，但分身只能做相同的动作，且长时间保持分身会很累。[GoU]\n她并不是很强，所以经常输。[天空璋设定文档]\n而在弹幕狂们的黑市中，通过阿吽的能力卡能进行“阿吽的呼吸”来缩短魔方阵的冷却时间。[弹幕狂们的黑市]\n",
    appearance: "阿吽有着一头绿色及臀长发，刘海和及肩的头发为形似鬃毛的卷发，头顶长着一只灰色的独角。\n她有着绿色的眼瞳，耳朵为灰色勾玉状。\n她上身穿着红底白纹的短袖衬衫，为琉球风格[天空璋访谈]。\n她下身穿着白底红纹的短裤，同样为琉球风格。\n她脚穿红色鞋带的木屐。\n她长着尾巴[天空璋Music Room]，但是仅在人妖名鉴中被画出一条绿色卷尾，而在天空璋和兽王园中均不可见。\n",
    relationships: "在四季异变后，阿吽与博丽灵梦一起住在博丽神社，且总是参加神社的宴会。\n她是摩多罗隐岐奈创造出的妖怪之一。[茨歌仙]\n"
  },
  {
    id: "Kijin Seija",
    name: "鬼人正邪",
    alias: [
      "邪正人鬼"
    ],
    introduction: "鬼人正邪是东方Project系列中的官方角色，首次登场于东方辉针城，担任辉针城的五面Boss和六面道中Boss。\n她是性格扭曲的天邪鬼，有着“为叛逆而叛逆”的天性，总想着和其他人相反的事情。\n她的野心是把幻想乡整个翻转过来，实现“下克上”，从而建立由弱者说了算的世界。\n在辉针城后，正邪还作为自机登场于弹幕天邪鬼中，作为主要角色登场于宇佐见的魔法书中，在其他官方游戏与出版物中则登场次数不多。\n",
    lifestyle: "正邪一天到晚想着和别人相反的事情且绝对不服从命令而被妖怪、人类都讨厌，但是她反而为此高兴。[辉针城设定文档]\n",
    abilities: "正邪拥有翻转一切程度的能力。\n",
    appearance: "正邪拥有一头翻翘的黑色短发，在辉针城、人妖名鉴中过肩，在天邪鬼中齐肩。在辉针城和人妖名鉴中，头发中间有一绺红色的挑染，在两侧、脑后有几绺白色的挑染；在天邪鬼中，红色挑染位于两侧和脑后，白色挑染位于中间和两侧。她头上还长着一双蓝灰色的小角。\n她有着红色的眼瞳。\n她身穿上身样式类似水手服的白色连衣裙，裙摆上从上到下有一行指向下方的深灰色箭头，一行指向上方的红色箭头以及一行指向下方的黑色箭头，在辉针城和天邪鬼中，裙摆边缘的黑色箭头内侧有一行白色虚线。裙摆内侧在辉针城中有一圈白色蕾丝，在人妖名鉴中有半透明内衬。在天邪鬼中，她系着蓝色领巾。\n她身后披着红色披肩，末端从上到下有指向下方的一行深红色箭头，一行指向上方的白色箭头以及一行指向下方的黑色箭头。\n后腰倒系着一个蓝色蝴蝶结，蝴蝶结两侧各有一行首尾相连的白色箭头，\n她的右手戴着一个黄色护腕。\n在辉针城和人妖名鉴中，她裸足穿一双一字型拖鞋，拖鞋带子在辉针城中为紫色，在人妖名鉴中为深蓝色，带子两侧各有一行首尾相连的白色箭头。在天邪鬼中为裸足。\n作为天邪鬼，她在辉针城、人妖名鉴中朝后站着并回头看，在人妖名鉴中立绘是倒着的。\n",
    relationships: "正邪为了下克上的野心而盯上少名针妙丸的万宝槌，于是利用与欺骗了针妙丸。两人共同发誓要复仇并建立弱者的乐园。\n"
  },
  {
    id: "Konpaku Youki",
    name: "魂魄妖忌",
    alias: [],
    introduction: "\n",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "暂无相关资料",
    relationships: "暂无相关资料"
  },
  {
    id: "Konpaku Youmu",
    name: "魂魄妖梦",
    alias: [
      "庭师",
      "Yo梦"
    ],
    introduction: "魂魄妖梦是东方Project系列中的官方角色，首次登场于东方妖妖梦，担任妖妖梦的五面Boss和六面道中Boss。\n她是人类和幽灵的混血，而且还是半人半灵，担任白玉楼的园艺师，并兼任冥界大小姐西行寺幽幽子的护卫和剑术指导。\nZUN在参加第二次（2003年）和第三次（2004年）东方人气投票时，均将角色部分的三张票之一投给了妖梦[ZUN的人气投票记录]。\n由于年龄尚小，性格认真直率而不成熟，脑子有些缺根筋[鬼形兽设定文档]，经常被人戏弄[永夜抄角色设定]。\n在妖妖梦之后，妖梦还作为自机登场于东方萃梦想、东方永夜抄、东方绯想天、东方非想天则、东方神灵庙、东方鬼形兽中，在官方出版物中也时有出场。\n",
    lifestyle: "作为白玉楼的园艺师，妖梦大多数时间位于冥界，主要负责庭院的巡逻和修剪工作，早晚都会各巡视一次庭院，有时也会外出购物或处理冥界事务。业余时间则会在白玉楼修行剑术。\n因为白玉楼的庭院十分广阔，并且栽种着大量的樱花[妖妖梦角色设定]，她每日的工作十分繁重[神灵庙角色设定]。\n本来她还是幽幽子的剑术指导，但现在仅仅过着园丁待遇的日子。[永夜抄Manual]\n另外，由于幽幽子表现出的吃货属性[永夜抄]，在二次创作中也常常有着妖梦作为白玉楼厨师负责幽幽子餐食的设定。\n",
    abilities: "妖梦拥有使用剑术程度的能力。\n半灵部分可以按照自身的意志活动，并且能放出一定规模的弹幕[GoM]。\n总之体术和妖术都是半吊子但很优秀的程度，保持了平衡[萃梦想设定文档]。\n她还能够以极高的速度进行移动，但似乎只能做短距离直线移动，且移动前必须进行准备[文花帖]。\n",
    appearance: "妖梦的外表是十多岁的少女，属于身高较低的角色[ZUN的邮件答复]。\n她有着一头银白色及肩短发，梳成娃娃头，戴着黑色的丝带发饰。\n她的眼瞳在妖妖梦中或过度注视满月[永夜抄]后为红色，在萃梦想、永夜抄、花映塚、神灵庙、鬼形兽中为蓝色，在绯想天、非想天则、人妖名鉴中为青绿色。\n她上身穿着白色衬衫，在妖妖梦、花映塚中为长袖，在其他作品中为短袖。衬衫外面套着青绿色短褂，系着黑色领结。短褂左胸口有口袋和白色的幽灵状图案（鬼形兽中改为眼睛状）。\n除史纪、绯想天、非想天则、鬼形兽外，她背后背着两把黑色剑鞘。\n她下身穿着又短又宽的[香霖堂]青绿色裙子，裙摆边沿分布着白色幽灵状图案。裙下穿着白色灯笼裤。\n她脚穿白色短袜和黑色玛丽珍鞋，袜子在妖妖梦、史纪中有白色褶边，在人妖名鉴中为三折袜，在其他作品中为泡泡袜。\n她在永夜抄中手持长刀「楼观剑」在花映塚中手持短剑「白楼剑」，在史纪、鬼形兽中双手持剑，在萃梦想中右手持剑，在绯想天、非想天则中手持白楼剑鞘，左腰挂着楼观剑鞘。\n作为半人半灵的标志，幽灵半身有着白色的灵体外形，通常浮在人类半身旁边。\n妖梦的2P色，将青绿色改为绿色，将粉红改为蓝色。\n",
    relationships: "西行寺幽幽子是妖梦的主人。由于妖梦率真的性格，她总是被幽幽子牵着鼻子走甚至戏弄。\n魂魄妖忌是妖梦的祖父和剑术老师，也是前一代的西行寺家专属园艺师，在妖梦过于年幼时便隐居，连妖梦也不知道他在哪里[妖妖梦角色设定]。\n"
  },
  {
    id: "Mima",
    name: "魅魔",
    alias: [],
    introduction: "暂无相关资料",
    lifestyle: "暂无相关资料",
    abilities: "暂无相关资料",
    appearance: "灵异传：\n封魔录:\n梦时空：\n怪绮谈：\n幺乐团的历史4：\n",
    relationships: "暂无相关资料"
  },
  {
    id: "Kurodani Yamame",
    name: "黑谷山女",
    alias: [],
    introduction: "黑谷山女是东方Project系列中的官方角色，首次登场于东方地灵殿，担任地灵殿的一面Boss。\n她是土蜘蛛，因为能力而被人类厌恶，生活在地下。\n不过，她的性格开朗好战而有趣，因此在地下妖怪中很有人气。\n在地灵殿之后，山女又在东方刚欲异闻中作为敌机出场，而在官方出版物中少有出场。\n",
    lifestyle: "山女自称从出生起便被关在地下的旧地狱坐牢。[智灵奇传]\n她栖息于幻想风穴内，活动于旧都和洞窟底层，也会到旧地狱其他地方与其他连接旧地狱和地面的通道（如地灵虹洞）活动。\n夜里她会在地上出没，会悄悄地出来地上接受土木作业委托。[口授]\n她会私下挖通洞窟连接到地上，尽管这在旧地狱是重罪。[智灵奇传]\n",
    abilities: "山女拥有操纵疾病（主要是传染病）程度的能力。\n作为土蜘蛛，山女能将网一瞬间就结好，一瞬间拉到身边[GoM]。\n此外，她还擅长于建筑，心灵手巧又有力气[DS]。她有时也会悄悄地出来地上找活。主要会接受鬼、河童、天狗等的委托，然后在地上待过一晚就能把建筑物建好[口授]。\n",
    appearance: "山女有着一头黄色短发，脑后用黑褐色蝴蝶结系着一个发髻，在刚欲异闻中蝴蝶结上有黄色桁架图案。\n她有着红褐色眼瞳。\n她身穿褐色的钟形背带式连衣裙，形似蜘蛛膨大的腹部。裙子内穿黑色长袖。胸前有六粒黄色扣子。裙子上缠着黄色丝带，裙摆有荷叶边。在刚欲异闻中袖口也有黄色桁架图案。\n她脚穿白色短袜和黑色玛丽珍鞋。\n",
    relationships: "暂无相关资料"
  }
];
